{"C": {"Årskurs 1 (obligatoriska kurser)": [{"code": "EITA55", "name": "Kommunikationssystem", "points": "7.5", "year": "17/18", "registered": "47", "percentPassed": "60%", "teachingScore": "+2", "goalClearnessScore": "-23", "assessmentScore": "+20", "workloadScore": "+0", "importanceScore": "+76", "satisfactionScore": "+6", "comments": "KommentarerStudierådets kommentarerStudenterna ansåg att kursen kändes problematisk p.g.a. problem med kurshemsidan där det stod felaktig information angående datum samt uppgifter. Studenterna ansåg även att tentan var svårare i år än tidigare.Kurslärarens kommentererDen negativa trenden vad avser tentaresultatet har brutits. Detta är desto mer positivt då jag själv tycker att tentan var något svårare än tidigare år.Det var förvånande att se att alla staplar i sammanfattningfiguren blivit så negativa. Mötet kom dock överens om att det troligen beror på den mindre tydliga informationen och felaktigheterna på webbsidan. Ännu mer förvånande att inget om dessa problem meddelades kusrledning under kursen, när problemet kunde rättas till.Synkronisering mellan kursledning/lärare och labbhandledare behöver ses över.Programledarens kommentarerKursen fick sämre omdöme mot tidigare år utan någon egentlig kursförändring. Största missnöjet tycks ha orsakats av att informationen på kurshemsidan inte presenterades tydligt - vilket ska fixas till nästa år. I övrigt uppskattas både lärare, projekt, labbar och övningar.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."}, {"code": "FMAA05", "name": "Endimensionell analys", "points": "15.0", "year": "17/18", "registered": "839", "percentPassed": "51%", "teachingScore": "+1", "goalClearnessScore": "+27", "assessmentScore": "+50", "workloadScore": "-15", "importanceScore": "+57", "satisfactionScore": "+29", "comments": "KommentarerStudierådets kommentarerStudierådets kommentarer finns i rapporterna för specifika programKurslärarens kommentererKurslärarens kommenterer finns i rapporterna för specifika programProgramledarens kommentarerProgramledarens kommentarer finns i rapporterna för specifika programCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."}, {"code": "EXTA65", "name": "Kognition", "points": "4.5", "year": "17/18", "registered": "196", "percentPassed": "91%", "teachingScore": "+1", "goalClearnessScore": "-6", "assessmentScore": "+36", "workloadScore": "+51", "importanceScore": "+26", "satisfactionScore": "-1", "comments": "KommentarerStudierådets kommentarerStudierådets kommentarer finns i rapporterna för specifika programKurslärarens kommentererJag vill tacka för mycket användbar feedback på kursutvärderingarna. Kursen har precis bytt plats i utbildningssystemet och min läsning av kursutvärderingarna är att vi inte helt hittat rätt i våra förändringar av kursen - på vissa ställen har vi gjort det för lätt och på andra har vi inte förklarat och motiverat kursinnehållet tillräckligt väl. Detta ska åtgärdas till nästa kursomgång. Samtidigt har vi fått positiva kommentarer om att kursen var rolig att läsa och att den kändes relevant och det tackar vi så mycket för.Programledarens kommentarerProgramledarens kommentarer finns i rapporterna för specifika programCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."}, {"code": "FMAB20", "name": "Linjär algebra", "points": "6.0", "year": "17/18", "registered": "222", "percentPassed": "76%", "teachingScore": "-11", "goalClearnessScore": "+9", "assessmentScore": "+48", "workloadScore": "+3", "importanceScore": "+69", "satisfactionScore": "+19", "comments": "KommentarerStudierådets kommentarerStudierådets kommentarer finns i rapporterna för specifika programKurslärarens kommentererKurslärarens kommenterer finns i rapporterna för specifika programProgramledarens kommentarerProgramledarens kommentarer finns i rapporterna för specifika programCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."}]}}