{
  "C": {
    "Årskurs 1 (obligatoriska kurser)": [
      {
        "code": "FMAA01",
        "name": "Endimensionell analys",
        "points": "15.0",
        "year": "14/15",
        "registered": "49",
        "percentPassed": "41%",
        "teachingScore": "-10",
        "goalClearnessScore": "+51",
        "assessmentScore": "+63",
        "workloadScore": "+7",
        "importanceScore": "+69",
        "satisfactionScore": "+38",
        "comments": "Studierådets kommentarerKursen har varit väl utformad samt haft ett bra tempo.Det har ibland varit svårt att hänga med på föreläsningarna, vilket är ganska oundvikligt.Föreläsaren, har ibland haft svårt att få med publiken i engagemang och intresse. Det krävs en höjning i spänning och händelse på föreläsningarna för att det ska bli mer intressant än vad det redan är.Har varit ofta som vi gått igenom definitioner utan att riktigt koppla till dem, utan man har nöjt sig med att presentera definitionen vilket inte räcker till för förståelse. Ett förslag är att man integrerar definitionen i förklaringen av ett problem istället.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen fick denna gång klart bättre utvärderingsresultat än förra året. Glädjande är att kursen bedöms vara mycket relevant och studenterna är överlag nöjda. På CEQ-mötet erhöll kursansvarig feedback, och eventuella förbättringsåtgärder diskuterades.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMA15",
        "name": "Interaktionsdesign, grundkurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "48",
        "percentPassed": "83%",
        "teachingScore": "-14",
        "goalClearnessScore": "-10",
        "assessmentScore": "+6",
        "workloadScore": "+34",
        "importanceScore": "+58",
        "satisfactionScore": "-3",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommenterer- Kursen upplevs som angelägen av studenterna.- Vissa föreläsningar och pedagogiska metoder bör ses över eftersom de upplevs som otydliga av studenterna. - Inför nästa kursomgång Ht 2016 byter kursen årskurs ifrån åk1 till åk2. Det innebär att den går efter kursen kognition Tek210 (som läses i åk1). För att undvika överlapp med Tek210 har vi planerat in ett möte med kursledningen för tek210 i slutet av maj. Detta kan också innebära en möjlighet eftersom det är vissa saker som vi varit tvungna att ta med i MAMA15 för att lära studenterna de begrepp ifrån kognitionsområdet som de behöver för att förstå interaktionsdesign som vi förhoppningsvis kan slippa lägga tid på i framöver om de redan lärt sig dem i Tek210. Vår förhoppning är att denna förändring skall göra det möjligt att hålla MAMA15 mer fokuserad. - Inför nästa kursomgång trycks kursen också ihop ifrån två till en läsperiod. Det för med sig nya pedagogiska utmaningar då nuvarande upplägg är baserat på två läsperioder. Detta kommer att kräva att kursen arbetas om till viss del. Vi tittar på detta nu. Förändringar som kan vara aktuella som vi tittar på är 1) införande av digital lärande plattform, 2) olika alternativ till föreläsningar t.ex. flipped classroom, samt 3) ändrade examinationsformer t.ex. funderar vi på hur projektet och den individeulla inlämningsuppgiften skall utformas.Programledarens kommentarerKursen bedöms vara relevant vilket är glädjande. Den erhöll emellertid ett sämre utvärderingsresultat i år jämfört med förra året. Detta diskuterades på CEQ-mötet, samt dessutom de kursförändringar som kommer att ske pga att kursen kommer att ges i årskurs 2 fortsättningsvis. Tyvärr deltog inga kursombud på CEQ-mötet.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA01",
        "name": "Programmeringsteknik - fördjupningskurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "47",
        "percentPassed": "77%",
        "teachingScore": "+22",
        "goalClearnessScore": "+42",
        "assessmentScore": "+63",
        "workloadScore": "+14",
        "importanceScore": "+87",
        "satisfactionScore": "+65",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererDet är glädjande att så många är nöjda med kursen och finner den relevant för sin utbildning.De förändringar som gjordes inför kursomgången VT15 var: - Redovisning av inlämningsuppgiften i form av kamratgranskning. Detta har fungerat mycket bra. Studenterna får tillfälle att se och diskutera alternativa lösningar till en uppgift de själva löst. Ev. kommer även en av labbarna att kamratgranskas.- Övningar i sal har tagits bort p.g.a. besparingskrav, men övningsuppgifterna finns kvar i form av självstudieuppgifter. Jag planerar att lägga in frågestunder där man bl.a. ska kunna ställa frågor om övningsuppgifterna.Vårens kursomgång går under en läsperiod och arbetsbelastningen upplevs vara hög, speciellt i slutet av kursen. Jag ska se över de olika kursmomenten och försöka jämna ut arbetsbelastningen. Läsvecka 1 skulle t.ex. kunna användas mer.Programledarens kommentarerKursen upplevs som angelägen för utbildningen, vilket är glädjande. Sammantaget verkar kursen fungera mycket bra och studenterna är nöjda med de olika momenten.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSA01",
        "name": "Ingenjörsprocessen för programvaruutveckling - metodik",
        "points": "5.0",
        "year": "14/15",
        "registered": "46",
        "percentPassed": "89%",
        "teachingScore": "+45",
        "goalClearnessScore": "+19",
        "assessmentScore": "+45",
        "workloadScore": "+4",
        "importanceScore": "+61",
        "satisfactionScore": "+39",
        "comments": "KommentarerStudierådets kommentarerprojektet var bra och roligt! En nackdel med projektet var att de olika leverablerna hade olika arbetsbelastning. Leverablerna behöver vara mer utspridda och programmeringen behöver påbörjas tidigare i jämförelse med årets kurs.Tentamen var extrem på gränsen till det löjliga, genomsnittliga tiden som folk satt var 16 timmar vad jag hört. vi hade 30 timmars arbetstid och 16 av dom satt vi genomsnittligen framför tentan. Det är 2 hela arbetsdagar komprimerade till 1 dag. Väldigt tung tenta.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSA05",
        "name": "Ingenjörsprocessen för programvaruutveckling - samhällsaspekter",
        "points": "4.0",
        "year": "14/15",
        "registered": "47",
        "percentPassed": "91%",
        "teachingScore": "+4",
        "goalClearnessScore": "+14",
        "assessmentScore": "+34",
        "workloadScore": "+19",
        "importanceScore": "+43",
        "satisfactionScore": "+12",
        "comments": "Studierådets kommentarerPratade om att kursen borde vara mer caseinriktad. Övningarna var bra. Föreläsningarna mindre bra, koppla teorin bättre till praktiken. Kursen går dock för sista gången till våren.Kurslärarens kommentererKommentarerna för årets utgåva följer ett tidigare mönster. Ganska låg svarsfrekvens (30-35%), normalfördelade kommentarer kring att mittenläge på ganska nöjda studenter. Det får året införda kamratgranskningen av rapporten har mottagits positivt. Några studenter ifrågasätter att detta behövs för ingenjörer, medan andra beskriver det som en intressant och nyttig kurs.Några kommentarer från C-studenter är sannolikt införda på fel kurs.Programledarens kommentarerDet är glädjande att notera att kursen får klart bättre omdömen än förra året. Som tidigare upplevs den ha hög relevans för utbildningen.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 2 (obligatoriska kurser)": [
      {
        "code": "ETSF05",
        "name": "Internetprotokoll",
        "points": "9.0",
        "year": "14/15",
        "registered": "40",
        "percentPassed": "38%",
        "teachingScore": "-13",
        "goalClearnessScore": "-4",
        "assessmentScore": "+29",
        "workloadScore": "-45",
        "importanceScore": "+79",
        "satisfactionScore": "+7",
        "comments": "Tyvärr är svarsfrekvensen mycket dålig. Ej heller deltog studentrepresentanter i mötet.De få svarande uttrycker att kursen är angelägen för utbildningen och att examinationen är förståelseinriktad vilket uppskattas. Svaren pekar på att arbetsbelastningen är hög vilket till viss del motsäger kommentarer om arbetslasten som begärs in i slutet av de två projekten.Flera förändringar av kursen är redan planerade i samband med sparbetinget som ålagts institutionen. Examination vid ordinarie tillfälle är enbart duggor under kursen, den korta tentan ersätts med dugga, omtentor kan komma att göras som hemtenta eller munta.Programledarens kommentarerSvarsfrekvensen 18% är för låg för att man ska kunna dra några direkta slutsatser. På CEQ-mötet diskuterades dock arbetsrapporten och några förbättringsförslag ventilerades.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 3 (obligatoriska kurser)": [
      {
        "code": "EITF05",
        "name": "Webbsäkerhet",
        "points": "4.0",
        "year": "14/15",
        "registered": "74",
        "percentPassed": "82%",
        "teachingScore": "+45",
        "goalClearnessScore": "+40",
        "assessmentScore": "+20",
        "workloadScore": "+35",
        "importanceScore": "+87",
        "satisfactionScore": "+66",
        "comments": "KommentarerStudierådets kommentarerStudenterna tyckte att föreläsaren var väldigt bra. Studenterna är överlag väldigt nöjda med kursen, det enda är att grupperna i projektet skulle kunnat vara mindre, så att alla fick pröva på både praktik och teori.Kurslärarens kommentererKursen upplevs som mycket angelägen för utbildningen vilket är glädjande. Studenterna verkar också nöjda med kursen så några större förändringar planeras inte inför kommande år. Några förändringar gjordes detta året, främst i avseende att fokusera mer på skriftlig och muntlig framställning. Detta gjorde att projektet ökade lite i storlek. I gengäld var grupperna på fyra personer istället för som tidigare två. Av kommentarerna att döma var det några som upplevde projektet som för litet medan lika många upplevde det som för stort. På mötet med studentrepresentanter diskuterades bland annat detta och slutsatsen var ungefär att det var lagom stort.Programledarens kommentarerDet är glädjande att notera att kursen återigen bedöms ha mycket hög relevans för utbildningen. Kursen har fungerat bra, och vid CEQ-mötet ventilerades några eventuella förbättringsförslag.Svarsfrekvensen 78% är imponerande!CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FAFF25",
        "name": "Fysik",
        "points": "11.0",
        "year": "14/15",
        "registered": "35",
        "percentPassed": "71%",
        "teachingScore": "-8",
        "goalClearnessScore": "-4",
        "assessmentScore": "+24",
        "workloadScore": "+3",
        "importanceScore": "-42",
        "satisfactionScore": "-6",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iDenna uppgift har ej fyllts i."
      },
      {
        "code": "MAMN01",
        "name": "Avancerad interaktionsdesign",
        "points": "7.5",
        "year": "14/15",
        "registered": "52",
        "percentPassed": "100%",
        "teachingScore": "+51",
        "goalClearnessScore": "+39",
        "assessmentScore": "+63",
        "workloadScore": "+30",
        "importanceScore": "+83",
        "satisfactionScore": "+63",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKursansvarig och handledare tycker att kursen flyter på relativt bra, men att vårterminens lp2 inte är optimal för en projektkurs eftersom den är uppdelad.Ett nytt moment i år var en obligatorisk inlämningsuppgift i Android-programmering, som till kommande år kommer att stramas upp lite.För att eventuellt överbrygga den uppdelade läsperioden kan det också bli aktuellt med mer tydlig projekt-planering.Vi jobbar också kontinuerligt med att försöka bli bättre/tydligare på återkoppling under kursens gång.Programledarens kommentarerDet är glädjande att notera att kursen fungerar mycket bra och att studenterna anser att kursen är mycket angelägen för utbildningen.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSF01",
        "name": "Ingenjörsprocessen för programvaruutveckling - ekonomi och kvalitet",
        "points": "4.0",
        "year": "14/15",
        "registered": "28",
        "percentPassed": "82%",
        "teachingScore": "-36",
        "goalClearnessScore": "-51",
        "assessmentScore": "-41",
        "workloadScore": "-10",
        "importanceScore": "+24",
        "satisfactionScore": "-53",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKursens syfte inklusive dess relevans för ingenjörsyrket behöver kommuniceras och förtydligas ytterligare till studenterna genom hela kursen och inte bara (som nu) med en tyngdpunkt på första föreläsningen. I år bjöd jag in en gästföreläsare från industrin som fick bra feedback av studenterna. Detta skulle kunna utökas med ytterligare någon gäst.Andra förbättringar som gjordes för denna omgång behöver påpekas och syftet förklaras tydligare. T ex, tillägget av ett verklighetsbaserat fall i projektuppgiften med syfte att ge en inblick i hur kursinnehållet relaterar till verkliga projekt. Balansen mellan teori o praktik i projektuppgiften ska även revideras mot ett större fokus på de praktiska aspekterna av de givna fallen, t ex att göra en aktivitetsplan för projekt x i verktyg y och inte enbart redovisa utvärderingen av verktyg y.Projektet syftar till att ge möjlighet att jobba med större delen av kursinnehållet, och därmed va en förberedelser för tentan. Detta ska förmedlas tydligare i nästa kursomgång.De pedagogiska vinsterna med kamratgranskningar (som i år ersatte stora delar av handledar-feedbacken) ska påpekas och göras tydligare. Handledarkompetensen ligger här till stor del i de checklistor som används under övningen. Detta behöver förmedlas i klartext. Vi ska även tipsa studenterna om att checklistorna kan användas som hjälp i det egna skrivandet.De initiala problemen vi hade på övningarna med att lösa logistiken (matcha författare mot granskare) kan ha haft en negativ påverkan även på resten av övningen. Inför nästa kursomgång planerar jag att förbättra detta genom (att som studenterna föreslår) allokera rapporterna som ska granskas innan övningen. Studenterna kan då läsa igenom dessa innan, vara bättre förberedda och kunna fokusera på granskningsuppgiften redan från början av passet. En annan förbättring gällande övningarna som utnyttjar handlarnas kompetens bättre och tydligare (inte bara representerad i checklistorna) vore att ha en gemensam genomgång av vanliga kommentarer mot slutet på övningspassen.Inför nästa kursomgång innehåller kursplanen läromål om skrivande. Det förtydligar att detta ingår i kursen, och att dessa moment (projektrapport + övningarna) är viktiga och även att de är ett redskap för lärande om kursens ämnesområde.Programledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering da - Användbarhet och design": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "14/15",
        "registered": "64",
        "percentPassed": "97%",
        "teachingScore": "-23",
        "goalClearnessScore": "-11",
        "assessmentScore": "+25",
        "workloadScore": "+6",
        "importanceScore": "+76",
        "satisfactionScore": "-9",
        "comments": "Studierådets kommentarerKursen grundupplägg är bra men innehållet måste förbättras. Det första är att kursinnehålet kommer att minska till nästa år. Nytt material ska tas fram så att man som student lättare kan orientera sig i det materialet som kursen går igenom.Till exempel ska skapa förläsningsanteckningar över förläsningarna som studenterna kan ta del av. Förbättra slidesen men även hänvisa till relevant forskning inom området. Även Quizarna ska se över så att dessa speglar kursen bättre.Även vissa projekt måste förtydligas så att det blir klart vad man skall göra.Kurslärarens kommentererThis was the third time the course was organized after the major reorganization of security courses. Summarizing the experiences of the students and teacher the contents of the course has been too ambitious in its scope. Neither students not teacher had time to go into depth. During the meeting with the student representative and the program coordinator the following changes were agreed.1. Reduce the number of topics to allow a more in-depth treatment2. Prepare lecture notes containing reference reading material for the topics3. Keep quizzes, improve them and connect them to the lecture notes4. Keep projects (possibly adaptions to the main course topics that remain)CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN10",
        "name": "Interaktion 1: Neuromodellering, kognitiv robotik och agenter",
        "points": "7.5",
        "year": "14/15",
        "registered": "42",
        "percentPassed": "98%",
        "teachingScore": "+14",
        "goalClearnessScore": "-11",
        "assessmentScore": "+67",
        "workloadScore": "+28",
        "importanceScore": "+62",
        "satisfactionScore": "+23",
        "comments": "KommentarerStudierådets kommentarerStudenterna tycker att detta är en relevant kurs för utbildningen. Men den kursansvarige har inte tagit tillräckligt stort ansvar för den administrativa delen av kursen, instruktioner har varit otydliga/inkonsekventa och målen har inte följt kursplanen. Uppdatera kursplanen behöver göras och kursen måste anpassas mer till LTH studenter administrativt sett.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN41",
        "name": "Avancerad webbsäkerhet",
        "points": "7.5",
        "year": "14/15",
        "registered": "101",
        "percentPassed": "92%",
        "teachingScore": "+51",
        "goalClearnessScore": "+55",
        "assessmentScore": "+64",
        "workloadScore": "-6",
        "importanceScore": "+95",
        "satisfactionScore": "+77",
        "comments": "Studierådets kommentarerStudenterna kände i allmänhet att kursen var väldigt bra och att den kändes väldigt angelägen för deras utbildning. Det var även omtyckt med strukturen på kursen, dock fanns det ett visst missnöje i arbetsbördan då studenter fann att det var allt för mycket för en 7.5p Kurs samt att de hade velat veta om i förväg hur mycket tid de borde lägga på de olika momenten i kursen.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN15",
        "name": "Interaktion 2: Virtualitet och kognitiv modellering",
        "points": "7.5",
        "year": "14/15",
        "registered": "34",
        "percentPassed": "100%",
        "teachingScore": "+50",
        "goalClearnessScore": "+9",
        "assessmentScore": "+87",
        "workloadScore": "+13",
        "importanceScore": "+76",
        "satisfactionScore": "+60",
        "comments": "KommentarerStudierådets kommentarerFrån min synvinkel fick vi inte särskilt många oväntade svar utan vi visste att kursen var i ett mellanskede av terminsomställningar och problemen det genererat. Förslagen kursansvariga har föreslagit till hösten 2016 känns i grunden genomtänkt men kräver en del justeringar som diskuterats på mötet.Förslaget på fler obligatoriska moment tror jag är en bra idé då det hade \u0091tvingat\u0092 studenter som jobbar heltid att faktiskt planera om och kunna delta i kursen som planerat. Det är dock farligt att göra allt obligatoriskt då många av föreläsningar för vissa grupper varit orelevanta baserat på projektet man har. Obligatorisk närvaro på redovisning är positivt!En tanke om obligatorisk 4­h workshop där 80% närvaro krävs är bra till viss del. Den typen av workshops är väldigt bra för att samla gruppen till eventuella handledarmöten, och även ett sätt för handledarna att mer aktivt kunna delta i gruppens arbetsprocess och se vilka av studenterna som inte bidrar till projektet. 80% skulle kunna minskas till 70%.All planerad omarbetning av formatet mittredovisning är genomtänkt.Förslaget att förlänga antalet kursveckor för att matcha LTHs period är väsentlig. Det kommer ge mer kraft åt rapportskrivningen. Som det låg nu blev det på tok för mycket i sista veckorna.Att höja ribban ser jag som mycket positivt. Som upplägget var i höst slang många igenom med oförtjänt högt betyg utifrån LTHs mått. Det borde bli snavare betygskriterier för 4:a och 5:a.Kurslärarens kommentererKursutvecklingsmöte för MAMN15 (och i viss mån MAMN10, då kurserna hänger ihop). I mötet deltog två av fyra lärare, programansvarig för masterprogrammet i kognitionsvetenskap och alla fyra kursrepresentanterna, två från LTH och två från kognitionsvetenskap (för samma kurser men med kurskoderna KOGP10 och KOGP05).Lärarna hade satt samman ett dokument med förslag för kursutveckling som hade distribuerats till alla innan mötet.Vi gjorde en gemensam genomgång av ceq-utvärderingen för båda studentgrupperna. Först såg vi om det fanns några saker där bedömningarna skilde sig åt mellan studentgrupperna men i stort stämde bedömningarna mycket väl överens. Lärarna betonade värdet av att göra ceq-utvärderingen för båda studentgrupperna istället för två olika slags utvärderingar: Med den direkta jämförelsen kan vi mycket bättre säkra att förändringar och vidareutvecklingar i kursen tar hänsyn till båda grupperna.Därefter gick vi igenom sådant som indikeras som \u0094problem\u0094 eller \u0094svaghet\u0094 av ceq-materialet. Inga områden hade negativa poäng/staplar, men relativt sett lägst värden hade \u0094arbetsinsats\u0094 och \u0094tydliga mål\u0094. Vi diskuterade detta i förhållande till fritextsvaren i materialet och studentrepresentanternas erfarenheter.Arbetsinsatsproblemen var inte ett utan två olika problem. Det blev stressigt för ganska många i delkurs 2 som var kompakt. Å andra sidan kom från båda studentgrupperna önskemål om att det ska ställas högre krav för alla betygsstegen. Vi diskuterade kring betygen, om det skulle vara en fördel med endast G/U. För detta talar att det ändå i så hög grad är en produkt eller produkter man får med sig från kursen och kan ha i sin portfölj och visa upp. Mot detta talar att betyg kan spela roll t.ex. när man söker sommarjobb samt att kurserna för teknologer ligger inom en specialisering, och det finns intresse hos en del studenter att kunna visa ett (högt) betyg i just kurser inom den egna specialiseringen.Problemet med otydliga mål handlar framförallt om att presentationen av betygskriterierna kom in för sent i kursen och inte i en tillräckligt tydlig form. För en del studenter handlar det också om att lärarna inte sätter upp tydliga delmål för vad de ska göra och uppnå i sitt projekt. Detta är dock en av de bärande idéerna med kursen \u0096 det finns inga på förhand givna delmål som lärarna kan sätta upp, utan det är något gruppen ska ta fram på egen hand med lärarna som bollplank.Trots de organisatoriska problemen med stress i en kort delkurs två och ett nytt terminssystem på LTH som orsakade flera sena ommöbleringar i schemat, är kursutvärderingen mycket positiv. En stor majoritet i båda studentgrupperna säger sig vara nöjda med kursen/kurserna och ger höga betyg på relevansen av kursen/kurserna för sin utbildning. Med så många studenter som också kommenterar att det är den mest lärorika eller en av de mest lärorika kurserna under utbildningen, så har vi nått det vi vill med kursen/kurserna,Nedan en lista på de planerade förändringarna för nästa kursomgång. Vi diskuterade igenom samtliga punkter och var \u0096 ibland efter diskussion \u0096 överens om att förändringarna bör försöka genomföras.1. FLER OBLIGATORISKA MOMENT-\tObligatorisk närvaro vid alla redovisningar (För delkurs 1: mittredovisning x 2/3; slutredovisning x2; För delkurs 2: slutredovisning x 2). Ersättningsuppgifter vid frånvaro.-\tObligatorisk närvaro vid föreläsning om grupp-processer. Ersättningsuppgift vid frånvaro.-\tEtt obligatoriskt 4-timmarspass varje vecka (80% närvaro krävs): I grunden ett pass för team-arbete, där handledarna vet att det går att träffa alla grupper den tiden; en del handledning kommer planeras och ske under passet, och ca varannan vecka kommer vi lägga in workshop-pass (om 2, 3 eller 4 timmar) Dessa workshopar blir alltså också obligatoriska.Kommentar: I någon form önskat av många studenter, och det konkreta förslaget ovan är framtaget av studenter tillsammans med lärare.2. MODIFIERAT FORMAT MITTREDOVISNINGEN DELKURS 1-\tIstället för 2 dagar x 2 timmar (vid samma antal grupper, kring 16): tre dagar x 3 timmar för att få mer tid till frågor och diskussion.-\tTidigarelägga också för att kunna \u0094kicka igång\u0094 de grupper som är sena i starten.Kommentar: Studentgenererat förslag.3. FLER KURSVECKOR-\tLägga kurserna över *hela* höstterminen -- som sedan i år har samma betydelse för båda studentgrupperna, dvs från 1 sept till ca 20 jan.-\tHalvfartskurser över hela terminen.Tio veckor per delkurs.-\tDe muntliga slutredovisningarna läggs kring 14-15 januari och rapportinlämning 18 januari (med manusversion innan jul och kamratgranskning + fram till ca 14 jan.)Kommentar: Önskat av majoritet av studenterna från båda grupperna.4. FLER PARAMETRAR FÖR SKAPANDE AV TEAM-\tSom innan: Teknologer prioritera projekt (1-2 prio) eller blandad grupp-\tSom innan: Alla rangordna fyra projekt-\tSom innan men utökat: Fördela studenter som vill implementera/programmera på adekvat sätt (med hänsyn till projekt och grupp-sammansättningar)-\tNytt: Ta reda på vilka studenter som arbetar vid sidan om på ett sätt som hindrar dem att medverka fullt ut dagtid måndag-fredag. De som har andra engagemang sätts i egen grupp.-\tNytt: Försöka blanda teknologer från åk 4 och 5 (t.ex. undvika teknologgrupper med enbart åk5-teknologer, i synnerhet om inga (starka) kogvetare med i teamet)5. HÖJD RIBBA OCH BÄTTRE UTVÄRDERING FÖR GODKÄNT SÅVÄL SOM FÖR HÖGRE BETYG-\tKrav på individuell loggbok - av simplaste slag, men där man noterar ungefärligt antal timmar och vad man gjorde under dessa timmar-\tFör högsta betyg, t.ex. uttalat krav på att man utnyttjar lärmaterial som på olika sätt förmedlas i kursen i sin produkt samt rapport-\tUtökad diskussion om vad betyg har för roll och ej6. BÄTTRE PRESENTATION AV FÖRELÄSNINGAR OCH HÖJD NIVÅ-\tInformera på förhand, kort, vad föreläsningar ska handla om (undvika att någon tänker \u0092det är nog inte relevant\u0092 för att man känner igen titeln på föreläsningarna)-\tÖka svårighetsnivån på flera av föreläsningarna-\tInte rekommendera lo- och mid-fi-prototyp-workshopen för teknologerna-\tEv. lägga in en motsvarande \u0092grundlektion\u0092 i experimentdesign istället för teknologerna-\tOckså noga med att förklara vilken roll föreläsningar har, att använda för rapporter osv.7. TYDLIGARE OCH TIDIGARE FRAMSTÄLLNING AVMÅL OCH KRAV8. UTÖKAT KAMRATLÄRANDE-\tI relativt tidigt skede bilda par av team med inte alltför lika projekt.  Rekommenderade \u0094hjälpa-varandra-möten\u0094 var 14e dag, där man ses för att berätta om sina respektive projekt, läget, planer, frågor --- Syftet alltså att i) öka på kamratlärandet, som det finns stor potential för, och ii) få in 'breddning' genom att man i alla fall blir lite mer insatt i ytterligare ett projekt än det egna.-\tOm det blir relativt sett ont om kogvetare kan detta också vara ett sätt att se till att de flesta grupper får viss medverkan av (minst) en sådan person.9. UPPDATERA KURSPLANERNACEQ-enkäten fylldes iavslutande presentationer i kursen"
      },
      {
        "code": "EDAN10",
        "name": "Konfigurationshantering",
        "points": "7.5",
        "year": "14/15",
        "registered": "55",
        "percentPassed": "98%",
        "teachingScore": "+52",
        "goalClearnessScore": "+42",
        "assessmentScore": "+42",
        "workloadScore": "-14",
        "importanceScore": "+69",
        "satisfactionScore": "+69",
        "comments": "Studierådets kommentarerStudenterna har varit väldigt nöjda med kursen detta året, speciellt videopresentationerna har uppskattats mycket som ett sätt att lättare förstå delar av materialet. Även diskussionsföreläsningarna har uppskattats av många som ett sätt att förstå materialet bättre. Det har varit väldigt roligt att föreläsaren är engagerad och brinner för sitt ämne.En del studenter har anmärkt på att litteraturen är gammal. Föreläsaren försöker hitta nyare källor men de täcker inte materialet lika bra och det är svårare att få tillåtelse att kopiera materialet. Istället hoppas han få tid att skriva om en av de mer kritiserade artiklarna som ersättning.En del studenter anser också att arbetsbördan har varit väldigt hög, men föreläsaren har försökt få med så mycket att det täcker de 200 timmar kursen ska vara och känner inte att det finns möjlighet att minska delar av kursen då den då inte kommer uppfylla tillräckligt många timmar.Att slides till videopresentationerna bör ingå i det utdelade kursmaterialet (nu fanns det bara på nätet) påpekades och föreläsaren har sagt att det ska finnas med nästa år så man kan skriva ner funderingar direkt.En del klagomål kom in om att projektet hamnade lite konstigt på grund av den nya läsårsindelningen, men föreläsaren känner inte att han kan tidigarelägga det eftersom eleverna måste ha lärt sig alla väsentliga delar i kursen innan projektet kan påbörjas. Däremot ska presentationen av projektet komma tidigare.Föreläsaren ska även göra om lite i  labbhandledningarna för att få in mer om change set model och composition model.Kurslärarens kommentererIt is a great satisfaction to see that last year's good evaluation of the course have become even better on all parameters. It is particularly satisfying that students are very happy with the course and that they rate it as having \"Clear Goals and Standards\" and \"Appropriate Assessment\". It is no surprise that students also this year has a subjective feeling of a not \"Appropriate Workload\" (even if it has improved slightly from last year.Digging deeper into the numbers it is possible to find things where good things can be made even better. For Good Teaching, question 18 gets the lowest rating (+33): Since money for teaching are being cut down more teaching staff feedback will not be possible - however, with a more consistent use of Student Peer Assessment more (student) feedback can be obtained for no or little teacher time. For Clear Goals and Standards, questions 6 and 18 get the lowest rating (+33): I will try to keep focus on what is expected from the student throughout the whole course and not just at the start (and end) of the course. For Appropriate Assessment, the ratings for questions 8 and 12 puzzle me since they seem to be in contradiction: Maybe I should make more clear that there are some basic facts, techniques and terminology you need to know (memorise?) to pass the course, but that you need to demonstrate a much deeper understanding if you want \"to do well\". For Appropriate Workload, ratings for questions 14 and 24 seem to be in contradiction: I try to make it clear that you do not have to \"comprehend *everything* thoroughly\" since the course covers many topics and in breath - apparently I have to try harder to be clear on that.From my own evaluation form, it results that this year's two new aspects of the course (Introduction videos & Student Peer Assessment) was liked by most students (rating 3.58 and 3.60 respectively on a scale from 5 to 1). The Introduction videos are there now and are \"optional\" to use, so I will probably not spend more time and resources on \"improving\" that aspect (apart from giving printed hand-outs as suggesten by one of the student representatives) - if students don't find them useful they can just quit watching them. The Student Peer Assessments are a wonderful way of creating not just more feedback for students in a cost-efficient way, but more importantly to create occasions for more and deeper learning by reviewing someone else's work. There were some - more or less - constuctive comments from students that I will integrate with my own experience and reflection to improve and extend the use of Student Peer Assessment next year.Programledarens kommentarerVäl genomförd kurs. Propgramledningen ser inget behov av större förändringar.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ks - Kommunikationssystem": [
      {
        "code": "ETTN15",
        "name": "Moderna trådlösa system - LTE och dess efterföljare",
        "points": "7.5",
        "year": "14/15",
        "registered": "19",
        "percentPassed": "89%",
        "comments": ""
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "14/15",
        "registered": "105",
        "percentPassed": "74%",
        "teachingScore": "+2",
        "goalClearnessScore": "+27",
        "assessmentScore": "+41",
        "workloadScore": "+38",
        "importanceScore": "+54",
        "satisfactionScore": "+36",
        "comments": "KommentarerStudierådets kommentarerKursen har i stort sett fungerat bra. Övningsuppgifterna samt dess facit fick en hel del kritik på grund av felaktigheter.Kurslärarens kommentererKursen har fungerat ganska bra trots att förkunskaperna hos olika grupper av studenter har varit väldigt skiftande. Detta har gjort att en del studenter upplevt kursen som svår och andra som ganska lätt. Nästa år kommer övningsuppgifterna att grupperas på ett sätt som gör det möjligt att välja utifrån förkunskapsnivå. Då studenterna hade läst väldigt många olika grundkurser i matematisk statistik blev det svårt att hantera behovet av en grundkurs-formelsamling på tentan.   Därför kommer formelsamlingen i fmsf10 att utökas så att relevant material från grundkursen finns med.Programledarens kommentarerKursen har i stort sett fungerat bra i år. Viss kritik finns mot kurslitteraturen som är nyutvecklad, men som kommer att fixas till under kommande revisioner. Viss kritik finns också mot en övningsledare som haft bristfälliga språkkunskaper.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETTN01",
        "name": "Digital kommunikation, fortsättningskurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "32",
        "percentPassed": "78%",
        "teachingScore": "+30",
        "goalClearnessScore": "+15",
        "assessmentScore": "+21",
        "workloadScore": "-1",
        "importanceScore": "+46",
        "satisfactionScore": "+43",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDIN01",
        "name": "Kryptoteknik",
        "points": "7.5",
        "year": "14/15",
        "registered": "45",
        "percentPassed": "49%",
        "teachingScore": "+15",
        "goalClearnessScore": "+31",
        "assessmentScore": "+70",
        "workloadScore": "-9",
        "importanceScore": "+80",
        "satisfactionScore": "+45",
        "comments": "Studierådets kommentarerFöreläsare/övningsledare var väldigt uppskattade och kursen upplevs som väl genomförd. Projekten var givande, men rätt tidskrävande.Den matematiska förkunskapen som krävs borde förtydligas.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN10",
        "name": "Algebraiska strukturer",
        "points": "7.5",
        "year": "14/15",
        "registered": "13",
        "percentPassed": "23%",
        "comments": ""
      },
      {
        "code": "ETSN01",
        "name": "Avancerad telekommunikation",
        "points": "7.5",
        "year": "14/15",
        "registered": "38",
        "percentPassed": "66%",
        "teachingScore": "-39",
        "goalClearnessScore": "-57",
        "assessmentScore": "-11",
        "workloadScore": "-61",
        "importanceScore": "-26",
        "satisfactionScore": "-58",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThere seem to be a number of structural problems with the course and its place in the Wireless masters program, which were apparent both during the course and from students' comments on the evalutation questionnaire. Students come into the course lacking the background knowledge in statistics, networking and programming to be adequately able to handle the advanced topics in this course - mostly focusing on modelling and analysis of network performance.A recurring comment from students on the evaluation was that there was too much to memorise in the course. I believe this stems from the fact that topics that should have been already familiar to the students from a basic networking course, they were instead seeing for the first time, leading to an excessive amount of self-study required to come up to the level where they could work on the actual course material.Another issue students raised was that the labs did not involve enough practical work from the students themselves. This is true but it is very difficult to design good lab classes for this course as many students have no or little background in programming, which is the single most important skill required to do any practical work relating to network performance. Both simulations and experiments with actual hardware require programming and there is simply not time in the course to teach it from scratch to a level where it can be applied to these problems (it was tried in previous years of the course and did not work at all). Instead students ran pre-made simulations and analysed their results.The third main problem raised by students was that they felt the course was not relevant to their masters program as it does not focus on the physical layer. This is true and the course was never intended to cover physical layer concepts, which are covered extensively in other courses in the program. However, an understanding of the surrounding system is important even to an engineer who focuses on the physical layer, which is the reason for the course's presence in the program.To address these problems, we are taking two approaches. First, we have begun discussions with those responsible for the wireless program to try to address the underlying problems - that students do not have the background knowledge required before taking this course, and that the course's place in the program needs to be re-examined. Second, we are looking at what can be done directly for next year.It is clear that many students are not getting much out of the course as it currently stands and as such we will remove some existing lectures in order to make time to cover basic networking protocols and concepts, perhaps with a more advanced self-study option for those students who do already have the assumed knowledge. We will also change the first lab so that students implement a simplified simulation themselves, so that they gain a better understanding of how the simulations they are running in later labs work and why. Unfortunately, unless programming experience becomes required for entry into the program, or courses are added to teach this prior to students taking ETSN01, it is not feasible to make the labs be as practical and student-driven as we would like.Lastly I will attempt to make it more clear throughout the lectures how the course content connects to other parts of the wireless program and why it is important for students to have an overall understanding of networking performance.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN30",
        "name": "Internet inuti",
        "points": "7.5",
        "year": "14/15",
        "registered": "36",
        "percentPassed": "94%",
        "teachingScore": "+50",
        "goalClearnessScore": "+68",
        "assessmentScore": "+80",
        "workloadScore": "+23",
        "importanceScore": "+95",
        "satisfactionScore": "+95",
        "comments": "Studierådets kommentarerOerhört lärorik kurs där studenterna får ta mycket ansvar och planera sitt arbete själva. Labbhandledningarna är genomtänka och labbarna rätar ut de frågetecken som uppstått under veckan.Föreläsarna är väldigt duktiga och förstår de problem som kan uppstå under utvecklingsprocessen.Kanske hade ytterligare en labbtid i sista veckan varit önskvärt då många inte blir klara under sista labben och därefter står utan schemalagt handledningstillfälle.Bortsett från första lektionen, som går igenom den hårdvara, ger lektionerna inte speciellt mycket. T.ex. Ethernet och IP har gåtts igenom i många tidigare kurser. Det märks dock att föreläsarna har väldigt stor erfarenhet och fokus får gärna ligga mer på Embedded Programming i industrin än på de olika protokollen i TCP/IP-stacken.Det går att läsa kursen helt utan C/C++-vana men då måste man vara beredd att lägga ned ordentligt med tid för att begripa konceptet med pekare.Sammanfattningsvis en väldigt bra kurs som verkligen rekommenderas för de som uppskattar mycket eget ansvar och att kontinuerligt ta sig an nya utmaningar.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs och programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN10",
        "name": "Kanalmodellering för trådlös kommunikation",
        "points": "7.5",
        "year": "14/15",
        "registered": "31",
        "percentPassed": "68%",
        "teachingScore": "+26",
        "goalClearnessScore": "-2",
        "assessmentScore": "+13",
        "workloadScore": "-35",
        "importanceScore": "+79",
        "satisfactionScore": "+26",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN45",
        "name": "Informationsteori",
        "points": "7.5",
        "year": "14/15",
        "registered": "50",
        "percentPassed": "74%",
        "teachingScore": "+48",
        "goalClearnessScore": "+47",
        "assessmentScore": "+43",
        "workloadScore": "+17",
        "importanceScore": "+58",
        "satisfactionScore": "+63",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe course is working good. The aim to explain the practical consequences of the theory seems to be appreciated by the students, especially through the hand in problems. During some years I have rebuilt the contents and now I think it has found its right form. There are naturally still improvements to be done but in the overall picture I am satisfied with it.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN15",
        "name": "Radiosystem",
        "points": "7.5",
        "year": "14/15",
        "registered": "35",
        "percentPassed": "51%",
        "teachingScore": "+33",
        "goalClearnessScore": "+24",
        "assessmentScore": "+33",
        "workloadScore": "-17",
        "importanceScore": "+68",
        "satisfactionScore": "+41",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN10",
        "name": "Multipelantennsystem",
        "points": "7.5",
        "year": "14/15",
        "registered": "27",
        "percentPassed": "63%",
        "teachingScore": "+43",
        "goalClearnessScore": "+33",
        "assessmentScore": "+32",
        "workloadScore": "-19",
        "importanceScore": "+85",
        "satisfactionScore": "+57",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iDenna uppgift har ej fyllts i."
      },
      {
        "code": "EITN21",
        "name": "Projekt i trådlös kommunikation",
        "points": "7.5",
        "year": "14/15",
        "registered": "25",
        "percentPassed": "44%",
        "teachingScore": "+60",
        "goalClearnessScore": "+41",
        "assessmentScore": "+52",
        "workloadScore": "+5",
        "importanceScore": "+83",
        "satisfactionScore": "+58",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering sec - Säkerhet": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "14/15",
        "registered": "64",
        "percentPassed": "97%",
        "teachingScore": "-23",
        "goalClearnessScore": "-11",
        "assessmentScore": "+25",
        "workloadScore": "+6",
        "importanceScore": "+76",
        "satisfactionScore": "-9",
        "comments": "Studierådets kommentarerKursen grundupplägg är bra men innehållet måste förbättras. Det första är att kursinnehålet kommer att minska till nästa år. Nytt material ska tas fram så att man som student lättare kan orientera sig i det materialet som kursen går igenom.Till exempel ska skapa förläsningsanteckningar över förläsningarna som studenterna kan ta del av. Förbättra slidesen men även hänvisa till relevant forskning inom området. Även Quizarna ska se över så att dessa speglar kursen bättre.Även vissa projekt måste förtydligas så att det blir klart vad man skall göra.Kurslärarens kommentererThis was the third time the course was organized after the major reorganization of security courses. Summarizing the experiences of the students and teacher the contents of the course has been too ambitious in its scope. Neither students not teacher had time to go into depth. During the meeting with the student representative and the program coordinator the following changes were agreed.1. Reduce the number of topics to allow a more in-depth treatment2. Prepare lecture notes containing reference reading material for the topics3. Keep quizzes, improve them and connect them to the lecture notes4. Keep projects (possibly adaptions to the main course topics that remain)CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN41",
        "name": "Avancerad webbsäkerhet",
        "points": "7.5",
        "year": "14/15",
        "registered": "101",
        "percentPassed": "92%",
        "teachingScore": "+51",
        "goalClearnessScore": "+55",
        "assessmentScore": "+64",
        "workloadScore": "-6",
        "importanceScore": "+95",
        "satisfactionScore": "+77",
        "comments": "Studierådets kommentarerStudenterna kände i allmänhet att kursen var väldigt bra och att den kändes väldigt angelägen för deras utbildning. Det var även omtyckt med strukturen på kursen, dock fanns det ett visst missnöje i arbetsbördan då studenter fann att det var allt för mycket för en 7.5p Kurs samt att de hade velat veta om i förväg hur mycket tid de borde lägga på de olika momenten i kursen.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF20",
        "name": "Datorarkitektur",
        "points": "7.5",
        "year": "14/15",
        "registered": "45",
        "percentPassed": "71%",
        "teachingScore": "+10",
        "goalClearnessScore": "+6",
        "assessmentScore": "-10",
        "workloadScore": "+35",
        "importanceScore": "+63",
        "satisfactionScore": "+33",
        "comments": "Studierådets kommentarerStudenterna var nöjda med kursen och deras grundliga förklarningar med verkliga exempel, studenterna var även nöjda med att kursen höll sig relaterad till dagens utvecklingar inom ämnet. Det fanns dock en del som var missnöjda med labbarna som kändes väldigt utdaterade, och på samma gång så var det för få handledare på labbarna.Kurslärarens kommentererKursen kommer att tas över av en annan lärare nästa gång den går. Jag har givit honom följande kommentarer:* Det behövs fler lab-assistenter på labbarna* Kursen behöver uppdateras - gäller även kurslitteraturen* Labbarna behöver uppdateras riktigt mycket! (behovet har varit känt länge men budget och personal situationen har inte medgivit detta)Programledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling. Dock kan det vara läge att se över laborationerna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDIN01",
        "name": "Kryptoteknik",
        "points": "7.5",
        "year": "14/15",
        "registered": "45",
        "percentPassed": "49%",
        "teachingScore": "+15",
        "goalClearnessScore": "+31",
        "assessmentScore": "+70",
        "workloadScore": "-9",
        "importanceScore": "+80",
        "satisfactionScore": "+45",
        "comments": "Studierådets kommentarerFöreläsare/övningsledare var väldigt uppskattade och kursen upplevs som väl genomförd. Projekten var givande, men rätt tidskrävande.Den matematiska förkunskapen som krävs borde förtydligas.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN10",
        "name": "Algebraiska strukturer",
        "points": "7.5",
        "year": "14/15",
        "registered": "13",
        "percentPassed": "23%",
        "comments": ""
      },
      {
        "code": "EITN30",
        "name": "Internet inuti",
        "points": "7.5",
        "year": "14/15",
        "registered": "36",
        "percentPassed": "94%",
        "teachingScore": "+50",
        "goalClearnessScore": "+68",
        "assessmentScore": "+80",
        "workloadScore": "+23",
        "importanceScore": "+95",
        "satisfactionScore": "+95",
        "comments": "Studierådets kommentarerOerhört lärorik kurs där studenterna får ta mycket ansvar och planera sitt arbete själva. Labbhandledningarna är genomtänka och labbarna rätar ut de frågetecken som uppstått under veckan.Föreläsarna är väldigt duktiga och förstår de problem som kan uppstå under utvecklingsprocessen.Kanske hade ytterligare en labbtid i sista veckan varit önskvärt då många inte blir klara under sista labben och därefter står utan schemalagt handledningstillfälle.Bortsett från första lektionen, som går igenom den hårdvara, ger lektionerna inte speciellt mycket. T.ex. Ethernet och IP har gåtts igenom i många tidigare kurser. Det märks dock att föreläsarna har väldigt stor erfarenhet och fokus får gärna ligga mer på Embedded Programming i industrin än på de olika protokollen i TCP/IP-stacken.Det går att läsa kursen helt utan C/C++-vana men då måste man vara beredd att lägga ned ordentligt med tid för att begripa konceptet med pekare.Sammanfattningsvis en väldigt bra kurs som verkligen rekommenderas för de som uppskattar mycket eget ansvar och att kontinuerligt ta sig an nya utmaningar.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs och programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN45",
        "name": "Informationsteori",
        "points": "7.5",
        "year": "14/15",
        "registered": "50",
        "percentPassed": "74%",
        "teachingScore": "+48",
        "goalClearnessScore": "+47",
        "assessmentScore": "+43",
        "workloadScore": "+17",
        "importanceScore": "+58",
        "satisfactionScore": "+63",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe course is working good. The aim to explain the practical consequences of the theory seems to be appreciated by the students, especially through the hand in problems. During some years I have rebuilt the contents and now I think it has found its right form. There are naturally still improvements to be done but in the overall picture I am satisfied with it.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF35",
        "name": "Operativsystem",
        "points": "7.5",
        "year": "14/15",
        "registered": "75",
        "percentPassed": "29%",
        "teachingScore": "+51",
        "goalClearnessScore": "+45",
        "assessmentScore": "+26",
        "workloadScore": "+20",
        "importanceScore": "+97",
        "satisfactionScore": "+72",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Eventuellt kan labbarna ses över.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ssr - System, signaler och reglering": [
      {
        "code": "FRTN10",
        "name": "Flervariabel reglering",
        "points": "7.5",
        "year": "14/15",
        "registered": "60",
        "percentPassed": "78%",
        "teachingScore": "+18",
        "goalClearnessScore": "+21",
        "assessmentScore": "+55",
        "workloadScore": "+1",
        "importanceScore": "+64",
        "satisfactionScore": "+45",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererRoligt att se skillnaden i omdömen från föregående år. Som kommentarerna visar finns det dock mer kvar att förbättra, både när det gäller innehåll och kursmaterial.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN55",
        "name": "Signalseparation - oberoende komponenter",
        "points": "7.5",
        "year": "14/15",
        "registered": "17",
        "percentPassed": "88%",
        "comments": ""
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "14/15",
        "registered": "105",
        "percentPassed": "74%",
        "teachingScore": "+2",
        "goalClearnessScore": "+27",
        "assessmentScore": "+41",
        "workloadScore": "+38",
        "importanceScore": "+54",
        "satisfactionScore": "+36",
        "comments": "KommentarerStudierådets kommentarerKursen har i stort sett fungerat bra. Övningsuppgifterna samt dess facit fick en hel del kritik på grund av felaktigheter.Kurslärarens kommentererKursen har fungerat ganska bra trots att förkunskaperna hos olika grupper av studenter har varit väldigt skiftande. Detta har gjort att en del studenter upplevt kursen som svår och andra som ganska lätt. Nästa år kommer övningsuppgifterna att grupperas på ett sätt som gör det möjligt att välja utifrån förkunskapsnivå. Då studenterna hade läst väldigt många olika grundkurser i matematisk statistik blev det svårt att hantera behovet av en grundkurs-formelsamling på tentan.   Därför kommer formelsamlingen i fmsf10 att utökas så att relevant material från grundkursen finns med.Programledarens kommentarerKursen har i stort sett fungerat bra i år. Viss kritik finns mot kurslitteraturen som är nyutvecklad, men som kommer att fixas till under kommande revisioner. Viss kritik finns också mot en övningsledare som haft bristfälliga språkkunskaper.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN60",
        "name": "Optimal och adaptiv signalbehandling",
        "points": "7.5",
        "year": "14/15",
        "registered": "23",
        "percentPassed": "52%",
        "teachingScore": "+19",
        "goalClearnessScore": "+8",
        "assessmentScore": "+53",
        "workloadScore": "+21",
        "importanceScore": "+64",
        "satisfactionScore": "+18",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN80",
        "name": "Algoritmer i signalprocessorer - projektkurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "16",
        "percentPassed": "94%",
        "comments": ""
      },
      {
        "code": "FMAF10",
        "name": "Tillämpad matematik - Linjära system",
        "points": "5.0",
        "year": "14/15",
        "registered": "109",
        "percentPassed": "68%",
        "teachingScore": "+36",
        "goalClearnessScore": "+64",
        "assessmentScore": "+46",
        "workloadScore": "+41",
        "importanceScore": "+51",
        "satisfactionScore": "+59",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTN15",
        "name": "Prediktiv reglering",
        "points": "7.5",
        "year": "14/15",
        "registered": "38",
        "percentPassed": "66%",
        "teachingScore": "-32",
        "goalClearnessScore": "-19",
        "assessmentScore": "+44",
        "workloadScore": "-21",
        "importanceScore": "+79",
        "satisfactionScore": "+14",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "BMEN01",
        "name": "Medicinsk signalbehandling",
        "points": "7.5",
        "year": "14/15",
        "registered": "22",
        "percentPassed": "59%",
        "comments": ""
      },
      {
        "code": "ETIF10",
        "name": "Signalbehandling - design och implementering",
        "points": "7.5",
        "year": "14/15",
        "registered": "28",
        "percentPassed": "64%",
        "teachingScore": "+21",
        "goalClearnessScore": "+9",
        "assessmentScore": "+65",
        "workloadScore": "+36",
        "importanceScore": "+79",
        "satisfactionScore": "+50",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTA35",
        "name": "Introduktionskurs i kinesiska för civilingenjörer",
        "points": "15.0",
        "year": "14/15",
        "registered": "14",
        "percentPassed": "93%",
        "teachingScore": "+100",
        "goalClearnessScore": "+94",
        "assessmentScore": "-25",
        "workloadScore": "+100",
        "importanceScore": "+100",
        "satisfactionScore": "+100",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA25",
        "name": "C-programmering",
        "points": "3.0",
        "year": "14/15",
        "registered": "129",
        "percentPassed": "40%",
        "teachingScore": "+33",
        "goalClearnessScore": "+21",
        "assessmentScore": "+48",
        "workloadScore": "-6",
        "importanceScore": "+71",
        "satisfactionScore": "+46",
        "comments": "KommentarerStudierådets kommentarerVi diskuterade att öka kursinhållet för att gör kursen bättre för att få den att passa med andra kurser men kom fram till att detta inte skulle gå då lth har nerskärningar. Vi kom även fram till att rättarna ska bli mera konsekventa i sin rättning. Föreläsaren skulle även vara bättre att informera om kursen angående labbar och övningar i början av kursen.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattades av studenterna. Särskilt föreläsaren uppskattades. Arbetsbelastningen anses vara mycket hög varför kursinnehållet relaterat till antalet poäng kan ses över.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIF05",
        "name": "Grundläggande radioteknik",
        "points": "7.5",
        "year": "14/15",
        "registered": "53",
        "percentPassed": "79%",
        "teachingScore": "+39",
        "goalClearnessScore": "+36",
        "assessmentScore": "+23",
        "workloadScore": "+16",
        "importanceScore": "+45",
        "satisfactionScore": "+45",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN65",
        "name": "Kompilatorer",
        "points": "7.5",
        "year": "14/15",
        "registered": "49",
        "percentPassed": "71%",
        "teachingScore": "+46",
        "goalClearnessScore": "+49",
        "assessmentScore": "+58",
        "workloadScore": "+13",
        "importanceScore": "+83",
        "satisfactionScore": "+62",
        "comments": "Studierådets kommentarerStudenterna är överlag nöjda med det här kursen. Det som behöver förbättras är en lämpligare arbetsbelastning på labbarna. Sedan skulle det varit bra med en exempeltenta.Det är en skyldighet som kursansvarig att skriva hur många poäng varje uppgift ger på tentan.Kurslärarens kommentererStudenterna verkar överlag mycket nöjda med kursen och tycker den är mycket angelägen för deras utbildning. På CEQ-mötet diskuterade vi ett antal olika förbättringar som kan göras.Uppgifterna (labbarna) varierar mycket i svårighet. Till nästa år kommer vi att flytta vissa moment mellan uppgifterna för att jämna ut arbetet något, men framförallt kommer vi att i förväg berätta hur mycket tid de olika uppgifterna brukar ta, så att det är lättare för studenterna att planera sitt arbete. I år kunde vi inte göra detta eftersom kursen gavs för första gången. Ett antal detaljer i uppgifterna kommer också att förtydligas och förbättras.På labbarna fick studenterna ibland vänta länge för att få hjälp eller för att få sin labb godkänd. Vi kommer nästa år att strukturera om arbetet så att de som väntar kan börja med att diskutera med varandra, och kan därmed hjälpa och lära av varandra. Vid redovisningen kommer vi att diskutera med flera grupper samtidigt, både för att snabba upp redovisningarna, och för att ge studenterna möjlighet att lära sig av varandras lösningar.Tentan upplevdes som för enkel av några studenter genom att den primärt testade det som gicks igenom på labbarna. Tentan fungerar dock som enskild examination, och kan inte tas bort eftersom labbarna görs i par. Min ambition är också att lägga in mer teoriuppgifter i nästa års tenta.Övningsuppgifterna (som är frivilliga) upplevdes som mycket nyttiga. Vissa kursdelar har dock mycket få övningar, och det är min ambition att lägga till fler efter hand. Efter hand kommer också gamla tentor att fungera som extra övningar.Vi använde ett väldigt enkelt kursforum, med en enda tråd för allt, men formuet utnyttjades ganska lite. Nästa år planerar vi att använda ett bättre forum, t.ex. Piazza, för att underlätta diskussioner.Programledarens kommentarerEn väl genomförd kurs. Studenterna har upplevt att labbarna var väldigt givande, men att tidsåtgången varierade mellan labbarna. detta medförde att en del studenter periodvis fick problem med arbetsbelastningen. Vid nästa kursomgång ska läraren tydligare informera om förväntad tidsåtgång för de olika labbarna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF15",
        "name": "Markovprocesser",
        "points": "7.5",
        "year": "14/15",
        "registered": "34",
        "percentPassed": "65%",
        "teachingScore": "+6",
        "goalClearnessScore": "+29",
        "assessmentScore": "+58",
        "workloadScore": "+58",
        "importanceScore": "+67",
        "satisfactionScore": "+42",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe comments have been generally positive. I will try to add some more details to the answers of the exercises as it was requested. However, the best way to learn the course is that the students attend the exercise sessions and discuss the problems with the teachers.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSN05",
        "name": "Programvaruutveckling för stora system",
        "points": "7.5",
        "year": "14/15",
        "registered": "70",
        "percentPassed": "97%",
        "teachingScore": "+24",
        "goalClearnessScore": "+15",
        "assessmentScore": "+60",
        "workloadScore": "-3",
        "importanceScore": "+70",
        "satisfactionScore": "+40",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN20",
        "name": "Språkteknologi",
        "points": "7.5",
        "year": "14/15",
        "registered": "62",
        "percentPassed": "92%",
        "teachingScore": "+23",
        "goalClearnessScore": "+43",
        "assessmentScore": "+15",
        "workloadScore": "+47",
        "importanceScore": "+54",
        "satisfactionScore": "+43",
        "comments": "Studierådets kommentarerStudenterna är överlag nöjda med den här kursen, men tycker att arbetsbelastningen är för låg. Kanske införa en obligatorisk tenta som lösning?Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattades av studenterna. Studenterna efterfrågar en tydligare individuell examination för att säkerställa att alla som blir godkända faktiskt lärt sig kursens innehåll.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITA05",
        "name": "Teknikhistoria",
        "points": "4.5",
        "year": "14/15",
        "registered": "92",
        "percentPassed": "89%",
        "teachingScore": "+31",
        "goalClearnessScore": "+55",
        "assessmentScore": "+38",
        "workloadScore": "+75",
        "importanceScore": "+9",
        "satisfactionScore": "+56",
        "comments": "KommentarerStudierådets kommentarerStudenterna var nöjda med kursen och kände att den hade väldigt varierande och intressant innehåll, vissa av studenterna kände dock att vissa föreläsningar var av lägre kvalitet än de andra samt att de tyckte informationen kring inlämningar och liknande kunde varit tydligare.Kurslärarens kommentererÖverlag är studenterna nöjda med denna kurs vilket är bra. Det finns dock två områden som bör ses över inför nästa kursstart vilket både jag själv tycker och studenternas kommentarer indikerar.Först, kursen består idag av en serie föreläsningar om olika områden inom teknikhistoria som skall ge en bredd av insikter i den tekniska utvecklingen och historien omkring samt belysa gemensam påverkan mellan samhälle och teknik genom historien. Det saknas dock en sammanhållande vetenskaplig bas för de olika momenten i form av en introduktion till historiskt perspektiv och metodik. Hur man behandlar informationen i föreläsningarna mm.Sedan är informationen om kriterierna för betygssättningen i fördjupningsarbetet lite bristfällig och skall klargöras.Programledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMIF15",
        "name": "Teknisk miljövetenskap",
        "points": "7.5",
        "year": "14/15",
        "registered": "22",
        "percentPassed": "68%",
        "comments": ""
      },
      {
        "code": "GEMA25",
        "name": "Tyska för tekniker",
        "points": "7.5",
        "year": "14/15",
        "registered": "19",
        "percentPassed": "89%",
        "comments": ""
      },
      {
        "code": "GEMA70",
        "name": "Japanska för tekniker",
        "points": "15.0",
        "year": "14/15",
        "registered": "13",
        "percentPassed": "46%",
        "comments": ""
      },
      {
        "code": "EDAN35",
        "name": "Högpresterande datorgrafik",
        "points": "7.5",
        "year": "14/15",
        "registered": "21",
        "percentPassed": "71%",
        "comments": ""
      },
      {
        "code": "ETSF10",
        "name": "Internetprotokoll",
        "points": "7.5",
        "year": "14/15",
        "registered": "37",
        "percentPassed": "54%",
        "teachingScore": "+23",
        "goalClearnessScore": "+25",
        "assessmentScore": "+41",
        "workloadScore": "+5",
        "importanceScore": "+58",
        "satisfactionScore": "+17",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FAFF20",
        "name": "Multispektral avbildning",
        "points": "7.5",
        "year": "14/15",
        "registered": "14",
        "percentPassed": "43%",
        "comments": ""
      },
      {
        "code": "FMAN40",
        "name": "Projekt i tillämpad matematik",
        "points": "3.0",
        "year": "14/15",
        "registered": "4",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "FMSN20",
        "name": "Spatial statistik med bildanalys",
        "points": "7.5",
        "year": "14/15",
        "registered": "12",
        "percentPassed": "100%",
        "teachingScore": "+79",
        "goalClearnessScore": "+43",
        "assessmentScore": "+80",
        "workloadScore": "+13",
        "importanceScore": "+79",
        "satisfactionScore": "+79",
        "comments": "Studierådets kommentarerKursen har fungerat mycket bra. Föreläsningarna och övningarna har varit mycket uppskattade.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen verkar ha fungerat bra. Tyvärr är det för få studenter som svarat på CEQ för att dra några slutsatser.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF40",
        "name": "Digitala och analoga projekt",
        "points": "7.5",
        "year": "14/15",
        "registered": "8",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "ETIA10",
        "name": "Patent och annan immaterialrätt",
        "points": "7.5",
        "year": "14/15",
        "registered": "55",
        "percentPassed": "73%",
        "teachingScore": "+37",
        "goalClearnessScore": "+40",
        "assessmentScore": "+15",
        "workloadScore": "+65",
        "importanceScore": "+32",
        "satisfactionScore": "+70",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerÖverlag välfungerande kurs. Kursens övningsuppgifter diskuterades; studenterna önskar fler uppgifter som bättre täcker in kursinnehållet samt mer kompletta lösningar. Kursansvarig kommenterar att målet med kursen framförallt är att förstå principer och terminologi och inte att öva räknefärdighet. Detta ska om möjligt ytterligare förtydligas i nästa års kurs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MMKN30",
        "name": "Servicerobotik",
        "points": "7.5",
        "year": "14/15",
        "registered": "14",
        "percentPassed": "64%",
        "comments": ""
      },
      {
        "code": "GEMA01",
        "name": "Franska för tekniker: språk, kultur och samhällsliv, grundkurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "7",
        "percentPassed": "57%",
        "comments": ""
      },
      {
        "code": "GEMA65",
        "name": "Kinesiska för tekniker",
        "points": "7.5",
        "year": "14/15",
        "registered": "8",
        "percentPassed": "63%",
        "comments": ""
      },
      {
        "code": "FMAA15",
        "name": "Diskret matematik",
        "points": "7.5",
        "year": "14/15",
        "registered": "58",
        "percentPassed": "34%",
        "teachingScore": "+44",
        "goalClearnessScore": "+48",
        "assessmentScore": "+68",
        "workloadScore": "+45",
        "importanceScore": "+85",
        "satisfactionScore": "+65",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerFMAA15 är en kurs som fungerat bra i många år och så också denna gång. Inga större ändringar planeras.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN30",
        "name": "Ledarskap, arbetsorganisation och projektledning",
        "points": "7.5",
        "year": "14/15",
        "registered": "46",
        "percentPassed": "100%",
        "teachingScore": "-37",
        "goalClearnessScore": "-9",
        "assessmentScore": "-41",
        "workloadScore": "+41",
        "importanceScore": "-17",
        "satisfactionScore": "-42",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKursen kommer att ges i en ny version vilket sammanfattas nedan. Detta har förankrats hos programledningen och även motiverats av studenternas kursutvärdering.Ny version 2016 av kursen MAMN30Kursen Ledarskap, arbetsorganisation och projektledning (MAMN30) genomgår en väsentlig omarbetning inför 2016. Upplägget följer ett strukturell välfungerande och beprövat koncept med flera olika examinationsmoment, men under 2016 komprimeras kursens grundläggande delar till förmån för aktuell och nyskapande arbetsplatsnära forskning och utveckling. Kursens aktualitet är tydligt förankrat i de senaste två årens nationella och internationella nätverksmöten, konferenser och publikationer inom området. Kursens pedagogiska upplägg utvecklas med ökade inslag av tekniskt stöd, bland annat ingår kursen i satsningen \u0094lärandelyftet\u0094 på institutionen för Designvetenskaper. Kursen omarbetas och utvecklas inom följande fem områden: 1.\tStärkt perspektiv på innovationKursens kommer som tidigare att behandla ledarskap, arbetsorganisation och projektledning, men alla kursens aktiviteter kommer att göras med tydlig utgångspunkt i förnyelse, innovation och innovationsförmåga. 2. Forskningsmässig spetsForskningsförankringen görs utifrån kursens angelägenhet för studenternas utbildning och förankras hos berörd programledning. Studenterna genomför och presenterar aktuell och ny forskning i nivå med standarden för ett bidrag till en vetenskaplig konferens. Detta innebär ökad handledningstid samt utvecklat strukturellt stöd via undervisningsplattformen. 3. TeknikanvändningÖkat tekniskt inslag i form av kommunikations, visualiserings, och simuleringsverktyg kopplat till ämnet. Tekniken förankras i publicerade forskningsresultat samt pågående forskningsprojekt. 4.Nyskapande undervisnings- och examinationsform\u0095 Fakta och grundläggande kunskaper i form av e-böcker, koppling till befintlig MOOC, videoklipp, artiklar via plattformen (Live at Lund). Ett helt nytt underlag har tagits fram och examineras med en mer omfattande dugga tidigt i kursen.\u0095 Föreläsningstillfällena används till interaktion och inspiration dvs gästföreläsningar och \u0094ögonöppnare\u0094 kring aktuell forskning, samt mer praktiskt orienterade workshops.\u0095 Examination som inkluderar en konferens i kursen.\u0095 Studenternas arbeten/artiklar utgör kursmaterial.\u0095 Studenterna ska ge konstruktiv återkoppling till varandra.5.Kvalitetssäkring av kursen\u0095 Transparant och väl kommunicerad processbeskrivning och dokumentstyrning av alla kursens moment görs genom omarbetade instruktioner och specifikationer.\u0095 Kontinuerlig utvärdering av kursmoment i dialog med studenter i samband med handledning och föreläsningar.Programledarens kommentarerKursen får kritik för att vara för enkel och inte tillräckligt relevant för programmet. Programledningen kommer att undersöka detta.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN20",
        "name": "Bildanalys",
        "points": "7.5",
        "year": "14/15",
        "registered": "60",
        "percentPassed": "85%",
        "teachingScore": "+44",
        "goalClearnessScore": "+24",
        "assessmentScore": "+71",
        "workloadScore": "+7",
        "importanceScore": "+60",
        "satisfactionScore": "+56",
        "comments": "KommentarerStudierådets kommentarerStudenterna är överlag nöjda med den här kursen. Föreläsaren är väldigt duktig. Det som behöver förbättras är instruktionerna till inlämningsuppgifterna, de behöver bli tydligare. Sedan så läses kursen av både svenska och internationella studenter, vilket gör att allt borde ha namn på engelska, till exempel filer och variabelnamn.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattades av studenterna. I synnerhet föreläsaren fick goda omdömen av studenterna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN30",
        "name": "Medicinsk bildanalys",
        "points": "7.5",
        "year": "14/15",
        "registered": "23",
        "percentPassed": "74%",
        "comments": ""
      }
    ]
  },
  "D": {
    "Årskurs 1 (obligatoriska kurser)": [
      {
        "code": "EDAA05",
        "name": "Datorer i system",
        "points": "8.0",
        "year": "14/15",
        "registered": "130",
        "percentPassed": "93%",
        "teachingScore": "+23",
        "goalClearnessScore": "+37",
        "assessmentScore": "+11",
        "workloadScore": "+63",
        "importanceScore": "+43",
        "satisfactionScore": "+30",
        "comments": "Studierådets kommentarerKursen är en bra introduktion till programmet och vilka ämnesområden som finns, däremot så är det en väldigt lätt kurs och svårighetsgraden skulle kunna höjas.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen läggs ner pga förändringar inom det obligatoriska blocket på D. Detta var sista gången kursen gavs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAA01",
        "name": "Endimensionell analys",
        "points": "15.0",
        "year": "14/15",
        "registered": "111",
        "percentPassed": "36%",
        "teachingScore": "-7",
        "goalClearnessScore": "+41",
        "assessmentScore": "+62",
        "workloadScore": "+3",
        "importanceScore": "+72",
        "satisfactionScore": "+44",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIA01",
        "name": "Elektronik",
        "points": "8.0",
        "year": "14/15",
        "registered": "118",
        "percentPassed": "70%",
        "teachingScore": "-1",
        "goalClearnessScore": "+12",
        "assessmentScore": "+26",
        "workloadScore": "+14",
        "importanceScore": "+25",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerDet var mycket kritik mot hur labbarna fungerade i praktiken och om att litteraturen var många ord lite innehåll. Detta  kommer förhoppningsvis bättra sig när kursen görs om. Väldigt blandade kommentarer angående föreläsningarna men det var en del som tyckte de var för svåra att förstå.Kurslärarens kommentererKursen gick för sista gången i det här formatet. I den nya, mindre, kursen som jag med flera ska utveckla kommer synpunkterna från enkäten att beaktas. Främst vad gäller laborationerna och kursboken. Trots detta har årets version upplevts som relevant och med nöjda studenter.Programledarens kommentarerDetta var sista gången kursen genomfördes. Den ersätts med en något mindre kurs. Årets kursomgång var väl genomförd.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA01",
        "name": "Programmeringsteknik - fördjupningskurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "111",
        "percentPassed": "80%",
        "teachingScore": "+12",
        "goalClearnessScore": "+37",
        "assessmentScore": "+55",
        "workloadScore": "+32",
        "importanceScore": "+85",
        "satisfactionScore": "+52",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererDet är glädjande att så många är nöjda med kursen och finner den relevant för sin utbildning.De förändringar som gjordes inför kursomgången VT15 var: - Redovisning av inlämningsuppgiften i form av kamratgranskning. Detta har fungerat mycket bra. Studenterna får tillfälle att se och diskutera alternativa lösningar till en uppgift de själva löst. Ev. kommer även en av labbarna att kamratgranskas.- Övningar i sal har tagits bort p.g.a. besparingskrav, men övningsuppgifterna finns kvar i form av självstudieuppgifter. Jag planerar att lägga in frågestunder där man bl.a. ska kunna ställa frågor om övningsuppgifterna.Vårens kursomgång går under en läsperiod och arbetsbelastningen upplevs vara hög, speciellt i slutet av kursen. Jag ska se över de olika kursmomenten och försöka jämna ut arbetsbelastningen. Läsvecka 1 skulle t.ex. kunna användas mer.Programledarens kommentarerEn väl genomförd kurs som uppskattas av studenterna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSA01",
        "name": "Ingenjörsprocessen för programvaruutveckling - metodik",
        "points": "5.0",
        "year": "14/15",
        "registered": "124",
        "percentPassed": "95%",
        "teachingScore": "+23",
        "goalClearnessScore": "-15",
        "assessmentScore": "+43",
        "workloadScore": "+17",
        "importanceScore": "+68",
        "satisfactionScore": "+22",
        "comments": "Studierådets kommentarerprojektet var bra och roligt! En nackdel med projektet var att de olika leverablerna hade olika arbetsbelastning. Leverablerna behöver vara mer utspridda och programmeringen behöver påbörjas tidigare i jämförelse med årets kurs.Tentamen var extrem på gränsen till det löjliga, genomsnittliga tiden som folk satt var 16 timmar vad jag hört. vi hade 30 timmars arbetstid och 16 av dom satt vi genomsnittligen framför tentan. Det är 2 hela arbetsdagar komprimerade till 1 dag. Väldigt tung tenta.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 2 (obligatoriska kurser)": [
      {
        "code": "EDAF10",
        "name": "Objektorienterad modellering och diskreta strukturer",
        "points": "7.5",
        "year": "14/15",
        "registered": "107",
        "percentPassed": "80%",
        "teachingScore": "+23",
        "goalClearnessScore": "+28",
        "assessmentScore": "+49",
        "workloadScore": "+31",
        "importanceScore": "+58",
        "satisfactionScore": "+46",
        "comments": "KommentarerStudierådets kommentarerStudenter var nöjda med kursen och kände att den var relevant då den gav en bra insikt i hur man kan få struktur på sin programmering, en del studenter tyckte dock att kursen snarare borde delas upp i två samt att de tyckte övningarna var överbefolkade och stundtals även onödiga.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattas av studenterna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAF10",
        "name": "Tillämpad matematik - Linjära system",
        "points": "5.0",
        "year": "14/15",
        "registered": "109",
        "percentPassed": "68%",
        "teachingScore": "+36",
        "goalClearnessScore": "+64",
        "assessmentScore": "+46",
        "workloadScore": "+41",
        "importanceScore": "+51",
        "satisfactionScore": "+59",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF05",
        "name": "Algoritmer, datastrukturer och komplexitet",
        "points": "5.0",
        "year": "14/15",
        "registered": "132",
        "percentPassed": "67%",
        "teachingScore": "+34",
        "goalClearnessScore": "+12",
        "assessmentScore": "+69",
        "workloadScore": "+14",
        "importanceScore": "+91",
        "satisfactionScore": "+58",
        "comments": "KommentarerStudierådets kommentarerBra kurs som verkar väldigt relevant till vår utbildning. Klurig tenta men som verkligen ser till så man har förståelse för kursen, inget man bara kan tentaplugga en vecka innan. Labbarna är bra och egentligen hade man kunnat behöva ha alla labbar och inte bara 4 st.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSA05",
        "name": "Ingenjörsprocessen för programvaruutveckling - samhällsaspekter",
        "points": "4.0",
        "year": "14/15",
        "registered": "108",
        "percentPassed": "94%",
        "teachingScore": "+3",
        "goalClearnessScore": "+11",
        "assessmentScore": "+35",
        "workloadScore": "+35",
        "importanceScore": "+7",
        "satisfactionScore": "-7",
        "comments": "KommentarerStudierådets kommentarerPratade om att kursen borde vara mer caseinriktad. Övningarna var bra. Föreläsningarna mindre bra, koppla teorin bättre till praktiken. Kursen går dock för sista gången till våren.Kurslärarens kommentererKommentarerna för årets utgåva följer ett tidigare mönster. Ganska låg svarsfrekvens (30-35%), normalfördelade kommentarer kring att mittenläge på ganska nöjda studenter. Det får året införda kamratgranskningen av rapporten har mottagits positivt. Några studenter ifrågasätter att detta behövs för ingenjörer, medan andra beskriver det som en intressant och nyttig kurs.Några kommentarer från C-studenter är sannolikt införda på fel kurs.Programledarens kommentarerKursen är väl genomförd. Den täcker ett stort ämnesområde och kursansvariga lärare behöver plocka ut de delar som de särskilt vill lyfta fram. Detta bidrar till att några studenter tycker att kursen är spretig och saknar \"röd tråd\". Kursen ska genomföras en gång till innan den ersätts som del av förändringarna inom obligatoriet på D. Det är därför inte motiverat att göra några större förändringar i kursen. Studenterna är överlag nöjda med kursen.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 2 (alternativobligatoriska kurser)": [
      {
        "code": "FMAF01",
        "name": "Matematik - Funktionsteori",
        "points": "7.0",
        "year": "14/15",
        "registered": "5",
        "percentPassed": "60%",
        "teachingScore": "-25",
        "goalClearnessScore": "+13",
        "assessmentScore": "+69",
        "workloadScore": "-17",
        "importanceScore": "0",
        "satisfactionScore": "+33",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAF05",
        "name": "Matematik - System och transformer",
        "points": "7.0",
        "year": "14/15",
        "registered": "4",
        "percentPassed": "75%",
        "teachingScore": "+33",
        "goalClearnessScore": "+50",
        "assessmentScore": "+38",
        "workloadScore": "+63",
        "importanceScore": "+50",
        "satisfactionScore": "+50",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd Kurs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 3 (obligatoriska kurser)": [
      {
        "code": "FAFF25",
        "name": "Fysik",
        "points": "11.0",
        "year": "14/15",
        "registered": "80",
        "percentPassed": "68%",
        "teachingScore": "+1",
        "goalClearnessScore": "+14",
        "assessmentScore": "+41",
        "workloadScore": "+15",
        "importanceScore": "-38",
        "satisfactionScore": "+12",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iDenna uppgift har ej fyllts i."
      },
      {
        "code": "ETSF01",
        "name": "Ingenjörsprocessen för programvaruutveckling - ekonomi och kvalitet",
        "points": "4.0",
        "year": "14/15",
        "registered": "90",
        "percentPassed": "59%",
        "teachingScore": "-37",
        "goalClearnessScore": "-25",
        "assessmentScore": "-36",
        "workloadScore": "+24",
        "importanceScore": "-22",
        "satisfactionScore": "-57",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKursens syfte inklusive dess relevans för ingenjörsyrket behöver kommuniceras och förtydligas ytterligare till studenterna genom hela kursen och inte bara (som nu) med en tyngdpunkt på första föreläsningen. I år bjöd jag in en gästföreläsare från industrin som fick bra feedback av studenterna. Detta skulle kunna utökas med ytterligare någon gäst.Andra förbättringar som gjordes för denna omgång behöver påpekas och syftet förklaras tydligare. T ex, tillägget av ett verklighetsbaserat fall i projektuppgiften med syfte att ge en inblick i hur kursinnehållet relaterar till verkliga projekt. Balansen mellan teori o praktik i projektuppgiften ska även revideras mot ett större fokus på de praktiska aspekterna av de givna fallen, t ex att göra en aktivitetsplan för projekt x i verktyg y och inte enbart redovisa utvärderingen av verktyg y.Projektet syftar till att ge möjlighet att jobba med större delen av kursinnehållet, och därmed va en förberedelser för tentan. Detta ska förmedlas tydligare i nästa kursomgång.De pedagogiska vinsterna med kamratgranskningar (som i år ersatte stora delar av handledar-feedbacken) ska påpekas och göras tydligare. Handledarkompetensen ligger här till stor del i de checklistor som används under övningen. Detta behöver förmedlas i klartext. Vi ska även tipsa studenterna om att checklistorna kan användas som hjälp i det egna skrivandet.De initiala problemen vi hade på övningarna med att lösa logistiken (matcha författare mot granskare) kan ha haft en negativ påverkan även på resten av övningen. Inför nästa kursomgång planerar jag att förbättra detta genom (att som studenterna föreslår) allokera rapporterna som ska granskas innan övningen. Studenterna kan då läsa igenom dessa innan, vara bättre förberedda och kunna fokusera på granskningsuppgiften redan från början av passet. En annan förbättring gällande övningarna som utnyttjar handlarnas kompetens bättre och tydligare (inte bara representerad i checklistorna) vore att ha en gemensam genomgång av vanliga kommentarer mot slutet på övningspassen.Inför nästa kursomgång innehåller kursplanen läromål om skrivande. Det förtydligar att detta ingår i kursen, och att dessa moment (projektrapport + övningarna) är viktiga och även att de är ett redskap för lärande om kursens ämnesområde.Programledarens kommentarerI och med förändningen av det obligatoriska blocket på D kommer denna kurs att läggas ner. Två kursomgångar återstår dock. Mot bakgrund av detta är det inte rimligt att göra några större förändringar av kursen.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering bg - Bilder och grafik": [
      {
        "code": "FMAN20",
        "name": "Bildanalys",
        "points": "7.5",
        "year": "14/15",
        "registered": "60",
        "percentPassed": "85%",
        "teachingScore": "+44",
        "goalClearnessScore": "+24",
        "assessmentScore": "+71",
        "workloadScore": "+7",
        "importanceScore": "+60",
        "satisfactionScore": "+56",
        "comments": "KommentarerStudierådets kommentarerStudenterna är överlag nöjda med den här kursen. Föreläsaren är väldigt duktig. Det som behöver förbättras är instruktionerna till inlämningsuppgifterna, de behöver bli tydligare. Sedan så läses kursen av både svenska och internationella studenter, vilket gör att allt borde ha namn på engelska, till exempel filer och variabelnamn.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattades av studenterna. I synnerhet föreläsaren fick goda omdömen av studenterna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN25",
        "name": "Interaktionsdesign",
        "points": "7.5",
        "year": "14/15",
        "registered": "68",
        "percentPassed": "97%",
        "teachingScore": "+26",
        "goalClearnessScore": "+3",
        "assessmentScore": "+55",
        "workloadScore": "+43",
        "importanceScore": "+56",
        "satisfactionScore": "+35",
        "comments": "Studierådets kommentarerStudenterna tycker att det är roligt och lärorikt att få jobba tillsammans med studenter från andra program. En del skulle önska att grupperna blev tilldelad till en så att man säkert var blandat med människor och därmed får ut som mest av projektet.Många tycker att målet med projektet inte är tillräckligt tydligt och det är svårt att veta vad som förväntas av en. Vissa studenter menar också att nivån är för låg för en kurs på A-nivå.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerMixen av studenter från olika program verkar inte fungerat helt friktionsfritt. Hur kan den positiva styrkan i denna mixning utnyttjas bättre?CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "14/15",
        "registered": "105",
        "percentPassed": "74%",
        "teachingScore": "+2",
        "goalClearnessScore": "+27",
        "assessmentScore": "+41",
        "workloadScore": "+38",
        "importanceScore": "+54",
        "satisfactionScore": "+36",
        "comments": "KommentarerStudierådets kommentarerKursen har i stort sett fungerat bra. Övningsuppgifterna samt dess facit fick en hel del kritik på grund av felaktigheter.Kurslärarens kommentererKursen har fungerat ganska bra trots att förkunskaperna hos olika grupper av studenter har varit väldigt skiftande. Detta har gjort att en del studenter upplevt kursen som svår och andra som ganska lätt. Nästa år kommer övningsuppgifterna att grupperas på ett sätt som gör det möjligt att välja utifrån förkunskapsnivå. Då studenterna hade läst väldigt många olika grundkurser i matematisk statistik blev det svårt att hantera behovet av en grundkurs-formelsamling på tentan.   Därför kommer formelsamlingen i fmsf10 att utökas så att relevant material från grundkursen finns med.Programledarens kommentarerKursen har i stort sett fungerat bra i år. Viss kritik finns mot kurslitteraturen som är nyutvecklad, men som kommer att fixas till under kommande revisioner. Viss kritik finns också mot en övningsledare som haft bristfälliga språkkunskaper.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN35",
        "name": "Högpresterande datorgrafik",
        "points": "7.5",
        "year": "14/15",
        "registered": "21",
        "percentPassed": "71%",
        "comments": ""
      },
      {
        "code": "FAFF20",
        "name": "Multispektral avbildning",
        "points": "7.5",
        "year": "14/15",
        "registered": "14",
        "percentPassed": "43%",
        "comments": ""
      },
      {
        "code": "FMAN40",
        "name": "Projekt i tillämpad matematik",
        "points": "3.0",
        "year": "14/15",
        "registered": "4",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "MAMN01",
        "name": "Avancerad interaktionsdesign",
        "points": "7.5",
        "year": "14/15",
        "registered": "52",
        "percentPassed": "100%",
        "teachingScore": "+51",
        "goalClearnessScore": "+39",
        "assessmentScore": "+63",
        "workloadScore": "+30",
        "importanceScore": "+83",
        "satisfactionScore": "+63",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKursansvarig och handledare tycker att kursen flyter på relativt bra, men att vårterminens lp2 inte är optimal för en projektkurs eftersom den är uppdelad.Ett nytt moment i år var en obligatorisk inlämningsuppgift i Android-programmering, som till kommande år kommer att stramas upp lite.För att eventuellt överbrygga den uppdelade läsperioden kan det också bli aktuellt med mer tydlig projekt-planering.Vi jobbar också kontinuerligt med att försöka bli bättre/tydligare på återkoppling under kursens gång.Programledarens kommentarerDet är glädjande att notera att kursen fungerar mycket bra och att studenterna anser att kursen är mycket angelägen för utbildningen.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIF10",
        "name": "Signalbehandling - design och implementering",
        "points": "7.5",
        "year": "14/15",
        "registered": "28",
        "percentPassed": "64%",
        "teachingScore": "+21",
        "goalClearnessScore": "+9",
        "assessmentScore": "+65",
        "workloadScore": "+36",
        "importanceScore": "+79",
        "satisfactionScore": "+50",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSN20",
        "name": "Spatial statistik med bildanalys",
        "points": "7.5",
        "year": "14/15",
        "registered": "12",
        "percentPassed": "100%",
        "teachingScore": "+79",
        "goalClearnessScore": "+43",
        "assessmentScore": "+80",
        "workloadScore": "+13",
        "importanceScore": "+79",
        "satisfactionScore": "+79",
        "comments": "Studierådets kommentarerKursen har fungerat mycket bra. Föreläsningarna och övningarna har varit mycket uppskattade.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen verkar ha fungerat bra. Tyvärr är det för få studenter som svarat på CEQ för att dra några slutsatser.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering dpd - Design av processorer och digitala system": [
      {
        "code": "ETIN20",
        "name": "Digital IC-konstruktion",
        "points": "7.5",
        "year": "14/15",
        "registered": "21",
        "percentPassed": "52%",
        "comments": ""
      },
      {
        "code": "EITF35",
        "name": "Digitala strukturer på kisel",
        "points": "7.5",
        "year": "14/15",
        "registered": "29",
        "percentPassed": "93%",
        "teachingScore": "+32",
        "goalClearnessScore": "+29",
        "assessmentScore": "+44",
        "workloadScore": "-11",
        "importanceScore": "+64",
        "satisfactionScore": "+43",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN70",
        "name": "Modern elektronik",
        "points": "7.5",
        "year": "14/15",
        "registered": "23",
        "percentPassed": "52%",
        "comments": ""
      },
      {
        "code": "EITF20",
        "name": "Datorarkitektur",
        "points": "7.5",
        "year": "14/15",
        "registered": "45",
        "percentPassed": "71%",
        "teachingScore": "+10",
        "goalClearnessScore": "+6",
        "assessmentScore": "-10",
        "workloadScore": "+35",
        "importanceScore": "+63",
        "satisfactionScore": "+33",
        "comments": "Studierådets kommentarerStudenterna var nöjda med kursen och deras grundliga förklarningar med verkliga exempel, studenterna var även nöjda med att kursen höll sig relaterad till dagens utvecklingar inom ämnet. Det fanns dock en del som var missnöjda med labbarna som kändes väldigt utdaterade, och på samma gång så var det för få handledare på labbarna.Kurslärarens kommentererKursen kommer att tas över av en annan lärare nästa gång den går. Jag har givit honom följande kommentarer:* Det behövs fler lab-assistenter på labbarna* Kursen behöver uppdateras - gäller även kurslitteraturen* Labbarna behöver uppdateras riktigt mycket! (behovet har varit känt länge men budget och personal situationen har inte medgivit detta)Programledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling. Dock kan det vara läge att se över laborationerna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF40",
        "name": "Digitala och analoga projekt",
        "points": "7.5",
        "year": "14/15",
        "registered": "8",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "ETIN45",
        "name": "DSP-design",
        "points": "7.5",
        "year": "14/15",
        "registered": "11",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "ESSF10",
        "name": "Mätteknik",
        "points": "5.0",
        "year": "14/15",
        "registered": "72",
        "percentPassed": "100%",
        "teachingScore": "+71",
        "goalClearnessScore": "+69",
        "assessmentScore": "+52",
        "workloadScore": "+47",
        "importanceScore": "+78",
        "satisfactionScore": "+89",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererJag upplever att kursen fungerar mycket bra vilket är roligt. Detta framgår också av vår egen enkät där vi riktar oss direkt mot de olika momenten i kursen. Vi har fått någon synpunkt på att vissa laborationer dragit över en del. Vi har inte ändrat signifikant på innehållet sedan något år tillbaka och vet egentligen inte riktigt vad det beror på. Vi kommer att gå igenom lab-innehållen inför kommande kurs för att se om det är något vi kan förtydliga eller förändra/stryka.Programledarens kommentarerMycket bra och välfungerande kurs, som uppskattats av studenterna. Styrd gruppindelning samt användande av Live@Lund för rapportinlämning diskuterades.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN35",
        "name": "IC-projekt 1",
        "points": "7.5",
        "year": "14/15",
        "registered": "13",
        "percentPassed": "69%",
        "comments": ""
      },
      {
        "code": "EDAN15",
        "name": "Konstruktion av inbyggda system",
        "points": "7.5",
        "year": "14/15",
        "registered": "45",
        "percentPassed": "76%",
        "teachingScore": "-38",
        "goalClearnessScore": "-35",
        "assessmentScore": "+21",
        "workloadScore": "+15",
        "importanceScore": "+61",
        "satisfactionScore": "-13",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe course addresses both hardware and software issues of embedded systems and is addressed to students with different background. Typically, students from D, E, M, and international master programs SoCware and Wireless Communication attend the course. This means that the different parts of lectures are difficult for different students. Moreover, labs are addressing both programming and hardware development to illustrate hardware/software co-design issues. This, together with use of commercial SDK (system development kit from Xilinx) makes the course demanding.This year we had most of the time three assistants (instead of two) that was supposed to improve supervision during labs. The lectures included also a short introduction and explanation of FPGA technology for students not familiar with this. However, it is difficult to avoid more advanced parts both regarding hardware design (mainly VHDL) and software issues (mostly real-time parts). We plan to restructure some parts of the material to better reflect current trends in embedded many-core systems.Programledarens kommentarerKursen täcker ett stort ämnesområde och kyrsen har studenter med olika bakgrund. Därför upplever en del studenter vissa kursmoment som svåra, t.ex. VHDL för D-studenter. Kursansvariga har ansträngt sig för att överbrygga dessa svårigheter.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN40",
        "name": "IC-projekt 2",
        "points": "7.5",
        "year": "14/15",
        "registered": "11",
        "percentPassed": "55%",
        "comments": ""
      },
      {
        "code": "ETIN55",
        "name": "Integrerade A/D och D/A omvandlare",
        "points": "7.5",
        "year": "14/15",
        "registered": "19",
        "percentPassed": "100%",
        "comments": ""
      }
    ],
    "Specialisering is - Inbyggda system": [
      {
        "code": "EDAA25",
        "name": "C-programmering",
        "points": "3.0",
        "year": "14/15",
        "registered": "129",
        "percentPassed": "40%",
        "teachingScore": "+33",
        "goalClearnessScore": "+21",
        "assessmentScore": "+48",
        "workloadScore": "-6",
        "importanceScore": "+71",
        "satisfactionScore": "+46",
        "comments": "KommentarerStudierådets kommentarerVi diskuterade att öka kursinhållet för att gör kursen bättre för att få den att passa med andra kurser men kom fram till att detta inte skulle gå då lth har nerskärningar. Vi kom även fram till att rättarna ska bli mera konsekventa i sin rättning. Föreläsaren skulle även vara bättre att informera om kursen angående labbar och övningar i början av kursen.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattades av studenterna. Särskilt föreläsaren uppskattades. Arbetsbelastningen anses vara mycket hög varför kursinnehållet relaterat till antalet poäng kan ses över.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF35",
        "name": "Digitala strukturer på kisel",
        "points": "7.5",
        "year": "14/15",
        "registered": "29",
        "percentPassed": "93%",
        "teachingScore": "+32",
        "goalClearnessScore": "+29",
        "assessmentScore": "+44",
        "workloadScore": "-11",
        "importanceScore": "+64",
        "satisfactionScore": "+43",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN65",
        "name": "Kompilatorer",
        "points": "7.5",
        "year": "14/15",
        "registered": "49",
        "percentPassed": "71%",
        "teachingScore": "+46",
        "goalClearnessScore": "+49",
        "assessmentScore": "+58",
        "workloadScore": "+13",
        "importanceScore": "+83",
        "satisfactionScore": "+62",
        "comments": "Studierådets kommentarerStudenterna är överlag nöjda med det här kursen. Det som behöver förbättras är en lämpligare arbetsbelastning på labbarna. Sedan skulle det varit bra med en exempeltenta.Det är en skyldighet som kursansvarig att skriva hur många poäng varje uppgift ger på tentan.Kurslärarens kommentererStudenterna verkar överlag mycket nöjda med kursen och tycker den är mycket angelägen för deras utbildning. På CEQ-mötet diskuterade vi ett antal olika förbättringar som kan göras.Uppgifterna (labbarna) varierar mycket i svårighet. Till nästa år kommer vi att flytta vissa moment mellan uppgifterna för att jämna ut arbetet något, men framförallt kommer vi att i förväg berätta hur mycket tid de olika uppgifterna brukar ta, så att det är lättare för studenterna att planera sitt arbete. I år kunde vi inte göra detta eftersom kursen gavs för första gången. Ett antal detaljer i uppgifterna kommer också att förtydligas och förbättras.På labbarna fick studenterna ibland vänta länge för att få hjälp eller för att få sin labb godkänd. Vi kommer nästa år att strukturera om arbetet så att de som väntar kan börja med att diskutera med varandra, och kan därmed hjälpa och lära av varandra. Vid redovisningen kommer vi att diskutera med flera grupper samtidigt, både för att snabba upp redovisningarna, och för att ge studenterna möjlighet att lära sig av varandras lösningar.Tentan upplevdes som för enkel av några studenter genom att den primärt testade det som gicks igenom på labbarna. Tentan fungerar dock som enskild examination, och kan inte tas bort eftersom labbarna görs i par. Min ambition är också att lägga in mer teoriuppgifter i nästa års tenta.Övningsuppgifterna (som är frivilliga) upplevdes som mycket nyttiga. Vissa kursdelar har dock mycket få övningar, och det är min ambition att lägga till fler efter hand. Efter hand kommer också gamla tentor att fungera som extra övningar.Vi använde ett väldigt enkelt kursforum, med en enda tråd för allt, men formuet utnyttjades ganska lite. Nästa år planerar vi att använda ett bättre forum, t.ex. Piazza, för att underlätta diskussioner.Programledarens kommentarerEn väl genomförd kurs. Studenterna har upplevt att labbarna var väldigt givande, men att tidsåtgången varierade mellan labbarna. detta medförde att en del studenter periodvis fick problem med arbetsbelastningen. Vid nästa kursomgång ska läraren tydligare informera om förväntad tidsåtgång för de olika labbarna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EIEF01",
        "name": "Tillämpad mekatronik",
        "points": "10.0",
        "year": "14/15",
        "registered": "49",
        "percentPassed": "45%",
        "teachingScore": "+44",
        "goalClearnessScore": "+34",
        "assessmentScore": "+84",
        "workloadScore": "+22",
        "importanceScore": "+73",
        "satisfactionScore": "+62",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe CEQ for Applied Mechatronics has been well appreciated. We will continue to make improvements;For the individual project:The webpage shall be better organized with structured labels at the data files. The milestones have worked very well. For the next course, they will be set to one week earlier. The C programming part will be postponed. A booking system for the computers in 4h periods will be introduced next year. The control lectures by Karl-Erik Årzén will be better advertized.For the industry project:Information on the fact that the project has a practical follow-up course already in May. Presentation dates set at the start of the course.Thank you all for a good time!Gunnar, Gabriel, Fran, HenrietteCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF20",
        "name": "Datorarkitektur",
        "points": "7.5",
        "year": "14/15",
        "registered": "45",
        "percentPassed": "71%",
        "teachingScore": "+10",
        "goalClearnessScore": "+6",
        "assessmentScore": "-10",
        "workloadScore": "+35",
        "importanceScore": "+63",
        "satisfactionScore": "+33",
        "comments": "Studierådets kommentarerStudenterna var nöjda med kursen och deras grundliga förklarningar med verkliga exempel, studenterna var även nöjda med att kursen höll sig relaterad till dagens utvecklingar inom ämnet. Det fanns dock en del som var missnöjda med labbarna som kändes väldigt utdaterade, och på samma gång så var det för få handledare på labbarna.Kurslärarens kommentererKursen kommer att tas över av en annan lärare nästa gång den går. Jag har givit honom följande kommentarer:* Det behövs fler lab-assistenter på labbarna* Kursen behöver uppdateras - gäller även kurslitteraturen* Labbarna behöver uppdateras riktigt mycket! (behovet har varit känt länge men budget och personal situationen har inte medgivit detta)Programledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling. Dock kan det vara läge att se över laborationerna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN80",
        "name": "Algoritmer i signalprocessorer - projektkurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "16",
        "percentPassed": "94%",
        "comments": ""
      },
      {
        "code": "EITN30",
        "name": "Internet inuti",
        "points": "7.5",
        "year": "14/15",
        "registered": "36",
        "percentPassed": "94%",
        "teachingScore": "+50",
        "goalClearnessScore": "+68",
        "assessmentScore": "+80",
        "workloadScore": "+23",
        "importanceScore": "+95",
        "satisfactionScore": "+95",
        "comments": "Studierådets kommentarerOerhört lärorik kurs där studenterna får ta mycket ansvar och planera sitt arbete själva. Labbhandledningarna är genomtänka och labbarna rätar ut de frågetecken som uppstått under veckan.Föreläsarna är väldigt duktiga och förstår de problem som kan uppstå under utvecklingsprocessen.Kanske hade ytterligare en labbtid i sista veckan varit önskvärt då många inte blir klara under sista labben och därefter står utan schemalagt handledningstillfälle.Bortsett från första lektionen, som går igenom den hårdvara, ger lektionerna inte speciellt mycket. T.ex. Ethernet och IP har gåtts igenom i många tidigare kurser. Det märks dock att föreläsarna har väldigt stor erfarenhet och fokus får gärna ligga mer på Embedded Programming i industrin än på de olika protokollen i TCP/IP-stacken.Det går att läsa kursen helt utan C/C++-vana men då måste man vara beredd att lägga ned ordentligt med tid för att begripa konceptet med pekare.Sammanfattningsvis en väldigt bra kurs som verkligen rekommenderas för de som uppskattar mycket eget ansvar och att kontinuerligt ta sig an nya utmaningar.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs och programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN15",
        "name": "Konstruktion av inbyggda system",
        "points": "7.5",
        "year": "14/15",
        "registered": "45",
        "percentPassed": "76%",
        "teachingScore": "-38",
        "goalClearnessScore": "-35",
        "assessmentScore": "+21",
        "workloadScore": "+15",
        "importanceScore": "+61",
        "satisfactionScore": "-13",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe course addresses both hardware and software issues of embedded systems and is addressed to students with different background. Typically, students from D, E, M, and international master programs SoCware and Wireless Communication attend the course. This means that the different parts of lectures are difficult for different students. Moreover, labs are addressing both programming and hardware development to illustrate hardware/software co-design issues. This, together with use of commercial SDK (system development kit from Xilinx) makes the course demanding.This year we had most of the time three assistants (instead of two) that was supposed to improve supervision during labs. The lectures included also a short introduction and explanation of FPGA technology for students not familiar with this. However, it is difficult to avoid more advanced parts both regarding hardware design (mainly VHDL) and software issues (mostly real-time parts). We plan to restructure some parts of the material to better reflect current trends in embedded many-core systems.Programledarens kommentarerKursen täcker ett stort ämnesområde och kyrsen har studenter med olika bakgrund. Därför upplever en del studenter vissa kursmoment som svåra, t.ex. VHDL för D-studenter. Kursansvariga har ansträngt sig för att överbrygga dessa svårigheter.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF35",
        "name": "Operativsystem",
        "points": "7.5",
        "year": "14/15",
        "registered": "75",
        "percentPassed": "29%",
        "teachingScore": "+51",
        "goalClearnessScore": "+45",
        "assessmentScore": "+26",
        "workloadScore": "+20",
        "importanceScore": "+97",
        "satisfactionScore": "+72",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Eventuellt kan labbarna ses över.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ks - Kommunikationssystem": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "14/15",
        "registered": "64",
        "percentPassed": "97%",
        "teachingScore": "-23",
        "goalClearnessScore": "-11",
        "assessmentScore": "+25",
        "workloadScore": "+6",
        "importanceScore": "+76",
        "satisfactionScore": "-9",
        "comments": "Studierådets kommentarerKursen grundupplägg är bra men innehållet måste förbättras. Det första är att kursinnehålet kommer att minska till nästa år. Nytt material ska tas fram så att man som student lättare kan orientera sig i det materialet som kursen går igenom.Till exempel ska skapa förläsningsanteckningar över förläsningarna som studenterna kan ta del av. Förbättra slidesen men även hänvisa till relevant forskning inom området. Även Quizarna ska se över så att dessa speglar kursen bättre.Även vissa projekt måste förtydligas så att det blir klart vad man skall göra.Kurslärarens kommentererThis was the third time the course was organized after the major reorganization of security courses. Summarizing the experiences of the students and teacher the contents of the course has been too ambitious in its scope. Neither students not teacher had time to go into depth. During the meeting with the student representative and the program coordinator the following changes were agreed.1. Reduce the number of topics to allow a more in-depth treatment2. Prepare lecture notes containing reference reading material for the topics3. Keep quizzes, improve them and connect them to the lecture notes4. Keep projects (possibly adaptions to the main course topics that remain)CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF15",
        "name": "Markovprocesser",
        "points": "7.5",
        "year": "14/15",
        "registered": "34",
        "percentPassed": "65%",
        "teachingScore": "+6",
        "goalClearnessScore": "+29",
        "assessmentScore": "+58",
        "workloadScore": "+58",
        "importanceScore": "+67",
        "satisfactionScore": "+42",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe comments have been generally positive. I will try to add some more details to the answers of the exercises as it was requested. However, the best way to learn the course is that the students attend the exercise sessions and discuss the problems with the teachers.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF05",
        "name": "Webbsäkerhet",
        "points": "4.0",
        "year": "14/15",
        "registered": "74",
        "percentPassed": "82%",
        "teachingScore": "+45",
        "goalClearnessScore": "+40",
        "assessmentScore": "+20",
        "workloadScore": "+35",
        "importanceScore": "+87",
        "satisfactionScore": "+66",
        "comments": "KommentarerStudierådets kommentarerStudenterna tyckte att föreläsaren var väldigt bra. Studenterna är överlag väldigt nöjda med kursen, det enda är att grupperna i projektet skulle kunnat vara mindre, så att alla fick pröva på både praktik och teori.Kurslärarens kommentererKursen upplevs som mycket angelägen för utbildningen vilket är glädjande. Studenterna verkar också nöjda med kursen så några större förändringar planeras inte inför kommande år. Några förändringar gjordes detta året, främst i avseende att fokusera mer på skriftlig och muntlig framställning. Detta gjorde att projektet ökade lite i storlek. I gengäld var grupperna på fyra personer istället för som tidigare två. Av kommentarerna att döma var det några som upplevde projektet som för litet medan lika många upplevde det som för stort. På mötet med studentrepresentanter diskuterades bland annat detta och slutsatsen var ungefär att det var lagom stort.Programledarens kommentarerDet är glädjande att notera att kursen återigen bedöms ha mycket hög relevans för utbildningen. Kursen har fungerat bra, och vid CEQ-mötet ventilerades några eventuella förbättringsförslag.Svarsfrekvensen 78% är imponerande!CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN41",
        "name": "Avancerad webbsäkerhet",
        "points": "7.5",
        "year": "14/15",
        "registered": "101",
        "percentPassed": "92%",
        "teachingScore": "+51",
        "goalClearnessScore": "+55",
        "assessmentScore": "+64",
        "workloadScore": "-6",
        "importanceScore": "+95",
        "satisfactionScore": "+77",
        "comments": "Studierådets kommentarerStudenterna kände i allmänhet att kursen var väldigt bra och att den kändes väldigt angelägen för deras utbildning. Det var även omtyckt med strukturen på kursen, dock fanns det ett visst missnöje i arbetsbördan då studenter fann att det var allt för mycket för en 7.5p Kurs samt att de hade velat veta om i förväg hur mycket tid de borde lägga på de olika momenten i kursen.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETTN01",
        "name": "Digital kommunikation, fortsättningskurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "32",
        "percentPassed": "78%",
        "teachingScore": "+30",
        "goalClearnessScore": "+15",
        "assessmentScore": "+21",
        "workloadScore": "-1",
        "importanceScore": "+46",
        "satisfactionScore": "+43",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSF10",
        "name": "Internetprotokoll",
        "points": "7.5",
        "year": "14/15",
        "registered": "37",
        "percentPassed": "54%",
        "teachingScore": "+23",
        "goalClearnessScore": "+25",
        "assessmentScore": "+41",
        "workloadScore": "+5",
        "importanceScore": "+58",
        "satisfactionScore": "+17",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDIN01",
        "name": "Kryptoteknik",
        "points": "7.5",
        "year": "14/15",
        "registered": "45",
        "percentPassed": "49%",
        "teachingScore": "+15",
        "goalClearnessScore": "+31",
        "assessmentScore": "+70",
        "workloadScore": "-9",
        "importanceScore": "+80",
        "satisfactionScore": "+45",
        "comments": "Studierådets kommentarerFöreläsare/övningsledare var väldigt uppskattade och kursen upplevs som väl genomförd. Projekten var givande, men rätt tidskrävande.Den matematiska förkunskapen som krävs borde förtydligas.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN10",
        "name": "Algebraiska strukturer",
        "points": "7.5",
        "year": "14/15",
        "registered": "13",
        "percentPassed": "23%",
        "comments": ""
      },
      {
        "code": "ETSN01",
        "name": "Avancerad telekommunikation",
        "points": "7.5",
        "year": "14/15",
        "registered": "38",
        "percentPassed": "66%",
        "teachingScore": "-39",
        "goalClearnessScore": "-57",
        "assessmentScore": "-11",
        "workloadScore": "-61",
        "importanceScore": "-26",
        "satisfactionScore": "-58",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThere seem to be a number of structural problems with the course and its place in the Wireless masters program, which were apparent both during the course and from students' comments on the evalutation questionnaire. Students come into the course lacking the background knowledge in statistics, networking and programming to be adequately able to handle the advanced topics in this course - mostly focusing on modelling and analysis of network performance.A recurring comment from students on the evaluation was that there was too much to memorise in the course. I believe this stems from the fact that topics that should have been already familiar to the students from a basic networking course, they were instead seeing for the first time, leading to an excessive amount of self-study required to come up to the level where they could work on the actual course material.Another issue students raised was that the labs did not involve enough practical work from the students themselves. This is true but it is very difficult to design good lab classes for this course as many students have no or little background in programming, which is the single most important skill required to do any practical work relating to network performance. Both simulations and experiments with actual hardware require programming and there is simply not time in the course to teach it from scratch to a level where it can be applied to these problems (it was tried in previous years of the course and did not work at all). Instead students ran pre-made simulations and analysed their results.The third main problem raised by students was that they felt the course was not relevant to their masters program as it does not focus on the physical layer. This is true and the course was never intended to cover physical layer concepts, which are covered extensively in other courses in the program. However, an understanding of the surrounding system is important even to an engineer who focuses on the physical layer, which is the reason for the course's presence in the program.To address these problems, we are taking two approaches. First, we have begun discussions with those responsible for the wireless program to try to address the underlying problems - that students do not have the background knowledge required before taking this course, and that the course's place in the program needs to be re-examined. Second, we are looking at what can be done directly for next year.It is clear that many students are not getting much out of the course as it currently stands and as such we will remove some existing lectures in order to make time to cover basic networking protocols and concepts, perhaps with a more advanced self-study option for those students who do already have the assumed knowledge. We will also change the first lab so that students implement a simplified simulation themselves, so that they gain a better understanding of how the simulations they are running in later labs work and why. Unfortunately, unless programming experience becomes required for entry into the program, or courses are added to teach this prior to students taking ETSN01, it is not feasible to make the labs be as practical and student-driven as we would like.Lastly I will attempt to make it more clear throughout the lectures how the course content connects to other parts of the wireless program and why it is important for students to have an overall understanding of networking performance.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN30",
        "name": "Internet inuti",
        "points": "7.5",
        "year": "14/15",
        "registered": "36",
        "percentPassed": "94%",
        "teachingScore": "+50",
        "goalClearnessScore": "+68",
        "assessmentScore": "+80",
        "workloadScore": "+23",
        "importanceScore": "+95",
        "satisfactionScore": "+95",
        "comments": "Studierådets kommentarerOerhört lärorik kurs där studenterna får ta mycket ansvar och planera sitt arbete själva. Labbhandledningarna är genomtänka och labbarna rätar ut de frågetecken som uppstått under veckan.Föreläsarna är väldigt duktiga och förstår de problem som kan uppstå under utvecklingsprocessen.Kanske hade ytterligare en labbtid i sista veckan varit önskvärt då många inte blir klara under sista labben och därefter står utan schemalagt handledningstillfälle.Bortsett från första lektionen, som går igenom den hårdvara, ger lektionerna inte speciellt mycket. T.ex. Ethernet och IP har gåtts igenom i många tidigare kurser. Det märks dock att föreläsarna har väldigt stor erfarenhet och fokus får gärna ligga mer på Embedded Programming i industrin än på de olika protokollen i TCP/IP-stacken.Det går att läsa kursen helt utan C/C++-vana men då måste man vara beredd att lägga ned ordentligt med tid för att begripa konceptet med pekare.Sammanfattningsvis en väldigt bra kurs som verkligen rekommenderas för de som uppskattar mycket eget ansvar och att kontinuerligt ta sig an nya utmaningar.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs och programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN45",
        "name": "Informationsteori",
        "points": "7.5",
        "year": "14/15",
        "registered": "50",
        "percentPassed": "74%",
        "teachingScore": "+48",
        "goalClearnessScore": "+47",
        "assessmentScore": "+43",
        "workloadScore": "+17",
        "importanceScore": "+58",
        "satisfactionScore": "+63",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe course is working good. The aim to explain the practical consequences of the theory seems to be appreciated by the students, especially through the hand in problems. During some years I have rebuilt the contents and now I think it has found its right form. There are naturally still improvements to be done but in the overall picture I am satisfied with it.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN21",
        "name": "Projekt i trådlös kommunikation",
        "points": "7.5",
        "year": "14/15",
        "registered": "25",
        "percentPassed": "44%",
        "teachingScore": "+60",
        "goalClearnessScore": "+41",
        "assessmentScore": "+52",
        "workloadScore": "+5",
        "importanceScore": "+83",
        "satisfactionScore": "+58",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering pv - Programvara": [
      {
        "code": "EDAN55",
        "name": "Avancerade algoritmer",
        "points": "7.5",
        "year": "14/15",
        "registered": "55",
        "percentPassed": "93%",
        "teachingScore": "+34",
        "goalClearnessScore": "+6",
        "assessmentScore": "+78",
        "workloadScore": "+13",
        "importanceScore": "+81",
        "satisfactionScore": "+60",
        "comments": "KommentarerStudierådets kommentarerStudenterna fann kursen intressant, dock var det otydligt vad som krävdes av studenterna. Dessutom är det svårt att kommunicera med kursansvarig eftersom denne inte svarar på mejl och bara jobbar deltid på LTH.Sedan så fanns det felaktigheter på tentan, samt ingen kom så att man kunde fråga om tentan. Kursansvarig rättade tentan långsamt, tentaresultatet kom fyra veckor senare än vad som är okej.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattades av studenterna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA25",
        "name": "C-programmering",
        "points": "3.0",
        "year": "14/15",
        "registered": "129",
        "percentPassed": "40%",
        "teachingScore": "+33",
        "goalClearnessScore": "+21",
        "assessmentScore": "+48",
        "workloadScore": "-6",
        "importanceScore": "+71",
        "satisfactionScore": "+46",
        "comments": "KommentarerStudierådets kommentarerVi diskuterade att öka kursinhållet för att gör kursen bättre för att få den att passa med andra kurser men kom fram till att detta inte skulle gå då lth har nerskärningar. Vi kom även fram till att rättarna ska bli mera konsekventa i sin rättning. Föreläsaren skulle även vara bättre att informera om kursen angående labbar och övningar i början av kursen.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattades av studenterna. Särskilt föreläsaren uppskattades. Arbetsbelastningen anses vara mycket hög varför kursinnehållet relaterat till antalet poäng kan ses över.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN65",
        "name": "Kompilatorer",
        "points": "7.5",
        "year": "14/15",
        "registered": "49",
        "percentPassed": "71%",
        "teachingScore": "+46",
        "goalClearnessScore": "+49",
        "assessmentScore": "+58",
        "workloadScore": "+13",
        "importanceScore": "+83",
        "satisfactionScore": "+62",
        "comments": "Studierådets kommentarerStudenterna är överlag nöjda med det här kursen. Det som behöver förbättras är en lämpligare arbetsbelastning på labbarna. Sedan skulle det varit bra med en exempeltenta.Det är en skyldighet som kursansvarig att skriva hur många poäng varje uppgift ger på tentan.Kurslärarens kommentererStudenterna verkar överlag mycket nöjda med kursen och tycker den är mycket angelägen för deras utbildning. På CEQ-mötet diskuterade vi ett antal olika förbättringar som kan göras.Uppgifterna (labbarna) varierar mycket i svårighet. Till nästa år kommer vi att flytta vissa moment mellan uppgifterna för att jämna ut arbetet något, men framförallt kommer vi att i förväg berätta hur mycket tid de olika uppgifterna brukar ta, så att det är lättare för studenterna att planera sitt arbete. I år kunde vi inte göra detta eftersom kursen gavs för första gången. Ett antal detaljer i uppgifterna kommer också att förtydligas och förbättras.På labbarna fick studenterna ibland vänta länge för att få hjälp eller för att få sin labb godkänd. Vi kommer nästa år att strukturera om arbetet så att de som väntar kan börja med att diskutera med varandra, och kan därmed hjälpa och lära av varandra. Vid redovisningen kommer vi att diskutera med flera grupper samtidigt, både för att snabba upp redovisningarna, och för att ge studenterna möjlighet att lära sig av varandras lösningar.Tentan upplevdes som för enkel av några studenter genom att den primärt testade det som gicks igenom på labbarna. Tentan fungerar dock som enskild examination, och kan inte tas bort eftersom labbarna görs i par. Min ambition är också att lägga in mer teoriuppgifter i nästa års tenta.Övningsuppgifterna (som är frivilliga) upplevdes som mycket nyttiga. Vissa kursdelar har dock mycket få övningar, och det är min ambition att lägga till fler efter hand. Efter hand kommer också gamla tentor att fungera som extra övningar.Vi använde ett väldigt enkelt kursforum, med en enda tråd för allt, men formuet utnyttjades ganska lite. Nästa år planerar vi att använda ett bättre forum, t.ex. Piazza, för att underlätta diskussioner.Programledarens kommentarerEn väl genomförd kurs. Studenterna har upplevt att labbarna var väldigt givande, men att tidsåtgången varierade mellan labbarna. detta medförde att en del studenter periodvis fick problem med arbetsbelastningen. Vid nästa kursomgång ska läraren tydligare informera om förväntad tidsåtgång för de olika labbarna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN20",
        "name": "Språkteknologi",
        "points": "7.5",
        "year": "14/15",
        "registered": "62",
        "percentPassed": "92%",
        "teachingScore": "+23",
        "goalClearnessScore": "+43",
        "assessmentScore": "+15",
        "workloadScore": "+47",
        "importanceScore": "+54",
        "satisfactionScore": "+43",
        "comments": "Studierådets kommentarerStudenterna är överlag nöjda med den här kursen, men tycker att arbetsbelastningen är för låg. Kanske införa en obligatorisk tenta som lösning?Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattades av studenterna. Studenterna efterfrågar en tydligare individuell examination för att säkerställa att alla som blir godkända faktiskt lärt sig kursens innehåll.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN40",
        "name": "Funktionsprogrammering",
        "points": "7.5",
        "year": "14/15",
        "registered": "81",
        "percentPassed": "52%",
        "teachingScore": "+17",
        "goalClearnessScore": "+10",
        "assessmentScore": "+49",
        "workloadScore": "+1",
        "importanceScore": "+80",
        "satisfactionScore": "+40",
        "comments": "Studierådets kommentarerStudenterna var nöjda med kursen fast det fanns många som tyckte att föreläsningarna var svåra att hänga med på och att inlämningsuppgifterna gav alldeles för stor arbetsbörda. Kurslitteraturen som rekommenderas var väldigt omtyckt, det enda dåliga med den var att studenterna var osäkra på om den täckte allt som kursen innefattade eller ej.Kurslärarens kommentererIn a discussion with course representatives the following steps have been defined in order to improve the quality of the course:1. Assignment 2 (Functional Music) will be taken away. Actually this step is motivated by the demand from LTH to make the course cheaper. As this assignment was most time-consuming for the TAs, this is the most obvious way to save money. However, it also coincides with demands of some of the students.2. I will prepare a separate lecture on type theory and type inference and I will introduce appropriate exercises during one of the class sessions.3. The checking will become more swift after assignment 2 will have been removed. Besides, we plan to have a reserve TA available in case there was a demand for it. This year (2014) such a reserve TA has been employed way too late.4. I will prepare a document available on the course site specifying the expectations for the exam. At this moment they are defined implicitely by previous exams.5. I will make clear my opinion about the textbooks, as apparently I failed to pass my view to the students.6. I will try to improve lectures by including more substantial practical examples. In particular, this applies to Monads and Typeclasses lectures, considered incomprehensible by some.Sincerely,Jacek MalecProgramledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling. Dock bör studenternas kommentarer beaktas för mindre utveckling av kursen.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN01",
        "name": "Constraint-programmering",
        "points": "7.5",
        "year": "14/15",
        "registered": "80",
        "percentPassed": "80%",
        "teachingScore": "-2",
        "goalClearnessScore": "+19",
        "assessmentScore": "+53",
        "workloadScore": "+41",
        "importanceScore": "+45",
        "satisfactionScore": "+20",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattas av studenterna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF15",
        "name": "Algoritmimplementering",
        "points": "5.0",
        "year": "14/15",
        "registered": "111",
        "percentPassed": "21%",
        "teachingScore": "+21",
        "goalClearnessScore": "+13",
        "assessmentScore": "+20",
        "workloadScore": "+34",
        "importanceScore": "+62",
        "satisfactionScore": "+38",
        "comments": "Studierådets kommentarerFöreläsaren har varit mycket uppskattad bland studenterna både gällande föreläsningsinnehållet och hur det framförs men en något bättre struktur på ordningen av kursinnehållet efterfrågas. Något som behöver förbättras är kurshemsidan då den upplevdes vara ouppdaterad, projektet i kursen ansågs också behöva få tydligare och uppdaterade instruktioner.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEDAF15 är en kurs som fungerat bra i många år och så också denna gång. Inga större ändringar planeras.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAA15",
        "name": "Diskret matematik",
        "points": "7.5",
        "year": "14/15",
        "registered": "58",
        "percentPassed": "34%",
        "teachingScore": "+44",
        "goalClearnessScore": "+48",
        "assessmentScore": "+68",
        "workloadScore": "+45",
        "importanceScore": "+85",
        "satisfactionScore": "+65",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerFMAA15 är en kurs som fungerat bra i många år och så också denna gång. Inga större ändringar planeras.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering se - Software engineering": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "14/15",
        "registered": "64",
        "percentPassed": "97%",
        "teachingScore": "-23",
        "goalClearnessScore": "-11",
        "assessmentScore": "+25",
        "workloadScore": "+6",
        "importanceScore": "+76",
        "satisfactionScore": "-9",
        "comments": "Studierådets kommentarerKursen grundupplägg är bra men innehållet måste förbättras. Det första är att kursinnehålet kommer att minska till nästa år. Nytt material ska tas fram så att man som student lättare kan orientera sig i det materialet som kursen går igenom.Till exempel ska skapa förläsningsanteckningar över förläsningarna som studenterna kan ta del av. Förbättra slidesen men även hänvisa till relevant forskning inom området. Även Quizarna ska se över så att dessa speglar kursen bättre.Även vissa projekt måste förtydligas så att det blir klart vad man skall göra.Kurslärarens kommentererThis was the third time the course was organized after the major reorganization of security courses. Summarizing the experiences of the students and teacher the contents of the course has been too ambitious in its scope. Neither students not teacher had time to go into depth. During the meeting with the student representative and the program coordinator the following changes were agreed.1. Reduce the number of topics to allow a more in-depth treatment2. Prepare lecture notes containing reference reading material for the topics3. Keep quizzes, improve them and connect them to the lecture notes4. Keep projects (possibly adaptions to the main course topics that remain)CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN25",
        "name": "Interaktionsdesign",
        "points": "7.5",
        "year": "14/15",
        "registered": "68",
        "percentPassed": "97%",
        "teachingScore": "+26",
        "goalClearnessScore": "+3",
        "assessmentScore": "+55",
        "workloadScore": "+43",
        "importanceScore": "+56",
        "satisfactionScore": "+35",
        "comments": "Studierådets kommentarerStudenterna tycker att det är roligt och lärorikt att få jobba tillsammans med studenter från andra program. En del skulle önska att grupperna blev tilldelad till en så att man säkert var blandat med människor och därmed får ut som mest av projektet.Många tycker att målet med projektet inte är tillräckligt tydligt och det är svårt att veta vad som förväntas av en. Vissa studenter menar också att nivån är för låg för en kurs på A-nivå.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerMixen av studenter från olika program verkar inte fungerat helt friktionsfritt. Hur kan den positiva styrkan i denna mixning utnyttjas bättre?CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSN05",
        "name": "Programvaruutveckling för stora system",
        "points": "7.5",
        "year": "14/15",
        "registered": "70",
        "percentPassed": "97%",
        "teachingScore": "+24",
        "goalClearnessScore": "+15",
        "assessmentScore": "+60",
        "workloadScore": "-3",
        "importanceScore": "+70",
        "satisfactionScore": "+40",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN10",
        "name": "Konfigurationshantering",
        "points": "7.5",
        "year": "14/15",
        "registered": "55",
        "percentPassed": "98%",
        "teachingScore": "+52",
        "goalClearnessScore": "+42",
        "assessmentScore": "+42",
        "workloadScore": "-14",
        "importanceScore": "+69",
        "satisfactionScore": "+69",
        "comments": "Studierådets kommentarerStudenterna har varit väldigt nöjda med kursen detta året, speciellt videopresentationerna har uppskattats mycket som ett sätt att lättare förstå delar av materialet. Även diskussionsföreläsningarna har uppskattats av många som ett sätt att förstå materialet bättre. Det har varit väldigt roligt att föreläsaren är engagerad och brinner för sitt ämne.En del studenter har anmärkt på att litteraturen är gammal. Föreläsaren försöker hitta nyare källor men de täcker inte materialet lika bra och det är svårare att få tillåtelse att kopiera materialet. Istället hoppas han få tid att skriva om en av de mer kritiserade artiklarna som ersättning.En del studenter anser också att arbetsbördan har varit väldigt hög, men föreläsaren har försökt få med så mycket att det täcker de 200 timmar kursen ska vara och känner inte att det finns möjlighet att minska delar av kursen då den då inte kommer uppfylla tillräckligt många timmar.Att slides till videopresentationerna bör ingå i det utdelade kursmaterialet (nu fanns det bara på nätet) påpekades och föreläsaren har sagt att det ska finnas med nästa år så man kan skriva ner funderingar direkt.En del klagomål kom in om att projektet hamnade lite konstigt på grund av den nya läsårsindelningen, men föreläsaren känner inte att han kan tidigarelägga det eftersom eleverna måste ha lärt sig alla väsentliga delar i kursen innan projektet kan påbörjas. Däremot ska presentationen av projektet komma tidigare.Föreläsaren ska även göra om lite i  labbhandledningarna för att få in mer om change set model och composition model.Kurslärarens kommentererIt is a great satisfaction to see that last year's good evaluation of the course have become even better on all parameters. It is particularly satisfying that students are very happy with the course and that they rate it as having \"Clear Goals and Standards\" and \"Appropriate Assessment\". It is no surprise that students also this year has a subjective feeling of a not \"Appropriate Workload\" (even if it has improved slightly from last year.Digging deeper into the numbers it is possible to find things where good things can be made even better. For Good Teaching, question 18 gets the lowest rating (+33): Since money for teaching are being cut down more teaching staff feedback will not be possible - however, with a more consistent use of Student Peer Assessment more (student) feedback can be obtained for no or little teacher time. For Clear Goals and Standards, questions 6 and 18 get the lowest rating (+33): I will try to keep focus on what is expected from the student throughout the whole course and not just at the start (and end) of the course. For Appropriate Assessment, the ratings for questions 8 and 12 puzzle me since they seem to be in contradiction: Maybe I should make more clear that there are some basic facts, techniques and terminology you need to know (memorise?) to pass the course, but that you need to demonstrate a much deeper understanding if you want \"to do well\". For Appropriate Workload, ratings for questions 14 and 24 seem to be in contradiction: I try to make it clear that you do not have to \"comprehend *everything* thoroughly\" since the course covers many topics and in breath - apparently I have to try harder to be clear on that.From my own evaluation form, it results that this year's two new aspects of the course (Introduction videos & Student Peer Assessment) was liked by most students (rating 3.58 and 3.60 respectively on a scale from 5 to 1). The Introduction videos are there now and are \"optional\" to use, so I will probably not spend more time and resources on \"improving\" that aspect (apart from giving printed hand-outs as suggesten by one of the student representatives) - if students don't find them useful they can just quit watching them. The Student Peer Assessments are a wonderful way of creating not just more feedback for students in a cost-efficient way, but more importantly to create occasions for more and deeper learning by reviewing someone else's work. There were some - more or less - constuctive comments from students that I will integrate with my own experience and reflection to improve and extend the use of Student Peer Assessment next year.Programledarens kommentarerVäl genomförd kurs. Propgramledningen ser inget behov av större förändringar.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN01",
        "name": "Constraint-programmering",
        "points": "7.5",
        "year": "14/15",
        "registered": "80",
        "percentPassed": "80%",
        "teachingScore": "-2",
        "goalClearnessScore": "+19",
        "assessmentScore": "+53",
        "workloadScore": "+41",
        "importanceScore": "+45",
        "satisfactionScore": "+20",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som uppskattas av studenterna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ssr - System, signaler och reglering": [
      {
        "code": "FRTN10",
        "name": "Flervariabel reglering",
        "points": "7.5",
        "year": "14/15",
        "registered": "60",
        "percentPassed": "78%",
        "teachingScore": "+18",
        "goalClearnessScore": "+21",
        "assessmentScore": "+55",
        "workloadScore": "+1",
        "importanceScore": "+64",
        "satisfactionScore": "+45",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererRoligt att se skillnaden i omdömen från föregående år. Som kommentarerna visar finns det dock mer kvar att förbättra, både när det gäller innehåll och kursmaterial.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN55",
        "name": "Signalseparation - oberoende komponenter",
        "points": "7.5",
        "year": "14/15",
        "registered": "17",
        "percentPassed": "88%",
        "comments": ""
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "14/15",
        "registered": "105",
        "percentPassed": "74%",
        "teachingScore": "+2",
        "goalClearnessScore": "+27",
        "assessmentScore": "+41",
        "workloadScore": "+38",
        "importanceScore": "+54",
        "satisfactionScore": "+36",
        "comments": "KommentarerStudierådets kommentarerKursen har i stort sett fungerat bra. Övningsuppgifterna samt dess facit fick en hel del kritik på grund av felaktigheter.Kurslärarens kommentererKursen har fungerat ganska bra trots att förkunskaperna hos olika grupper av studenter har varit väldigt skiftande. Detta har gjort att en del studenter upplevt kursen som svår och andra som ganska lätt. Nästa år kommer övningsuppgifterna att grupperas på ett sätt som gör det möjligt att välja utifrån förkunskapsnivå. Då studenterna hade läst väldigt många olika grundkurser i matematisk statistik blev det svårt att hantera behovet av en grundkurs-formelsamling på tentan.   Därför kommer formelsamlingen i fmsf10 att utökas så att relevant material från grundkursen finns med.Programledarens kommentarerKursen har i stort sett fungerat bra i år. Viss kritik finns mot kurslitteraturen som är nyutvecklad, men som kommer att fixas till under kommande revisioner. Viss kritik finns också mot en övningsledare som haft bristfälliga språkkunskaper.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETTN01",
        "name": "Digital kommunikation, fortsättningskurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "32",
        "percentPassed": "78%",
        "teachingScore": "+30",
        "goalClearnessScore": "+15",
        "assessmentScore": "+21",
        "workloadScore": "-1",
        "importanceScore": "+46",
        "satisfactionScore": "+43",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN60",
        "name": "Optimal och adaptiv signalbehandling",
        "points": "7.5",
        "year": "14/15",
        "registered": "23",
        "percentPassed": "52%",
        "teachingScore": "+19",
        "goalClearnessScore": "+8",
        "assessmentScore": "+53",
        "workloadScore": "+21",
        "importanceScore": "+64",
        "satisfactionScore": "+18",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN80",
        "name": "Algoritmer i signalprocessorer - projektkurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "16",
        "percentPassed": "94%",
        "comments": ""
      },
      {
        "code": "FRTN15",
        "name": "Prediktiv reglering",
        "points": "7.5",
        "year": "14/15",
        "registered": "38",
        "percentPassed": "66%",
        "teachingScore": "-32",
        "goalClearnessScore": "-19",
        "assessmentScore": "+44",
        "workloadScore": "-21",
        "importanceScore": "+79",
        "satisfactionScore": "+14",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "BMEN01",
        "name": "Medicinsk signalbehandling",
        "points": "7.5",
        "year": "14/15",
        "registered": "22",
        "percentPassed": "59%",
        "comments": ""
      },
      {
        "code": "ETIF10",
        "name": "Signalbehandling - design och implementering",
        "points": "7.5",
        "year": "14/15",
        "registered": "28",
        "percentPassed": "64%",
        "teachingScore": "+21",
        "goalClearnessScore": "+9",
        "assessmentScore": "+65",
        "workloadScore": "+36",
        "importanceScore": "+79",
        "satisfactionScore": "+50",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTA35",
        "name": "Introduktionskurs i kinesiska för civilingenjörer",
        "points": "15.0",
        "year": "14/15",
        "registered": "14",
        "percentPassed": "93%",
        "teachingScore": "+100",
        "goalClearnessScore": "+94",
        "assessmentScore": "-25",
        "workloadScore": "+100",
        "importanceScore": "+100",
        "satisfactionScore": "+100",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMNN25",
        "name": "Avancerad kurs i numeriska algoritmer med Python/SciPy",
        "points": "7.5",
        "year": "14/15",
        "registered": "21",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "ETIF05",
        "name": "Grundläggande radioteknik",
        "points": "7.5",
        "year": "14/15",
        "registered": "53",
        "percentPassed": "79%",
        "teachingScore": "+39",
        "goalClearnessScore": "+36",
        "assessmentScore": "+23",
        "workloadScore": "+16",
        "importanceScore": "+45",
        "satisfactionScore": "+45",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MMKF15",
        "name": "Tillämpad Robotteknik",
        "points": "7.5",
        "year": "14/15",
        "registered": "38",
        "percentPassed": "87%",
        "teachingScore": "+21",
        "goalClearnessScore": "-41",
        "assessmentScore": "+66",
        "workloadScore": "+36",
        "importanceScore": "+14",
        "satisfactionScore": "-23",
        "comments": "Studierådets kommentarerBland den positiva kritiken för projektet nämns att det är väldigt uppskattat och givande. Möjligheten att själva välja projekt och komma på egna idéer uppskattas av studenterna. Dock anser många att det behövs mer tydlighet och struktur vad gäller t.ex. instruktioner och deadlines. Det nämns även att projektidéer behöver kollas mer genomgående. Lärarna får beröm för att vara duktiga på sitt ämne, samt sympatiska och tillmötesgående. Programmeringsdelen anses vara alltför svår sett till förkunskapskraven (EDA501). Man önskar även att projektgrupperna innefattar studenter från olika program så att studenterna kan komplettera varandra bättre gällande kunskaper i olika ämnen.Kurslärarens kommentererThe main issues raised and commented on in the CEQ-report are on thecourse information and communication regarding e.g., deadlines and more details on what is expected from different parts of the course. We fully agree that this is very important information and the full schedule should be clearly stated from the beginning.To avoid the confusion with several hand-ins and deadlines,we will for next year include this years separate assignments to be natural components  and tasks within the compulsory course projects, which also could start earlier in the study period.We are glad that the lab exercises are considered as useful and relevant and we are also overall very happy with the projects done this year.It is worth mentioning that some good project outcomes from this year will be integrated in a couple of exercises to better illustrate and practice concepts from the lectures.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN15",
        "name": "Olinjära dynamiska system",
        "points": "7.5",
        "year": "14/15",
        "registered": "11",
        "percentPassed": "27%",
        "comments": ""
      },
      {
        "code": "EITA05",
        "name": "Teknikhistoria",
        "points": "4.5",
        "year": "14/15",
        "registered": "92",
        "percentPassed": "89%",
        "teachingScore": "+31",
        "goalClearnessScore": "+55",
        "assessmentScore": "+38",
        "workloadScore": "+75",
        "importanceScore": "+9",
        "satisfactionScore": "+56",
        "comments": "KommentarerStudierådets kommentarerStudenterna var nöjda med kursen och kände att den hade väldigt varierande och intressant innehåll, vissa av studenterna kände dock att vissa föreläsningar var av lägre kvalitet än de andra samt att de tyckte informationen kring inlämningar och liknande kunde varit tydligare.Kurslärarens kommentererÖverlag är studenterna nöjda med denna kurs vilket är bra. Det finns dock två områden som bör ses över inför nästa kursstart vilket både jag själv tycker och studenternas kommentarer indikerar.Först, kursen består idag av en serie föreläsningar om olika områden inom teknikhistoria som skall ge en bredd av insikter i den tekniska utvecklingen och historien omkring samt belysa gemensam påverkan mellan samhälle och teknik genom historien. Det saknas dock en sammanhållande vetenskaplig bas för de olika momenten i form av en introduktion till historiskt perspektiv och metodik. Hur man behandlar informationen i föreläsningarna mm.Sedan är informationen om kriterierna för betygssättningen i fördjupningsarbetet lite bristfällig och skall klargöras.Programledarens kommentarerVäl genomförd kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMIF15",
        "name": "Teknisk miljövetenskap",
        "points": "7.5",
        "year": "14/15",
        "registered": "22",
        "percentPassed": "68%",
        "comments": ""
      },
      {
        "code": "GEMA25",
        "name": "Tyska för tekniker",
        "points": "7.5",
        "year": "14/15",
        "registered": "19",
        "percentPassed": "89%",
        "comments": ""
      },
      {
        "code": "GEMA70",
        "name": "Japanska för tekniker",
        "points": "15.0",
        "year": "14/15",
        "registered": "13",
        "percentPassed": "46%",
        "comments": ""
      },
      {
        "code": "FMAN30",
        "name": "Medicinsk bildanalys",
        "points": "7.5",
        "year": "14/15",
        "registered": "23",
        "percentPassed": "74%",
        "comments": ""
      },
      {
        "code": "FRTN05",
        "name": "Olinjär reglering och servosystem",
        "points": "7.5",
        "year": "14/15",
        "registered": "48",
        "percentPassed": "75%",
        "teachingScore": "+32",
        "goalClearnessScore": "+40",
        "assessmentScore": "+53",
        "workloadScore": "+7",
        "importanceScore": "+89",
        "satisfactionScore": "+75",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMNN05",
        "name": "Simuleringsverktyg",
        "points": "7.5",
        "year": "14/15",
        "registered": "18",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "MAMF15",
        "name": "Arbetsorganisation och ledarskap",
        "points": "6.0",
        "year": "14/15",
        "registered": "42",
        "percentPassed": "69%",
        "teachingScore": "+11",
        "goalClearnessScore": "-10",
        "assessmentScore": "+6",
        "workloadScore": "+45",
        "importanceScore": "+70",
        "satisfactionScore": "+41",
        "comments": "Studierådets kommentarerDet studenterna tycker är det bästa med kursen är att den känns relevant för vår utbildning och inför arbetslivet. Det är en kurs med bra upplägg och många olika moment vilket har uttryckts som positivt. Att det diskuteras på föreläsningarna uppskattas också. De flesta tycker att de reflektioner som man har skrivit inför och efter gästföreläsningar har varit ett väldigt bra sätt att lära sig på och gjort att man har hängt med väldigt bra i kursen. Vad gäller gästföreläsningarna så råder det delade meningar. De allra flesta är positivt inställda till själva momentet att det kommer någon utifån som berättar om deras erfarenheter. Däremot var det varierande kvalité på dessa då vissa inte upplevdes lika spännande och inspirerande som andra.Enligt många är det främst informationsflödet mellan kursansvarig och studenter som behöver förbättras. Ofta var det otydligt med vilka deadlines som gällde och de kom även upp sent, vilket gjorde att föreläsaren inte verkade så strukturerad. Det hade även varit uppskattat att få reda på poängstatus innan tentan så man kunde ha prioriterat sina andra tentor efter detta. Alltså bättre återkoppling på de moment som gjorts, t.ex. reflektionerna så man kunde fått reda på om de höll bra standard. Anonyma reflektioner har önskats då vissa upplevde att de inte vågade skriva vad de verkligen tyckte om gästföreläsningarna p.g.a. rädsla för sänkt betyg.Kurslärarens kommentererKursen fungerar överlag bra. Kursen tillämpar en kontinuerlig examination där djupare kunskaper och reflektioner examineras i form av inlämningsuppgifter och projektarbete med poster och artikel. Det pedagogiska upplägget får överlag bra kritik men flera studenter efterlyser tydligare deadlines och krav på inlämningsuppgifter. Till följd av alla moment finns många olika deadlines där de flesta funnits tillgängliga via schemat, medan vissa varit anpassningsbara utifrån kursdeltagarnas önskemål. Inför nästa år kommer samtliga deadlines att vara schemalagda. De mallar som finns avseende inlämningsuppgifter kommer att presenteras mer ingående och med exempel ifrån tidigare årskurser.Programledarens kommentarerEn mycket uppskattad kurs. Både kursen i sig och kursansvarig får många fina vitsord från studenterna. Dock efterfrågas, liksom förra året, ökad tydlighet vad gäller instruktioner kring uppgifter och en tydligare kursstruktur.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN10",
        "name": "Kanalmodellering för trådlös kommunikation",
        "points": "7.5",
        "year": "14/15",
        "registered": "31",
        "percentPassed": "68%",
        "teachingScore": "+26",
        "goalClearnessScore": "-2",
        "assessmentScore": "+13",
        "workloadScore": "-35",
        "importanceScore": "+79",
        "satisfactionScore": "+26",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIA10",
        "name": "Patent och annan immaterialrätt",
        "points": "7.5",
        "year": "14/15",
        "registered": "55",
        "percentPassed": "73%",
        "teachingScore": "+37",
        "goalClearnessScore": "+40",
        "assessmentScore": "+15",
        "workloadScore": "+65",
        "importanceScore": "+32",
        "satisfactionScore": "+70",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerÖverlag välfungerande kurs. Kursens övningsuppgifter diskuterades; studenterna önskar fler uppgifter som bättre täcker in kursinnehållet samt mer kompletta lösningar. Kursansvarig kommenterar att målet med kursen framförallt är att förstå principer och terminologi och inte att öva räknefärdighet. Detta ska om möjligt ytterligare förtydligas i nästa års kurs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MMKN30",
        "name": "Servicerobotik",
        "points": "7.5",
        "year": "14/15",
        "registered": "14",
        "percentPassed": "64%",
        "comments": ""
      },
      {
        "code": "GEMA01",
        "name": "Franska för tekniker: språk, kultur och samhällsliv, grundkurs",
        "points": "7.5",
        "year": "14/15",
        "registered": "7",
        "percentPassed": "57%",
        "comments": ""
      },
      {
        "code": "GEMA65",
        "name": "Kinesiska för tekniker",
        "points": "7.5",
        "year": "14/15",
        "registered": "8",
        "percentPassed": "63%",
        "comments": ""
      },
      {
        "code": "EIEN01",
        "name": "Mekatronik, industriell produktframtagning",
        "points": "10.0",
        "year": "14/15",
        "registered": "23",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "FMAN25",
        "name": "Variationskalkyl",
        "points": "7.5",
        "year": "14/15",
        "registered": "16",
        "percentPassed": "69%",
        "comments": ""
      },
      {
        "code": "FMSN30",
        "name": "Linjär och logistisk regression",
        "points": "7.5",
        "year": "14/15",
        "registered": "25",
        "percentPassed": "72%",
        "comments": ""
      },
      {
        "code": "EEMN01",
        "name": "Mikrosensorer",
        "points": "7.5",
        "year": "14/15",
        "registered": "30",
        "percentPassed": "97%",
        "teachingScore": "+13",
        "goalClearnessScore": "+3",
        "assessmentScore": "+19",
        "workloadScore": "+43",
        "importanceScore": "+29",
        "satisfactionScore": "+7",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTN30",
        "name": "Nätverksdynamik",
        "points": "7.5",
        "year": "14/15",
        "registered": "27",
        "percentPassed": "33%",
        "teachingScore": "+35",
        "goalClearnessScore": "-13",
        "assessmentScore": "+65",
        "workloadScore": "+28",
        "importanceScore": "+50",
        "satisfactionScore": "+50",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN15",
        "name": "Radiosystem",
        "points": "7.5",
        "year": "14/15",
        "registered": "35",
        "percentPassed": "51%",
        "teachingScore": "+33",
        "goalClearnessScore": "+24",
        "assessmentScore": "+33",
        "workloadScore": "-17",
        "importanceScore": "+68",
        "satisfactionScore": "+41",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN10",
        "name": "Interaktion 1: Neuromodellering, kognitiv robotik och agenter",
        "points": "7.5",
        "year": "14/15",
        "registered": "42",
        "percentPassed": "98%",
        "teachingScore": "+14",
        "goalClearnessScore": "-11",
        "assessmentScore": "+67",
        "workloadScore": "+28",
        "importanceScore": "+62",
        "satisfactionScore": "+23",
        "comments": "KommentarerStudierådets kommentarerStudenterna tycker att detta är en relevant kurs för utbildningen. Men den kursansvarige har inte tagit tillräckligt stort ansvar för den administrativa delen av kursen, instruktioner har varit otydliga/inkonsekventa och målen har inte följt kursplanen. Uppdatera kursplanen behöver göras och kursen måste anpassas mer till LTH studenter administrativt sett.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETTN15",
        "name": "Moderna trådlösa system - LTE och dess efterföljare",
        "points": "7.5",
        "year": "14/15",
        "registered": "19",
        "percentPassed": "89%",
        "comments": ""
      },
      {
        "code": "EITN10",
        "name": "Multipelantennsystem",
        "points": "7.5",
        "year": "14/15",
        "registered": "27",
        "percentPassed": "63%",
        "teachingScore": "+43",
        "goalClearnessScore": "+33",
        "assessmentScore": "+32",
        "workloadScore": "-19",
        "importanceScore": "+85",
        "satisfactionScore": "+57",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iDenna uppgift har ej fyllts i."
      },
      {
        "code": "EEMN10",
        "name": "Datorbaserade mätsystem",
        "points": "7.5",
        "year": "14/15",
        "registered": "28",
        "percentPassed": "89%",
        "teachingScore": "+17",
        "goalClearnessScore": "+5",
        "assessmentScore": "+55",
        "workloadScore": "+59",
        "importanceScore": "+44",
        "satisfactionScore": "+21",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EEMN05",
        "name": "EMC, störningar och störningsbegränsning",
        "points": "7.5",
        "year": "14/15",
        "registered": "26",
        "percentPassed": "100%",
        "teachingScore": "+45",
        "goalClearnessScore": "+55",
        "assessmentScore": "+35",
        "workloadScore": "+49",
        "importanceScore": "+82",
        "satisfactionScore": "+79",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN15",
        "name": "Interaktion 2: Virtualitet och kognitiv modellering",
        "points": "7.5",
        "year": "14/15",
        "registered": "34",
        "percentPassed": "100%",
        "teachingScore": "+50",
        "goalClearnessScore": "+9",
        "assessmentScore": "+87",
        "workloadScore": "+13",
        "importanceScore": "+76",
        "satisfactionScore": "+60",
        "comments": "KommentarerStudierådets kommentarerFrån min synvinkel fick vi inte särskilt många oväntade svar utan vi visste att kursen var i ett mellanskede av terminsomställningar och problemen det genererat. Förslagen kursansvariga har föreslagit till hösten 2016 känns i grunden genomtänkt men kräver en del justeringar som diskuterats på mötet.Förslaget på fler obligatoriska moment tror jag är en bra idé då det hade \u0091tvingat\u0092 studenter som jobbar heltid att faktiskt planera om och kunna delta i kursen som planerat. Det är dock farligt att göra allt obligatoriskt då många av föreläsningar för vissa grupper varit orelevanta baserat på projektet man har. Obligatorisk närvaro på redovisning är positivt!En tanke om obligatorisk 4­h workshop där 80% närvaro krävs är bra till viss del. Den typen av workshops är väldigt bra för att samla gruppen till eventuella handledarmöten, och även ett sätt för handledarna att mer aktivt kunna delta i gruppens arbetsprocess och se vilka av studenterna som inte bidrar till projektet. 80% skulle kunna minskas till 70%.All planerad omarbetning av formatet mittredovisning är genomtänkt.Förslaget att förlänga antalet kursveckor för att matcha LTHs period är väsentlig. Det kommer ge mer kraft åt rapportskrivningen. Som det låg nu blev det på tok för mycket i sista veckorna.Att höja ribban ser jag som mycket positivt. Som upplägget var i höst slang många igenom med oförtjänt högt betyg utifrån LTHs mått. Det borde bli snavare betygskriterier för 4:a och 5:a.Kurslärarens kommentererKursutvecklingsmöte för MAMN15 (och i viss mån MAMN10, då kurserna hänger ihop). I mötet deltog två av fyra lärare, programansvarig för masterprogrammet i kognitionsvetenskap och alla fyra kursrepresentanterna, två från LTH och två från kognitionsvetenskap (för samma kurser men med kurskoderna KOGP10 och KOGP05).Lärarna hade satt samman ett dokument med förslag för kursutveckling som hade distribuerats till alla innan mötet.Vi gjorde en gemensam genomgång av ceq-utvärderingen för båda studentgrupperna. Först såg vi om det fanns några saker där bedömningarna skilde sig åt mellan studentgrupperna men i stort stämde bedömningarna mycket väl överens. Lärarna betonade värdet av att göra ceq-utvärderingen för båda studentgrupperna istället för två olika slags utvärderingar: Med den direkta jämförelsen kan vi mycket bättre säkra att förändringar och vidareutvecklingar i kursen tar hänsyn till båda grupperna.Därefter gick vi igenom sådant som indikeras som \u0094problem\u0094 eller \u0094svaghet\u0094 av ceq-materialet. Inga områden hade negativa poäng/staplar, men relativt sett lägst värden hade \u0094arbetsinsats\u0094 och \u0094tydliga mål\u0094. Vi diskuterade detta i förhållande till fritextsvaren i materialet och studentrepresentanternas erfarenheter.Arbetsinsatsproblemen var inte ett utan två olika problem. Det blev stressigt för ganska många i delkurs 2 som var kompakt. Å andra sidan kom från båda studentgrupperna önskemål om att det ska ställas högre krav för alla betygsstegen. Vi diskuterade kring betygen, om det skulle vara en fördel med endast G/U. För detta talar att det ändå i så hög grad är en produkt eller produkter man får med sig från kursen och kan ha i sin portfölj och visa upp. Mot detta talar att betyg kan spela roll t.ex. när man söker sommarjobb samt att kurserna för teknologer ligger inom en specialisering, och det finns intresse hos en del studenter att kunna visa ett (högt) betyg i just kurser inom den egna specialiseringen.Problemet med otydliga mål handlar framförallt om att presentationen av betygskriterierna kom in för sent i kursen och inte i en tillräckligt tydlig form. För en del studenter handlar det också om att lärarna inte sätter upp tydliga delmål för vad de ska göra och uppnå i sitt projekt. Detta är dock en av de bärande idéerna med kursen \u0096 det finns inga på förhand givna delmål som lärarna kan sätta upp, utan det är något gruppen ska ta fram på egen hand med lärarna som bollplank.Trots de organisatoriska problemen med stress i en kort delkurs två och ett nytt terminssystem på LTH som orsakade flera sena ommöbleringar i schemat, är kursutvärderingen mycket positiv. En stor majoritet i båda studentgrupperna säger sig vara nöjda med kursen/kurserna och ger höga betyg på relevansen av kursen/kurserna för sin utbildning. Med så många studenter som också kommenterar att det är den mest lärorika eller en av de mest lärorika kurserna under utbildningen, så har vi nått det vi vill med kursen/kurserna,Nedan en lista på de planerade förändringarna för nästa kursomgång. Vi diskuterade igenom samtliga punkter och var \u0096 ibland efter diskussion \u0096 överens om att förändringarna bör försöka genomföras.1. FLER OBLIGATORISKA MOMENT-\tObligatorisk närvaro vid alla redovisningar (För delkurs 1: mittredovisning x 2/3; slutredovisning x2; För delkurs 2: slutredovisning x 2). Ersättningsuppgifter vid frånvaro.-\tObligatorisk närvaro vid föreläsning om grupp-processer. Ersättningsuppgift vid frånvaro.-\tEtt obligatoriskt 4-timmarspass varje vecka (80% närvaro krävs): I grunden ett pass för team-arbete, där handledarna vet att det går att träffa alla grupper den tiden; en del handledning kommer planeras och ske under passet, och ca varannan vecka kommer vi lägga in workshop-pass (om 2, 3 eller 4 timmar) Dessa workshopar blir alltså också obligatoriska.Kommentar: I någon form önskat av många studenter, och det konkreta förslaget ovan är framtaget av studenter tillsammans med lärare.2. MODIFIERAT FORMAT MITTREDOVISNINGEN DELKURS 1-\tIstället för 2 dagar x 2 timmar (vid samma antal grupper, kring 16): tre dagar x 3 timmar för att få mer tid till frågor och diskussion.-\tTidigarelägga också för att kunna \u0094kicka igång\u0094 de grupper som är sena i starten.Kommentar: Studentgenererat förslag.3. FLER KURSVECKOR-\tLägga kurserna över *hela* höstterminen -- som sedan i år har samma betydelse för båda studentgrupperna, dvs från 1 sept till ca 20 jan.-\tHalvfartskurser över hela terminen.Tio veckor per delkurs.-\tDe muntliga slutredovisningarna läggs kring 14-15 januari och rapportinlämning 18 januari (med manusversion innan jul och kamratgranskning + fram till ca 14 jan.)Kommentar: Önskat av majoritet av studenterna från båda grupperna.4. FLER PARAMETRAR FÖR SKAPANDE AV TEAM-\tSom innan: Teknologer prioritera projekt (1-2 prio) eller blandad grupp-\tSom innan: Alla rangordna fyra projekt-\tSom innan men utökat: Fördela studenter som vill implementera/programmera på adekvat sätt (med hänsyn till projekt och grupp-sammansättningar)-\tNytt: Ta reda på vilka studenter som arbetar vid sidan om på ett sätt som hindrar dem att medverka fullt ut dagtid måndag-fredag. De som har andra engagemang sätts i egen grupp.-\tNytt: Försöka blanda teknologer från åk 4 och 5 (t.ex. undvika teknologgrupper med enbart åk5-teknologer, i synnerhet om inga (starka) kogvetare med i teamet)5. HÖJD RIBBA OCH BÄTTRE UTVÄRDERING FÖR GODKÄNT SÅVÄL SOM FÖR HÖGRE BETYG-\tKrav på individuell loggbok - av simplaste slag, men där man noterar ungefärligt antal timmar och vad man gjorde under dessa timmar-\tFör högsta betyg, t.ex. uttalat krav på att man utnyttjar lärmaterial som på olika sätt förmedlas i kursen i sin produkt samt rapport-\tUtökad diskussion om vad betyg har för roll och ej6. BÄTTRE PRESENTATION AV FÖRELÄSNINGAR OCH HÖJD NIVÅ-\tInformera på förhand, kort, vad föreläsningar ska handla om (undvika att någon tänker \u0092det är nog inte relevant\u0092 för att man känner igen titeln på föreläsningarna)-\tÖka svårighetsnivån på flera av föreläsningarna-\tInte rekommendera lo- och mid-fi-prototyp-workshopen för teknologerna-\tEv. lägga in en motsvarande \u0092grundlektion\u0092 i experimentdesign istället för teknologerna-\tOckså noga med att förklara vilken roll föreläsningar har, att använda för rapporter osv.7. TYDLIGARE OCH TIDIGARE FRAMSTÄLLNING AVMÅL OCH KRAV8. UTÖKAT KAMRATLÄRANDE-\tI relativt tidigt skede bilda par av team med inte alltför lika projekt.  Rekommenderade \u0094hjälpa-varandra-möten\u0094 var 14e dag, där man ses för att berätta om sina respektive projekt, läget, planer, frågor --- Syftet alltså att i) öka på kamratlärandet, som det finns stor potential för, och ii) få in 'breddning' genom att man i alla fall blir lite mer insatt i ytterligare ett projekt än det egna.-\tOm det blir relativt sett ont om kogvetare kan detta också vara ett sätt att se till att de flesta grupper får viss medverkan av (minst) en sådan person.9. UPPDATERA KURSPLANERNACEQ-enkäten fylldes iavslutande presentationer i kursen"
      },
      {
        "code": "EEMF05",
        "name": "Medicinsk mätteknik",
        "points": "7.5",
        "year": "14/15",
        "registered": "14",
        "percentPassed": "93%",
        "comments": ""
      },
      {
        "code": "EEMN15",
        "name": "Ultraljudsfysik och teknik",
        "points": "7.5",
        "year": "14/15",
        "registered": "11",
        "percentPassed": "100%",
        "comments": ""
      }
    ]
  }
}