{
  "C": {
    "Årskurs 1 (obligatoriska kurser)": [],
    "Årskurs 1 läser kursen i läsperiod 3. Årskurs 2 läser kursen i läsperiod 1.": [],
    "Årskurs 2 (obligatoriska kurser)": [],
    "Årskurs 3 (obligatoriska kurser)": [
      {
        "code": "EITF05",
        "name": "Webbsäkerhet",
        "points": "4.0",
        "year": "15/16",
        "registered": "90",
        "percentPassed": "98%",
        "teachingScore": "+49",
        "goalClearnessScore": "+31",
        "assessmentScore": "+18",
        "workloadScore": "+32",
        "importanceScore": "+79",
        "satisfactionScore": "+63",
        "comments": "KommentarerStudierådets kommentarerStudenterna uppfattar kursen som otroligt relevant vilket innebär att själva kursinnehållet håller en bra nivå. Förväntningarna på studenterna verkar ha brustit (m.a.p fråga 18, 25) något som kan motverkas om kommunikationen (antingen på föreläsningar eller via anvisningar i labhandledning/hemsida) förtydligas. Kursen överlag var mycket bra. Onlinetentan kommer att göras om nästa år för att fungera bättre och antagligen kommer man få använda kurslitteraturen under onlinetenan/duggan. Projektet var både lärorikt och intressant.Kurslärarens kommentererDen stora nyheten i årets version av kursen var onlineskrivningen, som fick blandad kritik. En förbättring för nästa år är att tillåta studenterna att ha kurslitteraturen tillgänglig när man skriver provet. En annan är att bättre förbereda studenterna på att det inte är en rutinmässig eller enkel skrivning - den tar tid.Projekten fungerade mestadels bra, vilket är glädjande. Eventuellt skulle man kunna fokusera mer på attackerna.Programledarens kommentarerDet är glädjande att notera att kursen återigen bedöms ha mycket hög relevans för utbildningen. Kursen har fungerat bra, och vid CEQ-mötet ventilerades några eventuella förbättringsförslag.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FAFF25",
        "name": "Fysik",
        "points": "11.0",
        "year": "15/16",
        "registered": "43",
        "percentPassed": "49%",
        "teachingScore": "-8",
        "goalClearnessScore": "+4",
        "assessmentScore": "+60",
        "workloadScore": "0",
        "importanceScore": "-56",
        "satisfactionScore": "0",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererDenna kurs går endast ett år till i sin nuvarande 11 hp form. Vi tycker att kursen har funnit sina former men att det stora problemet att kursen inte upplevs som särskilt relevant för utbildningen kvarstår. Denna kritik verkar mest inriktad på termodynamiken och hållbarhetsprojekten och dessa moment försvinner vid nästa omläggning. Under det sista året får vi försöka lägga ännu större vikt vid att tydligt förklara att även om dessa moment inte direkt kopplar till programeringsarbete så har dom stor relevans för själva ingenjörsrollen och studentens tekniska allmänbildning och förhållandet till samhället. Det går t.ex. knappast en enda dag utan att nyheter och tidningar diskuterar energi- och klimat-frågorProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN01",
        "name": "Avancerad interaktionsdesign",
        "points": "7.5",
        "year": "15/16",
        "registered": "45",
        "percentPassed": "96%",
        "teachingScore": "+47",
        "goalClearnessScore": "+15",
        "assessmentScore": "+70",
        "workloadScore": "+35",
        "importanceScore": "+85",
        "satisfactionScore": "+58",
        "comments": "Studierådets kommentarerMånga uppskattade projektet och tyckte att det var väldigt lärorikt men kringliggande saker behöver ses över. Work in Progress upplevdes som otydligt, det var svårt att få feedback på hur man låg till samt att det behöver kontrolleras hårdare att alla medlemmar faktiskt bidrarKurslärarens kommentererKursen går i det stora hela bra. Studenterna är nöjda med att få arbeta i projekt med relativt fria tyglar, vilket bidrar till hög motivation och hög genomströmning. Endast 13 av 45 har besvarat enkäten. Fritext-svaren tar trots detta upp relevanta saker att se över, även om några kommentarer är motstridiga. De två viktigaste punkterna vi ser är:I vårens kurs lade vi in en \u0094rapport-skiss\u0094 halvvägs in i projektet. Målen och kraven för denna skiss kommer vi att förtydliga ytterligare. Till kommande kurs kommer rapporten och teori-bakgrunden få ytterligare något större fokus, och en tydlig progression i rapport-skrivande jämfört med tidigare kurser i framför allt C-programmet ska artikuleras.Studenterna vill gärna ha löpande feedback på sitt projekt och känner att det är svårt att förstå vad man ska fokusera på (för att få bra betyg). Vi ska försöka vara (ännu) tydligare med kursmålen och förväntningarna, samt arbeta med tydligare eller mer strukturerad återkoppling på handledningstillfällena.En kommentar rör samarbets-problem i gruppen. Detta är något vi löpande arbetar med att förebygga, men kommer att strama upp det förebyggande arbetet genom att:1.\tLägga större tyngdpunkt på att hjälpa gruppen att artikulera förväntningar och roll-fördelning på första träffen2.\tAtt styra upp idé-genereringen ännu mer så att alla i grupperna känner sig delaktiga i beslut3.\tGöra en handlingsplan för vad som händer om samarbets-problem i gruppen ändå uppstårProgramledarens kommentarerVälfungerande kurs som uppskattas mycket av studenterna.KL och PL närvarande, inga studentrepresentanter.Fokus i diskussionen landade på projektarbetet och gruppdynamik (löpande feedback på projektet, gruppsammansättning,...).CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSF01",
        "name": "Ingenjörsprocessen för programvaruutveckling - ekonomi och kvalitet",
        "points": "4.0",
        "year": "15/16",
        "registered": "44",
        "percentPassed": "86%",
        "teachingScore": "-31",
        "goalClearnessScore": "-42",
        "assessmentScore": "+24",
        "workloadScore": "+17",
        "importanceScore": "+25",
        "satisfactionScore": "-43",
        "comments": "Studierådets kommentarerLite oklar kurs där det inte var självklart vad man skulle göra. Svårt att koppla momenten till kursnamnet. Varför så många examinerande objekt för så få poäng? Att ge feedback i skolan när man redan fått den den genom moodle var också ganska onödigt och man hade hellre kunnat spendera den tiden med att jobba på projektet då att träffa personerna inte tillförde något mer än själva moodle svarenKurslärarens kommentererKA response to CEQ for ETSF01 2015/16En av kursens största utmaningar är att förmedla relevansen av kursinnehållet, då det handlar om av icke-tekniska aspekter av programvaruutveckling (projektplanering/ledning etc.) Responsen är fortsatt blandad med både positiva och negativa fritext svar på denna punkt. Kursinnehållet behöver fortlöpande motiveras igenom hela kursen, inte bara i början. Årets två gästföreläsningar var uppskattade, och gav insikt i hur projekt leds och organiseras inom industrin. Upplägget med tema föreläsningar fungerade bra, dvs en vanlig föreläsning i pass 1 och en gästföreläsare som pratade om samma tema i pass 2.Information om kursupplägget behöver också fortsatt arbetas med. Även om informationen finns tillgänglig, t ex läsanvisningarna på kurshemsidan, så behövs den pekas på upprepade gånger under föreläsningarna. Även de pedagogiska upplägget behöver förklaras och motiveras ännu tydligare, t ex att man lär sej mer av att aktivt granska andras arbete än att passivt ta emot feedback.Pga årets läsveckoindelning blev introduktionenen till kursprojektet lite väl kort. Till nästa omgång behöver projektbeskrivning och genomgången av den förbättras för att tydligare förmedla syfte och upplägg. Den förbättring vi gjorde med att specifiera en tänkt arbetsgång verkar snarare ha skapat mer förvirring än hjälp studenterna förstå uppgiften.Användandet av Moodle för att hantera kamratgranskningarna av rapporterna var en förbättring i år. Dock kvarstår kommentarerna om ojämn kvalitet på utförda granskningar. Det skulle kanske kunna förbättras genom att inlämnad respons kontrolleras, dock är den största förbättringen att ännu tydligare peka på vinsterna för egen del av att granska andras arbete. Kamratgranskningsupplägget skulle kunna förbättras ytterligare, t ex med lärarledda diskussion frågor under de muntliga återkopplingstillfällena (övning 2 & 3).Slutligen så skulle jag vilja spränga in små övningar på föreläsningarna med praktiska och för teorin relevanta frågeställningar. Detta skulle kunna stimulera till reflektion och stödja aktivt lärande av föreläsningsinnehållet.Programledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering da - Användbarhet och design": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "15/16",
        "registered": "71",
        "percentPassed": "97%",
        "teachingScore": "-4",
        "goalClearnessScore": "-0",
        "assessmentScore": "+48",
        "workloadScore": "-19",
        "importanceScore": "+68",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerKursen anges som väldigt angelägen för utbildningen, specifikt projektens innehåll. Dock riktas en hel del kritik med avseende på kursens kvalité och arbetsbelastning. Kursen behöver till framtida kursomgångar ändra om hur förväntningar på studenterna kommuniceras ut. Beskrivningar, quizzer och handledningar behöver förfinas.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling. Dock kan frågorna i quizen ses över.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN41",
        "name": "Avancerad webbsäkerhet",
        "points": "7.5",
        "year": "15/16",
        "registered": "58",
        "percentPassed": "97%",
        "teachingScore": "+45",
        "goalClearnessScore": "+58",
        "assessmentScore": "+59",
        "workloadScore": "-8",
        "importanceScore": "+98",
        "satisfactionScore": "+79",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererStudenterna har liknande åsikter om kursen som tidigare. Den verkar fungera bra och den känns mycket angelägen för deras utbildning. Den egentligen enda förändringen som gjordes jämfört med tidigare var att de sista två föreläsningarna plockades bort. Dessa föreläsningar upplevde jag själv inte som särskilt bra tidigare så jag ville testa om det blev skillnad om jag tog bort dem. Resultatmässigt på inlämningsuppgifterna märkte jag ingen större skillnad, men några påpekade på utvärderingen att de gärna hade haft föreläsningar på sista delen också. Jag har inte riktigt bestämt hur jag ska göra nästa år med detta, men jag har några olika alternativ som diskuteras med övriga lärare på kursen.Programledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling. Arbetsbelastningen behöver dock beaktas.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN10",
        "name": "Konfigurationshantering",
        "points": "7.5",
        "year": "15/16",
        "registered": "68",
        "percentPassed": "97%",
        "teachingScore": "+44",
        "goalClearnessScore": "+29",
        "assessmentScore": "+20",
        "workloadScore": "-6",
        "importanceScore": "+64",
        "satisfactionScore": "+52",
        "comments": "Studierådets kommentarerVäldigt bra lärare och relevant för vår utbildning men kurslitteraturen behöver uppdateras/Förnyas.Kurslärarens kommentererI am very happy to see that once again students find this course very important for their education (and future work) and find the teaching good.Once again students find that the workload is high. I can only say that this must (again) be a subjective feeling. Very little has changed on the course (except a few things to easen the workload) since I made a survey 3-4 years ago. This survey showed that almost no students came anyway near to the 200 hours required for a 7.5 credit course. However, a couple of students commented on the high number of different activities on the course (I see them as supporting different ways of learning). This might be the root of this subjective feeling. So next year I will try to make it more clear and explicit that there are a few \"streams\" of related activities - and not a load of single activities.Many students comment on the course literature and state that parts of it is \"outdated\". I did not see any student calling parts of the course literature (maybe except for the part on PDM) irrelevant - which makes me happy. In fact many students find Feiler's report difficult to read (and outdated being from 1990), but also very central and important for the course for the concepts it introduces. So if \"outdated\" would be an argument, we'd have to rewrite the Bible instead of trying to re-cast its concepts in a modern context. If I find more \"current\" literature that covers the same concepts and principles in a better way, I will include that - otherwise I am happy as it is.The theme for week 3 (The Study) of the course will be reworked for next year. There needs to be a more clear focus on the four work model from Feiler - and I want to include something on a \"modern\" topic that some might meet in their work afterwards: CoDe/DevOps. This means that the two models from Feiler that are hard to read (too many irrelevant details that some students find difficult to filter away) will be integrated in the introduction and overview part - and I will have to re-write Feiler's text about the checkout-checkin and long transaction models. This leaves space in the in-depth part for adding a substantial paper about CoDe/DevOps - where it should be possible to find a \"modern\" reference.From my own evalution questionnaire, it results that there are some problems with the workshop exercises. Mostly people feel that the metaphor exercises take up too much time. It has never been my intention and I also say that at the beginning of each exercise session. I will probably have to write it in the exercises too and make it absolutely clear that the metaphor part is \"time-boxed\". There has also been some requests for more \"use cases and real-life examples\". I have added such things over the years, but with a rather \"patchy\" result. I plan to go through all eercise sessions to streamline them and also plan to do some shop-lifting from relevant discussions from various SCM-related groups on LinkedIn.A surprising result from my own evaluation questionnaire was that this year the students appreciated the video lectures much more than the following discussion sessions - last year it was the opposite. Since nothing has changed in the setup, the results was a little puzzling. At the meeting with the student representatives this was discussed and it was noted by one of the representatives that the discussion questions (that are posed by the students) were not always that easy to have good discussions about. So it was suggested to provide better/more \"guidance\" for those groups who had to come up with the discussion questions in order to ensure more \"discussable\" questions. That sounds like a good idea.Programledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling. I dialogen med studenterna behöver strukturen på kursen vara tydlig (paper + review)CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ks - Kommunikationssystem": [
      {
        "code": "ETTN15",
        "name": "Moderna trådlösa system - LTE och dess efterföljare",
        "points": "7.5",
        "year": "15/16",
        "registered": "28",
        "percentPassed": "68%",
        "teachingScore": "+42",
        "goalClearnessScore": "+51",
        "assessmentScore": "+36",
        "workloadScore": "-9",
        "importanceScore": "+65",
        "satisfactionScore": "+65",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "15/16",
        "registered": "118",
        "percentPassed": "83%",
        "teachingScore": "-2",
        "goalClearnessScore": "+20",
        "assessmentScore": "+38",
        "workloadScore": "+29",
        "importanceScore": "+61",
        "satisfactionScore": "+32",
        "comments": "KommentarerStudierådets kommentarerKursen har fått bra kommentarer både gällande struktur och innehåll och den anses av många vara intressant, användbar och angelägen för fortsatta studier. Föreläsaren ansågs kunnig i ämnet men att föreläsningarna i viss mån behöver bli tydligare och mer beskrivande för att ge en djupare förståelse i ämnet, föreläsarens intresse för ämnet var något som uppskattades mycket av studenterna. Både laborationerna, övningarna och de utdelade extrauppgifterna har varit mycket uppskattade av studenterna men flera ansåg att vissa laborationshandledare och övningsledare behövde bli mer insatta både språkligt och gällande kursinnehållet. Kursansvarig har mottagit kommentarer om att till nästa kursomgång se över framförallt laboration 3 då många studenter uppgav att det var för mycket arbete som skulle genomföras under laborationstiden. Huruvida laborationen förändras eller om en större del av laborationen förväntas förberedas i förtid kommer att ses över. Även facit till utdelade gamla tentor kommer att ses över då dessa anses bristfälliga av många studenter.Kurslärarens kommentererKursen läses av många olika program och studenternas förkunskaper är varierande. Ett försök till lösning på detta problem i år är extra-föreläsningar på specifika moment. Detta har uppskattats och kommer att utvecklas för att möta alla studenter på rätt nivå. Övningsuppgifterna var i år uppdelade i svårighetsgrad och extra övningar på olika nivåer hade lagts till. Datorövning 3 var ny och kommer att putsas till nästa år, då tiden för att genomföra den var något kort. Förberedelseuppgifterna till datorövningarna kommer att utökas så att tiden för att genomföra övningen på plats räcker till. Arbete pågår med att utöka formelsamlingen till att också omfatta grundläggande formler.Programledarens kommentarerKursen har i stort sett fungerat bra. Dock har det funnits problem med en övningsledare som haft svårt att förklara på engelska. Laboration 3 upplevdes också som svår och det framkom önskemål om att flytta något moment till laboration 2.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETTN01",
        "name": "Digital kommunikation, fortsättningskurs",
        "points": "7.5",
        "year": "15/16",
        "registered": "41",
        "percentPassed": "61%",
        "teachingScore": "+16",
        "goalClearnessScore": "+11",
        "assessmentScore": "+22",
        "workloadScore": "-7",
        "importanceScore": "+32",
        "satisfactionScore": "+19",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDIN01",
        "name": "Kryptoteknik",
        "points": "7.5",
        "year": "15/16",
        "registered": "66",
        "percentPassed": "58%",
        "teachingScore": "+17",
        "goalClearnessScore": "+11",
        "assessmentScore": "+52",
        "workloadScore": "-9",
        "importanceScore": "+46",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerÖverlag uppskattad kurs. Dock var omdömena sämre än tidigare år. Även resultaten på tentan var mycket sämre än tidigare.Generellt tyckte studenterna att tentan var tung. Många tidskrävande uppgifter.En del hade uppskattat om projekten gav högskolepoäng med tanke på hur mycket tid de tog. Fler övningstillfällen önskades och gärna en tentamensgenomgång i slutet av kursen.Fler exempel i slidesen hade uppskattats. Kursmaterialet behöver uppdateras bättre i samband med det nya kursupplägget.Kurslärarens kommentererKursen har gått bra och studenterna ser den som mycket relevant för sin utbildning. Det påpekas att det kanske är dags att uppdatera kursmaterialet, vilket ska ske.Även ett par extra övningstillfällen efterfrågas, då vi detta år inbjöd till projektfrågor på övningar.Programledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling. Studenternas kommentarer om det utdelade materialet och samordning mellan lärare och övningsledare behöver dock beaktas.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN10",
        "name": "Algebraiska strukturer",
        "points": "7.5",
        "year": "15/16",
        "registered": "15",
        "percentPassed": "20%",
        "comments": ""
      },
      {
        "code": "ETSN01",
        "name": "Avancerad telekommunikation",
        "points": "7.5",
        "year": "15/16",
        "registered": "35",
        "percentPassed": "63%",
        "teachingScore": "+12",
        "goalClearnessScore": "-2",
        "assessmentScore": "-19",
        "workloadScore": "-11",
        "importanceScore": "+17",
        "satisfactionScore": "+4",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe course evaluation this year was much improved from last year, which is encouraging. It seems the changes to the course were appreciated by students. In particular, discussions with students indicated that they had a much clearer idea of what was required of them on the exam compared with the exam format used in previous years.However, there is still plenty of room for improvement. Based on both the CEQ responses as well as discussions with students, there were a number of issues in the course that I will work to address for next year. The course received a low score for \"appropriate assessment\" and there seems to be a perception among students that too much of the assessment depends on memorisation rather than demonstrating understanding. It is difficult to see where this perception arises, since fact-based questions made up only a small part of the assessment (30% of the written exam, and none of the project work at all). However, one possible contributing factor to this issue is that many students lack the assumed knowledge when they come into the course. This likely makes it very difficult for them to relate what they learn in the course to their previous studies, perhaps leading to the course material being perceived as only a collection of facts. Next year, the course project will be changed to be a group-based system design task along with some activities early in the course aimed at raising students' prior knowledge level. In addition, I intend to revise and improve the tutorial questions, including adding more questions that integrate different parts of the course.Another issue raised by students was that they did not get much out of the computer-based simulation labs. Although they were able to complete the lab tasks, they felt they did not really acquire an understanding of the simulator or how it works, but rather just followed the lab instructions by rote. We have trialled various permutations of networking simulation and none of them have been particularly successful. The students do not have the necessary programming background to make their own simulations, and there is not enough time in the course to thoroughly learn a simulation package such as we have been using. For these reasons, the computer labs will be removed from the course next year. This time will instead be used for the new system design project. The new project will also address some general competencies that are currently not present in the course. It will involve groupwork, a written report, and an oral presentation.Finally, students struggled with the course structure. Since it is a systems course, it consists of examining different topics and the relationships between them, rather than following a linear structure in which each topic builds on the previous one. Next year I will create an explicit concept map of the course showing how the different modules relate to each other and to the over-arching course goals of system evaluation and system design. This will be referred to throughout the course so that students have a better understanding of where we are up to and what has been covered so far. I will also combine the queueing thoery and congestion control modules into one traffic management module, to make it more clear how queueing thoery concepts are used in modelling and implementing congestion control mechanisms in routers and networks.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN30",
        "name": "Internet inuti",
        "points": "7.5",
        "year": "15/16",
        "registered": "32",
        "percentPassed": "100%",
        "teachingScore": "+40",
        "goalClearnessScore": "+59",
        "assessmentScore": "+81",
        "workloadScore": "+21",
        "importanceScore": "+96",
        "satisfactionScore": "+92",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererEfter det att jag läst kursvärderingssvaren bekräftar dessa vad jag förväntademig av studenterna. Stor frihet under eget ansvar präglar kursen. Varje kursdeltagare rekommenderas att tillsammans med sin gruppkompis välja ett tidsupplägg av hur kurs-problemen/-laborationerna skall lösas. Alla väljer sin lösning och bygger vidare på denna. Jag försvarar det egna initiativet. Det finns många sätt att lösa problemen. Viktigt är att alla i en grupp kan redogöra för den egna lösningen. Samtidigt som detaljerna kan vara viktiga måste fokus också finnas på de övergipande funktionerna och deras prestanda. Här är jag mycket nöjd med utfallet av examinationen. Från dag ett visst studenterna vad som förväntades av dem och de levererade rätt. Jag är nöjd med utfallet.Programledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN10",
        "name": "Kanalmodellering för trådlös kommunikation",
        "points": "7.5",
        "year": "15/16",
        "registered": "22",
        "percentPassed": "64%",
        "comments": ""
      },
      {
        "code": "EITN45",
        "name": "Informationsteori",
        "points": "7.5",
        "year": "15/16",
        "registered": "42",
        "percentPassed": "81%",
        "teachingScore": "+41",
        "goalClearnessScore": "+52",
        "assessmentScore": "+49",
        "workloadScore": "+32",
        "importanceScore": "+50",
        "satisfactionScore": "+64",
        "comments": "Studierådets kommentarerStudenterna är väldigt nöjda med kursen, särskillt tentan som de kände var utmanande på ett rättvist sätt, och då det var en hemtentamen så kunde man fördjupa sin förståelse under själva tentamen. Föreläsaren får även ett plus i kanten av flertalet studenter.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomför kurs. Programledningen ser inget behov av större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN15",
        "name": "Radiosystem",
        "points": "7.5",
        "year": "15/16",
        "registered": "24",
        "percentPassed": "50%",
        "comments": ""
      },
      {
        "code": "EITN10",
        "name": "Multipelantennsystem",
        "points": "7.5",
        "year": "15/16",
        "registered": "25",
        "percentPassed": "68%",
        "comments": ""
      },
      {
        "code": "EITN21",
        "name": "Projekt i trådlös kommunikation",
        "points": "7.5",
        "year": "15/16",
        "registered": "29",
        "percentPassed": "69%",
        "teachingScore": "+57",
        "goalClearnessScore": "+34",
        "assessmentScore": "+64",
        "workloadScore": "-5",
        "importanceScore": "+86",
        "satisfactionScore": "+55",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering sec - Säkerhet": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "15/16",
        "registered": "71",
        "percentPassed": "97%",
        "teachingScore": "-4",
        "goalClearnessScore": "-0",
        "assessmentScore": "+48",
        "workloadScore": "-19",
        "importanceScore": "+68",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerKursen anges som väldigt angelägen för utbildningen, specifikt projektens innehåll. Dock riktas en hel del kritik med avseende på kursens kvalité och arbetsbelastning. Kursen behöver till framtida kursomgångar ändra om hur förväntningar på studenterna kommuniceras ut. Beskrivningar, quizzer och handledningar behöver förfinas.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling. Dock kan frågorna i quizen ses över.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN41",
        "name": "Avancerad webbsäkerhet",
        "points": "7.5",
        "year": "15/16",
        "registered": "58",
        "percentPassed": "97%",
        "teachingScore": "+45",
        "goalClearnessScore": "+58",
        "assessmentScore": "+59",
        "workloadScore": "-8",
        "importanceScore": "+98",
        "satisfactionScore": "+79",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererStudenterna har liknande åsikter om kursen som tidigare. Den verkar fungera bra och den känns mycket angelägen för deras utbildning. Den egentligen enda förändringen som gjordes jämfört med tidigare var att de sista två föreläsningarna plockades bort. Dessa föreläsningar upplevde jag själv inte som särskilt bra tidigare så jag ville testa om det blev skillnad om jag tog bort dem. Resultatmässigt på inlämningsuppgifterna märkte jag ingen större skillnad, men några påpekade på utvärderingen att de gärna hade haft föreläsningar på sista delen också. Jag har inte riktigt bestämt hur jag ska göra nästa år med detta, men jag har några olika alternativ som diskuteras med övriga lärare på kursen.Programledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling. Arbetsbelastningen behöver dock beaktas.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF20",
        "name": "Datorarkitektur",
        "points": "7.5",
        "year": "15/16",
        "registered": "45",
        "percentPassed": "76%",
        "teachingScore": "+17",
        "goalClearnessScore": "+20",
        "assessmentScore": "+21",
        "workloadScore": "+25",
        "importanceScore": "+63",
        "satisfactionScore": "+54",
        "comments": "Studierådets kommentarerIntressant ämne med passionerad föreläsare. Har med exempel från verkligheten. Labbarna var dock inte så bra och kan förbättras.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDIN01",
        "name": "Kryptoteknik",
        "points": "7.5",
        "year": "15/16",
        "registered": "66",
        "percentPassed": "58%",
        "teachingScore": "+17",
        "goalClearnessScore": "+11",
        "assessmentScore": "+52",
        "workloadScore": "-9",
        "importanceScore": "+46",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerÖverlag uppskattad kurs. Dock var omdömena sämre än tidigare år. Även resultaten på tentan var mycket sämre än tidigare.Generellt tyckte studenterna att tentan var tung. Många tidskrävande uppgifter.En del hade uppskattat om projekten gav högskolepoäng med tanke på hur mycket tid de tog. Fler övningstillfällen önskades och gärna en tentamensgenomgång i slutet av kursen.Fler exempel i slidesen hade uppskattats. Kursmaterialet behöver uppdateras bättre i samband med det nya kursupplägget.Kurslärarens kommentererKursen har gått bra och studenterna ser den som mycket relevant för sin utbildning. Det påpekas att det kanske är dags att uppdatera kursmaterialet, vilket ska ske.Även ett par extra övningstillfällen efterfrågas, då vi detta år inbjöd till projektfrågor på övningar.Programledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling. Studenternas kommentarer om det utdelade materialet och samordning mellan lärare och övningsledare behöver dock beaktas.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN10",
        "name": "Algebraiska strukturer",
        "points": "7.5",
        "year": "15/16",
        "registered": "15",
        "percentPassed": "20%",
        "comments": ""
      },
      {
        "code": "EITN30",
        "name": "Internet inuti",
        "points": "7.5",
        "year": "15/16",
        "registered": "32",
        "percentPassed": "100%",
        "teachingScore": "+40",
        "goalClearnessScore": "+59",
        "assessmentScore": "+81",
        "workloadScore": "+21",
        "importanceScore": "+96",
        "satisfactionScore": "+92",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererEfter det att jag läst kursvärderingssvaren bekräftar dessa vad jag förväntademig av studenterna. Stor frihet under eget ansvar präglar kursen. Varje kursdeltagare rekommenderas att tillsammans med sin gruppkompis välja ett tidsupplägg av hur kurs-problemen/-laborationerna skall lösas. Alla väljer sin lösning och bygger vidare på denna. Jag försvarar det egna initiativet. Det finns många sätt att lösa problemen. Viktigt är att alla i en grupp kan redogöra för den egna lösningen. Samtidigt som detaljerna kan vara viktiga måste fokus också finnas på de övergipande funktionerna och deras prestanda. Här är jag mycket nöjd med utfallet av examinationen. Från dag ett visst studenterna vad som förväntades av dem och de levererade rätt. Jag är nöjd med utfallet.Programledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN45",
        "name": "Informationsteori",
        "points": "7.5",
        "year": "15/16",
        "registered": "42",
        "percentPassed": "81%",
        "teachingScore": "+41",
        "goalClearnessScore": "+52",
        "assessmentScore": "+49",
        "workloadScore": "+32",
        "importanceScore": "+50",
        "satisfactionScore": "+64",
        "comments": "Studierådets kommentarerStudenterna är väldigt nöjda med kursen, särskillt tentan som de kände var utmanande på ett rättvist sätt, och då det var en hemtentamen så kunde man fördjupa sin förståelse under själva tentamen. Föreläsaren får även ett plus i kanten av flertalet studenter.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomför kurs. Programledningen ser inget behov av större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF35",
        "name": "Operativsystem",
        "points": "7.5",
        "year": "15/16",
        "registered": "35",
        "percentPassed": "43%",
        "teachingScore": "+3",
        "goalClearnessScore": "+3",
        "assessmentScore": "+35",
        "workloadScore": "+9",
        "importanceScore": "+58",
        "satisfactionScore": "+33",
        "comments": "Studierådets kommentarerLabbarna var bra men det behövdes mer hjälp med just C programmerandet, handledningarna var även svåra att förstå. I kursplanen nämns att man ska kunna jobba med Android men detta saknades i kursens innehåll.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som är relevant för utbildningen. Inför nästa år bör kursplanen ses över. Det är två saker som behöver övervägas: ett, Android nämns i kursplanen men kursinnehållet är mer fokuserat på linux. två, under förväntade förkunskapskrav kan nämnas att under labbarna används programspråket c.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ssr - System, signaler och reglering": [
      {
        "code": "FRTN10",
        "name": "Flervariabel reglering",
        "points": "7.5",
        "year": "15/16",
        "registered": "71",
        "percentPassed": "77%",
        "teachingScore": "+48",
        "goalClearnessScore": "+26",
        "assessmentScore": "+65",
        "workloadScore": "+21",
        "importanceScore": "+84",
        "satisfactionScore": "+73",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN55",
        "name": "Signalseparation - oberoende komponenter",
        "points": "7.5",
        "year": "15/16",
        "registered": "18",
        "percentPassed": "72%",
        "comments": ""
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "15/16",
        "registered": "118",
        "percentPassed": "83%",
        "teachingScore": "-2",
        "goalClearnessScore": "+20",
        "assessmentScore": "+38",
        "workloadScore": "+29",
        "importanceScore": "+61",
        "satisfactionScore": "+32",
        "comments": "KommentarerStudierådets kommentarerKursen har fått bra kommentarer både gällande struktur och innehåll och den anses av många vara intressant, användbar och angelägen för fortsatta studier. Föreläsaren ansågs kunnig i ämnet men att föreläsningarna i viss mån behöver bli tydligare och mer beskrivande för att ge en djupare förståelse i ämnet, föreläsarens intresse för ämnet var något som uppskattades mycket av studenterna. Både laborationerna, övningarna och de utdelade extrauppgifterna har varit mycket uppskattade av studenterna men flera ansåg att vissa laborationshandledare och övningsledare behövde bli mer insatta både språkligt och gällande kursinnehållet. Kursansvarig har mottagit kommentarer om att till nästa kursomgång se över framförallt laboration 3 då många studenter uppgav att det var för mycket arbete som skulle genomföras under laborationstiden. Huruvida laborationen förändras eller om en större del av laborationen förväntas förberedas i förtid kommer att ses över. Även facit till utdelade gamla tentor kommer att ses över då dessa anses bristfälliga av många studenter.Kurslärarens kommentererKursen läses av många olika program och studenternas förkunskaper är varierande. Ett försök till lösning på detta problem i år är extra-föreläsningar på specifika moment. Detta har uppskattats och kommer att utvecklas för att möta alla studenter på rätt nivå. Övningsuppgifterna var i år uppdelade i svårighetsgrad och extra övningar på olika nivåer hade lagts till. Datorövning 3 var ny och kommer att putsas till nästa år, då tiden för att genomföra den var något kort. Förberedelseuppgifterna till datorövningarna kommer att utökas så att tiden för att genomföra övningen på plats räcker till. Arbete pågår med att utöka formelsamlingen till att också omfatta grundläggande formler.Programledarens kommentarerKursen har i stort sett fungerat bra. Dock har det funnits problem med en övningsledare som haft svårt att förklara på engelska. Laboration 3 upplevdes också som svår och det framkom önskemål om att flytta något moment till laboration 2.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN60",
        "name": "Optimal och adaptiv signalbehandling",
        "points": "7.5",
        "year": "15/16",
        "registered": "26",
        "percentPassed": "73%",
        "teachingScore": "-7",
        "goalClearnessScore": "+5",
        "assessmentScore": "+55",
        "workloadScore": "+28",
        "importanceScore": "+55",
        "satisfactionScore": "+9",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN80",
        "name": "Algoritmer i signalprocessorer - projektkurs",
        "points": "7.5",
        "year": "15/16",
        "registered": "10",
        "percentPassed": "80%",
        "comments": ""
      },
      {
        "code": "FMAF10",
        "name": "Tillämpad matematik - Linjära system",
        "points": "5.0",
        "year": "15/16",
        "registered": "67",
        "percentPassed": "72%",
        "teachingScore": "+33",
        "goalClearnessScore": "+62",
        "assessmentScore": "+56",
        "workloadScore": "+45",
        "importanceScore": "+58",
        "satisfactionScore": "+70",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTN15",
        "name": "Prediktiv reglering",
        "points": "7.5",
        "year": "15/16",
        "registered": "32",
        "percentPassed": "75%",
        "teachingScore": "+1",
        "goalClearnessScore": "-27",
        "assessmentScore": "+52",
        "workloadScore": "+6",
        "importanceScore": "+83",
        "satisfactionScore": "+6",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "BMEN01",
        "name": "Medicinsk signalbehandling",
        "points": "7.5",
        "year": "15/16",
        "registered": "43",
        "percentPassed": "79%",
        "teachingScore": "+25",
        "goalClearnessScore": "-9",
        "assessmentScore": "+29",
        "workloadScore": "-10",
        "importanceScore": "+62",
        "satisfactionScore": "+31",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIF10",
        "name": "Signalbehandling - design och implementering",
        "points": "7.5",
        "year": "15/16",
        "registered": "41",
        "percentPassed": "61%",
        "teachingScore": "+30",
        "goalClearnessScore": "+23",
        "assessmentScore": "+47",
        "workloadScore": "+38",
        "importanceScore": "+50",
        "satisfactionScore": "+25",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTN01",
        "name": "Realtidssystem",
        "points": "10.0",
        "year": "15/16",
        "registered": "63",
        "percentPassed": "83%",
        "teachingScore": "+53",
        "goalClearnessScore": "+35",
        "assessmentScore": "+69",
        "workloadScore": "+28",
        "importanceScore": "+69",
        "satisfactionScore": "+64",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTA10",
        "name": "Introduktion till Kinas samhällsliv, kultur och språk",
        "points": "3.0",
        "year": "15/16",
        "registered": "25",
        "percentPassed": "76%",
        "teachingScore": "+4",
        "goalClearnessScore": "-28",
        "assessmentScore": "+8",
        "workloadScore": "+47",
        "importanceScore": "+20",
        "satisfactionScore": "+10",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTA35",
        "name": "Introduktionskurs i kinesiska för civilingenjörer",
        "points": "15.0",
        "year": "15/16",
        "registered": "18",
        "percentPassed": "94%",
        "teachingScore": "+33",
        "goalClearnessScore": "+25",
        "assessmentScore": "+38",
        "workloadScore": "+38",
        "importanceScore": "+50",
        "satisfactionScore": "+50",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTF60",
        "name": "Introduktionskurs i kinesiska för civilingenjörer, del 2",
        "points": "15.0",
        "year": "15/16",
        "registered": "13",
        "percentPassed": "100%",
        "teachingScore": "-46",
        "goalClearnessScore": "-42",
        "assessmentScore": "+13",
        "workloadScore": "+25",
        "importanceScore": "+67",
        "satisfactionScore": "-33",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA25",
        "name": "C-programmering",
        "points": "3.0",
        "year": "15/16",
        "registered": "101",
        "percentPassed": "51%",
        "teachingScore": "+10",
        "goalClearnessScore": "+20",
        "assessmentScore": "+38",
        "workloadScore": "+7",
        "importanceScore": "+79",
        "satisfactionScore": "+36",
        "comments": "Studierådets kommentarerStudenternas uppfattade nöjdhet av kursen i förhållande till den upplevda relevansen av kursen är intressant att ta i beaktande vid eventuella framtida revidering av kursen. Kursens innehåll är intressant och lärorikt. Föreläsaren uppfattas som väldigt insatt och motiverande i sina undervisningsmetoder av de nöjda studenterna, medan de missnöjda studenterna påpekar att detaljrikedomen på föreläsningarna gör innehållet svårt att tillgodogöra sig. Förväntningar på studenternas prestationer (i labbar och tentamina) behöver också förtydligas. En analys av kursens fritextsvar ger klara och tydliga indikationer på att kursansvarig bör se över/beakta/tänka över följande:-- Antalet högskolepoäng på kursen-- Nivån på kursen (G1, G2 eller A)-- Förkunskapskrav (Bör utökas för att innefatta (exempelivs) fortsättningskurs i programmering, datorteknik/datorarkitektur eller motsvarande)Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. I år infördes automatiks rättning av inlämningsuppgifterna. Detta har fungerat mycket bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIF05",
        "name": "Grundläggande radioteknik",
        "points": "7.5",
        "year": "15/16",
        "registered": "38",
        "percentPassed": "87%",
        "teachingScore": "+42",
        "goalClearnessScore": "+35",
        "assessmentScore": "+23",
        "workloadScore": "+25",
        "importanceScore": "+50",
        "satisfactionScore": "+46",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN65",
        "name": "Kompilatorer",
        "points": "7.5",
        "year": "15/16",
        "registered": "79",
        "percentPassed": "94%",
        "teachingScore": "+47",
        "goalClearnessScore": "+52",
        "assessmentScore": "+63",
        "workloadScore": "-3",
        "importanceScore": "+85",
        "satisfactionScore": "+76",
        "comments": "Studierådets kommentarerKursen har i regel varit väldigt omtyckt av studenterna. Ämnet är intressant och kursens utförande är systematiskt, med en naturlig progression i tillgodogörande av färdigheter.Arbetsbelastningen har periodvis uppfattats som hög. Utslaget över hela kursens gång har dock arbetsbelastningen uppfattats som rimligt. Lab 2 och lab 4 (utav 6) har uppfattats som för tunga och tidskrävande. De teoretiska koncept som introducerats inför labbarna (2 och 4) har varit svåra och det har saknats tillräckligt med praktiska/konkreta exempel på hur en student ska lösa vissa uppgifter.Föreläsaren och labbhandledarna har uppfattats som kompetenta och hjälpsamma, även om det i vissa varit för lågt tempo på föreläsningar samt varierande kvalitet och kvantitet på feedbacken till studenterna under laborationerna.Under utvärderingsmötet (HT15) föreslogs följande ändringar till nästa år (16/17):-- labbhandledningarna ska skrivas om för att i större utsträckning skapa incitament för studenterna att påbörja laborationerna (och eventuellt färdigställa stora delar) i god tid innan laborationstillfällena.-- Moodle-quizen ska utökas med mer frågor som berör aspektorienterad programmering (inhertided and synthesized attributes och användandet av equations), något som varit en hög tröskel att ta sig över för en del studenter.-- Mer fokus på att kommunicera ut lämplig studieteknik till studenterna.Kurslärarens kommentererStudenterna är mycket nöjda med kursen och tycker att den är intressant och angelägen för deras utbildning. Speciellt uppskattar man upplägget med labbarna som ett kontinuerligt projekt som är synkroniserat med föreläsningarna.Många tycker att arbetsbelastningen har varit högre än i många andra kurser, men de flesta ser detta som positivt. När man analyserar antalet timmar studenterna lägger ner så är det helt klart inom den planerade mängden (200 timmar) även för de studenter som lägger ner mer tid på labbarna än normalstudenten. Man kan också notera att kursen haft en väldigt hög genomströmning: Av 78 som påbörjade kursen har 76 fullföljt alla labbarna, och av 76 tenterande klarade 71 tentan vid första tentatillfället. Jag tror att det faktum att man tvingas arbeta mycket med de omfattande labbarna gör det lättare att plugga till tentan så att man i högre utsträckning klarar den.Uppgifterna (labbarna) varierar mycket i svårighet vilket gör arbetsbelastningen under kursens gång ojämn. Dock inte mer än för andra kurser där man har inlämningsuppgifter. Till denna kursomgång flyttade jag vissa moment från de tyngsta labbarna till de lättare, och jag angav förväntad tidsåtgång för de olika labbarna. Detta har haft en mycket positiv effekt och gjort att studenterna lättare kan planera eftersom de vet när de tunga momenten i kursen kommer. Det är svårt att flytta fler moment eftersom man behöver föreläsa om dem innan labben ges.Till denna kursomgång har jag också utvecklat kontrollfrågor för ett antal av föreläsningarna, och lagt in i systemet Moodle. Dessa har utnyttjats av en stor del av studenterna, och har uppskattats av dem som utnyttjat dem. Dock har jag inte hunnit med att göra frågor till alla föreläsningar, men kommer att fortsätta med detta nästa kursomgång.Under kursen har vi utnyttjat studentforumet Piazza, vilket fungerat mycket bra, speciellt för detaljfrågor angående labbar och extentor. Vi kommer att fortsätta med det nästa kursomgång.På CEQ-mötet diskuterade vi dessutom ett antal detaljfrågor som kommit upp i arbetsrapporten, och som jag kommer att åtgärda till nästa kursomgång, speciellt angående fler exempel och övningar på attribut.Programledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF15",
        "name": "Markovprocesser",
        "points": "7.5",
        "year": "15/16",
        "registered": "39",
        "percentPassed": "77%",
        "teachingScore": "+18",
        "goalClearnessScore": "+36",
        "assessmentScore": "+61",
        "workloadScore": "+70",
        "importanceScore": "+50",
        "satisfactionScore": "+57",
        "comments": "Studierådets kommentarerStudenterna har uppskattat kursen i sin helhet vad gäller ämnet, kursinnehållet och strukturen med föreläsningar, övningar och laborationer. Kursen har fått flera positiva kommentarer gällande föreläsarens struktur, pedagogik och föreläsningsinnehåll. Kurslitteraturen har fått positiv respons och både övningar och laborationer har upplevts intressanta och relevanta för kursen. Dock är övningsledarna något som många anser behöver ses över då de upplevdes sakna kunskaper, både språkligt och vad gäller kursinnehållet, för att kunna hjälpa till i den utsträckning som studenterna önskar.Kurslärarens kommentererIt is very positive that an absolute majority of students who haveanswered the CEQ found the course important for their education andwere generally satisfied with the course. However, there have beensome comments regarding teaching assistants for exercises which havebeen highlighted in \"free text answers\". I would like to assure thestudents that we take these comments very seriously. I have discussedthe issues with the head of department and we will certainly takethese comments into consideration in our planning for next year.Programledarens kommentarerKursanasvarig har inte kallat till något möte.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSN05",
        "name": "Programvaruutveckling för stora system",
        "points": "7.5",
        "year": "15/16",
        "registered": "58",
        "percentPassed": "100%",
        "teachingScore": "-36",
        "goalClearnessScore": "-23",
        "assessmentScore": "+53",
        "workloadScore": "+57",
        "importanceScore": "+57",
        "satisfactionScore": "-10",
        "comments": "Studierådets kommentarerTrots att kursen uppfattas som väldigt angelägen, är det många studenter som inte är nöjda med kursen. Från statistiken och frihetsvaren i arbetsrapporten verkar det framstå som om att kommunikationen mellan student och lärare brister. Förväntningar på studenterna m.a.p prestation är undermålig. Konceptet av att arbeta i stora grupper uppskattas väldigt mycket av studenterna.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerFlera ändringar har gjorts inför årets kursomgång, uppgiften var ny och det var en ny kurslärare. Detta har lett till en del missförstånd och brister i kommunikationen. Inför nästa år bär uppgiftesbeskrivningen ses över.  Installation av nödvändiga verktyg bör även göras i god tid på skolans datorer. Jag är övertygad om att erfarenheter från året kommer att göra kursen mycket bättre nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN20",
        "name": "Språkteknologi",
        "points": "7.5",
        "year": "15/16",
        "registered": "69",
        "percentPassed": "93%",
        "teachingScore": "+17",
        "goalClearnessScore": "+24",
        "assessmentScore": "+51",
        "workloadScore": "+49",
        "importanceScore": "+33",
        "satisfactionScore": "+28",
        "comments": "Studierådets kommentarerKursen har ett genomsnittligt högt anseende men sett över de individuella svaren råder det en stor spridning rörande hur kursen har uppfattats. Detta indikerar på att direktiv, information och förväntingar inte kommunicerats ut på ett ändamålsenligt sätt. Arbetsbelastningen och svårigheten är i regel till studenternas behag men en kan fråga sig om det motsvarar en avancerad 7.5hp kurs. Ämnet uppfattas som intressant. Föreläsaren anses vara engagerad och undervisningsmetodiken är i många fall bra.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "GEMA25",
        "name": "Tyska för tekniker",
        "points": "7.5",
        "year": "15/16",
        "registered": "19",
        "percentPassed": "84%",
        "teachingScore": "+50",
        "goalClearnessScore": "+54",
        "assessmentScore": "+36",
        "workloadScore": "+69",
        "importanceScore": "+61",
        "satisfactionScore": "+72",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "GEMA70",
        "name": "Japanska för tekniker",
        "points": "15.0",
        "year": "15/16",
        "registered": "9",
        "percentPassed": "78%",
        "comments": ""
      },
      {
        "code": "EDAN35",
        "name": "Högpresterande datorgrafik",
        "points": "7.5",
        "year": "15/16",
        "registered": "37",
        "percentPassed": "84%",
        "teachingScore": "+47",
        "goalClearnessScore": "+22",
        "assessmentScore": "+40",
        "workloadScore": "0",
        "importanceScore": "+63",
        "satisfactionScore": "+70",
        "comments": "Studierådets kommentarerBra kurs med bra moment. Studenterna gillade projektet.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSF10",
        "name": "Internetprotokoll",
        "points": "7.5",
        "year": "15/16",
        "registered": "22",
        "percentPassed": "82%",
        "teachingScore": "-11",
        "goalClearnessScore": "-4",
        "assessmentScore": "+52",
        "workloadScore": "+11",
        "importanceScore": "+50",
        "satisfactionScore": "+25",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FAFF20",
        "name": "Multispektral avbildning",
        "points": "7.5",
        "year": "15/16",
        "registered": "13",
        "percentPassed": "69%",
        "comments": ""
      },
      {
        "code": "FMSN20",
        "name": "Spatial statistik med bildanalys",
        "points": "7.5",
        "year": "15/16",
        "registered": "30",
        "percentPassed": "90%",
        "teachingScore": "+44",
        "goalClearnessScore": "+16",
        "assessmentScore": "+75",
        "workloadScore": "-12",
        "importanceScore": "+50",
        "satisfactionScore": "+50",
        "comments": "KommentarerStudierådets kommentarerKursen har fått mycket bra kritik av studenterna men arbetsbelastningen anses vara något hög. Kursansvarig har fått många positiva kommentarer och anses vara kunnig och engagerad samt väldigt hjälpsam under kursens gång. Dock ansåg flera att mer teori och bakgrund på föreläsningarna hade underlättat för förståelsen av kursinnehållet. Datorövningarna ansåg behövas bli fler och/eller ha fler handledare vid tillfällena. Inlämningsuppgifterna och kursinnehållet anses intressant och användbart.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursansvarig har inte kallat till CEQ-möte.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF40",
        "name": "Digitala och analoga projekt",
        "points": "7.5",
        "year": "15/16",
        "registered": "8",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "ETIA10",
        "name": "Patent och annan immaterialrätt",
        "points": "7.5",
        "year": "15/16",
        "registered": "64",
        "percentPassed": "83%",
        "teachingScore": "+55",
        "goalClearnessScore": "+51",
        "assessmentScore": "+23",
        "workloadScore": "+70",
        "importanceScore": "+63",
        "satisfactionScore": "+73",
        "comments": "Studierådets kommentarerMycket positiva kommentarer på kursen och föreläsaren. Svårighetsgraden på tentan upplevdes som låg.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerDenna för F nya kurs är mycket uppskattad, men det går inte att utläsa av CEQ specifikt vad de fåtaliga F:arna tyckte om den. Innehållet upplevs som mycket intressant och relevant för utbildningen. Tentamen upplevdes som enkel.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSN35",
        "name": "Stationär och icke-stationär spektralanalys",
        "points": "7.5",
        "year": "15/16",
        "registered": "23",
        "percentPassed": "74%",
        "comments": ""
      },
      {
        "code": "GEMA01",
        "name": "Franska för tekniker: språk, kultur och samhällsliv, grundkurs",
        "points": "7.5",
        "year": "15/16",
        "registered": "9",
        "percentPassed": "56%",
        "comments": ""
      },
      {
        "code": "GEMA65",
        "name": "Kinesiska för tekniker",
        "points": "7.5",
        "year": "15/16",
        "registered": "8",
        "percentPassed": "63%",
        "comments": ""
      },
      {
        "code": "GEMA55",
        "name": "Medicin för tekniker",
        "points": "6.0",
        "year": "15/16",
        "registered": "16",
        "percentPassed": "75%",
        "comments": ""
      },
      {
        "code": "EITA05",
        "name": "Teknikhistoria",
        "points": "4.5",
        "year": "15/16",
        "registered": "80",
        "percentPassed": "79%",
        "teachingScore": "-5",
        "goalClearnessScore": "+29",
        "assessmentScore": "+35",
        "workloadScore": "+69",
        "importanceScore": "+5",
        "satisfactionScore": "+38",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN30",
        "name": "Ledarskap, arbetsorganisation och projektledning",
        "points": "7.5",
        "year": "15/16",
        "registered": "37",
        "percentPassed": "92%",
        "teachingScore": "-14",
        "goalClearnessScore": "-9",
        "assessmentScore": "+3",
        "workloadScore": "+40",
        "importanceScore": "+23",
        "satisfactionScore": "-9",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKursen är relevant med hänsyn till innehåll och pedagogiskt upplägg vilket framgått i diskussion med studenter och ur CEQ-rapporten. Däremot upplever studenterna en otydlighet i krav och förväntningar vilket å ena sidan är något förvånande med tanke på väl beskrivna mallar och instruktioner. Å andra sidan rymmer kursen många moment vilket gör kursen komplex. Inför 2017 blir det färre antal moment som istället görs mer djupgående. Detta bör öka tydligheten och samtidigt innebära en fördjupning av ämnet. En till två veckor in i kursen kommer det att göras en enkätbaserad utvärdering bland studenterna avseende tydlighet i kursen baserat på formuleringar ur CEQ-enkäten. Förändringarna kommer prövas i en annan kurs under hösten 2016.Programledarens kommentarerKursen får blandade omdömen (och mycket konstruktiv feedback). Dock är antalet svar är så lågt att det svårt att få en stabil bild.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN20",
        "name": "Bildanalys",
        "points": "7.5",
        "year": "15/16",
        "registered": "93",
        "percentPassed": "86%",
        "teachingScore": "+37",
        "goalClearnessScore": "+30",
        "assessmentScore": "+71",
        "workloadScore": "+21",
        "importanceScore": "+82",
        "satisfactionScore": "+58",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn uppskattad kurs med många nöjda studenter. Man har verkligen uppskattat examinationsupplägget med inlämningar och hemtenta. Den enda kritiken är att föreläsningarna håll olika kvalitet och att man vill ha ännu mer feedback på vad man gjort.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN30",
        "name": "Medicinsk bildanalys",
        "points": "7.5",
        "year": "15/16",
        "registered": "45",
        "percentPassed": "80%",
        "teachingScore": "+14",
        "goalClearnessScore": "-3",
        "assessmentScore": "+73",
        "workloadScore": "-1",
        "importanceScore": "+69",
        "satisfactionScore": "+44",
        "comments": "KommentarerStudierådets kommentarerKursinnehållet har fått positiv kritik från studenterna och många upplever upplägget med inlämningar och muntlig tentamen som en väl vald examinationsform. Just inlämningsuppgifterna anser många vara bra, de anges ha intressanta ämnen som är relevanta även utanför kursens ramar och vara utvecklande och lärorika. Något som behöver förbättras är instruktionerna till dessa då många anger att de varit otydliga och svåra att tolka. Snabbare och mer informativ rättning av inlämningsuppgifterna efterfrågas av nästan alla som fyllt i enkäten. Fler övningsledare och fler övningstillfällen efterfrågas också. Föreläsaren har fått positiv kritik av studenterna.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursansvarig har inte kallat till CEQ-möteCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ]
  },
  "D": {
    "Årskurs 1 (obligatoriska kurser)": [
      {
        "code": "FMAA05",
        "name": "Endimensionell analys",
        "points": "15.0",
        "year": "15/16",
        "registered": "91",
        "percentPassed": "37%",
        "teachingScore": "+22",
        "goalClearnessScore": "+40",
        "assessmentScore": "+42",
        "workloadScore": "-22",
        "importanceScore": "+62",
        "satisfactionScore": "+38",
        "comments": "Studierådets kommentarerStudenterna är glada över att man går igenom gymnasiematten som första kurs. Föreläsaren är entusiatisk och det finns bra videor online. Dock så har föreläsaren ibland svårt för att förstå studenternas frågor och det är stor arbetsbelastning.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FAFA60",
        "name": "Fotonik",
        "points": "5.0",
        "year": "15/16",
        "registered": "99",
        "percentPassed": "54%",
        "teachingScore": "-25",
        "goalClearnessScore": "+7",
        "assessmentScore": "+24",
        "workloadScore": "-5",
        "importanceScore": "-23",
        "satisfactionScore": "-12",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling. Vissa praktiska problem förekoma som beror på att kursen lästes både av D1 och D3 vilket gjorde schemaläggning av labbresurser problematiskt.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA01",
        "name": "Programmeringsteknik - fördjupningskurs",
        "points": "7.5",
        "year": "15/16",
        "registered": "94",
        "percentPassed": "74%",
        "teachingScore": "+29",
        "goalClearnessScore": "+43",
        "assessmentScore": "+57",
        "workloadScore": "+27",
        "importanceScore": "+88",
        "satisfactionScore": "+67",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererDet är glädjande att så många är nöjda med kursen och finner den relevant för sin utbildning.Vissa program har ett lång avstånd i tiden mellan grundkursen och fördjupningskursen. På CEQ-mötet diskuterade vi detta och kom fram till att det vore bra med en repetitionsuppgift i läsvecka 1. Jag planerar att göra en sådan uppgift till kurstillfället VT17.Programledarens kommentarerEn mycket väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA35",
        "name": "Utvärdering av programvarusystem",
        "points": "7.0",
        "year": "15/16",
        "registered": "103",
        "percentPassed": "91%",
        "teachingScore": "+15",
        "goalClearnessScore": "+27",
        "assessmentScore": "+49",
        "workloadScore": "+54",
        "importanceScore": "+40",
        "satisfactionScore": "+25",
        "comments": "Kursen gavs för första gången under 2016. Som kursansvarig tycker jag att att det gick förhållandevis bra. Vi som gick igenom de rapporter som studenterna lämnade in tycker att de höll förhållandevis bra kvalitet och en mycket stor del av studenterna blev godkända på både laborationer och projektuppgift.Även om förhållandevis få studenter svarade på CEQ-enkäten så kan man konstatera att resultatet från denna också är förhållandevis positivt. Baserat på denna kan man konstatera att studenterna anser att kursen fyller en viktig plats i programmet och att de har förbättrat sin förmåga att kommunicera skriftligt, vilket är ett viktigt mål med kursen. Man kan också konstatera att de är överlag förhållandevis nöjda med kursen. Det har dock kommit in en del kommentarer som säger att vi skulle kunna öka kraven en aning på studenterna i kursen. Vi håller med om detta och vi kommer att ta till oss det inför nästa år.Programledarens kommentarerDetta var första gången kursen gavs. Kursen fungerar bra. Nästa kursomgång ska berykta studenternas kommentarer från i år. Bl.a. finns utrymme att utöka skrivarbetet något samt att öka kraven på studenterna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA40",
        "name": "Diskreta strukturer i datavetenskap",
        "points": "5.0",
        "year": "15/16",
        "registered": "107",
        "percentPassed": "42%",
        "teachingScore": "-42",
        "goalClearnessScore": "-64",
        "assessmentScore": "+30",
        "workloadScore": "-28",
        "importanceScore": "+5",
        "satisfactionScore": "-48",
        "comments": "Studierådets kommentarerI utvärderingarna var majoriteten av studenterna missnöjda med kursen, det gavs ett antal olika konkreta skäl. Det känns rimligt att säga att kursen är problematisk och behöver genomgå ett antal förändringar för att bli en bra kurs.Mycket utav dessa förändringar handlar om strukturen och momenten i kursen, till exempelvis brist på enklare övningar.Viktigt att nämna är dock att överlag tyckte utvärderarna att läraren är en bra föreläsare, och att kursen hör hemma på programmet.Kurslärarens kommentererEDAA40 CommentsThe themes that stood out among the things that could be improved upon were the weak link between the programming exercises during the labs and the material in the lectures, and the course book, and here most prominently the absence of solutions to many of its exercises, as well as a desire for more examples for the concepts covered.The course is set up with five exercise sessions/labs. Of these, one was devoted to \"exam prep\" in recognition of the fact that there were no past exams to work with, and students would have had no exposure to \"exam-like\" questions and problems outside of the \"homework\" that consisted of working on problems in the book, many of which did not have model solutions (more on this below). As the course was also intended to use a new programming language for its practical labs, the first of these was intended to work through a tutorial on that language, leaving three labs for further practical work.Each lecture roughly corresponded to a section in the textbook, and students were given exercises in the textbook to work, many of which did not have model solutions in the book. The planned solution was to engage students on the Piazza platform on these exercises (and any other question they might have), but it ultimately did not work. Registration to the online platform remained low throughout the course, even if it ticked up toward the end, and participation was even lower.After the discussion we had on this, I draw the following conclusions:(1) For Piazza to become more useful, registration and participation needs to be incentivized more strongly. Even then it is doubtful whether it is a good idea to make it an essential part of the learning process. Students seem reluctant to publicly ask questions, even if the platform allows to do so anonymously. Those that do seem to be happy with the interaction, but at least in this iteration of the course, they remained a very small group.(2) Students seem to prefer having model solutions to online interaction, presumably so they can compare their results for themselves when working on exercise problems. The simplest way to cater to this preference is to just create those solutions for the exercises given to the students. However, one driver behind the plan to use Piazza was the hope to engage students online on exercises they did not have solutions for, to spark discussions about different approaches and pitfalls etc. Even if this did not work on Piazza, it still seems a worthwhile goal, so during the discussion we floated the idea of seminars in addition to lectures, where I could work through exercises and have that interaction face to face instead of online. (3) Five labs are not very much space for practical work, especially if one of them goes to learning a new language and another is devoted to exam-like pen and paper exercises. Here, too, seminars could provide some relief --- an early seminar session might be used to teach Clojure, and collectively they would obviate the need for a dedicated exam prep session. That would free up all five lab sessions for programming exercises, which should become more tightly integrated with the theoretical material in the course.(4) Most of the lectures introduced mathematical concepts with only a few \"scheduled\" examples and occasionally some that arose from a classrom question or discussion. Several comments expressed a desire for more examples in class, which might require pruning the current material by eliminating some content that sits on the fringes of the topic area. And, of course, seminars might also be used to work through more examples interactively.Programledarens kommentarerDetta var första gången kursen gavs. Det var även första gången läraren gav en kurs i Sverige. Detta bidrog till att en del saker inte fungerade perfekt. t.ex. förväntade sig inte läraren att studenterna skulle förbereda sig inför labbarna, vilket studenterna trodde att de skulle. Materialet kom ut för sent för att studenterna skulle hinna förbereda sig. Användandet av piazza var lågt under kursen. Systemet hade kunnat hjälpa med en del andra saker studenterna upplevde som problematiskt, t.ex. avsaknad av facit på övningsuppgifter i boken.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 2 (obligatoriska kurser)": [
      {
        "code": "EDAF10",
        "name": "Objektorienterad modellering och diskreta strukturer",
        "points": "7.5",
        "year": "15/16",
        "registered": "109",
        "percentPassed": "76%",
        "teachingScore": "+28",
        "goalClearnessScore": "+31",
        "assessmentScore": "+58",
        "workloadScore": "+33",
        "importanceScore": "+81",
        "satisfactionScore": "+54",
        "comments": "Studierådets kommentarerBra kurs som är relevant för vår utbildning men konstigt att diskreta strukturer är kopplat till resten då de är brett skilda. Labbarna var förvirrande men föreläsaren bra!Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn bra genomförd kurs. Till nästa kursomgång flyttas delen om diskreta strukturer till en egen kurs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAF10",
        "name": "Tillämpad matematik - Linjära system",
        "points": "5.0",
        "year": "15/16",
        "registered": "67",
        "percentPassed": "72%",
        "teachingScore": "+33",
        "goalClearnessScore": "+62",
        "assessmentScore": "+56",
        "workloadScore": "+45",
        "importanceScore": "+58",
        "satisfactionScore": "+70",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF05",
        "name": "Algoritmer, datastrukturer och komplexitet",
        "points": "5.0",
        "year": "15/16",
        "registered": "135",
        "percentPassed": "70%",
        "teachingScore": "+44",
        "goalClearnessScore": "+37",
        "assessmentScore": "+80",
        "workloadScore": "+31",
        "importanceScore": "+91",
        "satisfactionScore": "+78",
        "comments": "Studierådets kommentarerDetta är en kurs som vi är väldigt nöjda med, bra innehåll, bra föreläsningar och labbar, dock hade vi velat ha fler av labbarna som obligatoriska och då implementering ger mycket för förståelsen så är det synd att spara in på labbarna i denna kursen. Övningar hade även kunnat hjälpa till mycket, så man hade kunnat arbeta med och resonera om algoritmerna.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSA05",
        "name": "Ingenjörsprocessen för programvaruutveckling - samhällsaspekter",
        "points": "4.0",
        "year": "15/16",
        "registered": "105",
        "percentPassed": "98%",
        "teachingScore": "-7",
        "goalClearnessScore": "+27",
        "assessmentScore": "+36",
        "workloadScore": "+61",
        "importanceScore": "0",
        "satisfactionScore": "-17",
        "comments": "Studierådets kommentarerEn kurs som många upplever som utan tydligt mål och struktur utan mest att det är en massa saker som slängts ihop till en kurs. Antingen borde det jobbas på djupare över fler kurser eller så måste upplägget ändras så att saker och ting känns som att de hänger ihop bättre.Kurslärarens kommentererDetta är den sista gången kursen ges i nuvarande form. Ämnet är svårt att intressera D-studenter för, eftersom det inte bara handlar om teknik, så utifrån det är kritiska kommentarer att vänta.Inför skapandet av en ny kurs för D3 tar vi med oss det bästa ur denna kurs, och försöker orientera kursen kring att starta ett nytt företag kring mjukvara, och den vägen få in \"mjuka\" frågor, som etik, juridik, projektledning etc.Programledarens kommentarerDetta är sista gången kursen gavs då obligatoriet på D ändras. I framtiden kommer kursen att slås ihop med ing. processen - ekonomi och kvalitet och ligga i år 3 för D. På CEQ-mötet diskuterades vilka delar av kursen som kan tas med i den nya kursen. Programledningen framförde att debattövningen kring etik gärna kan ingå i den nya kursen.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 2 (alternativobligatoriska kurser)": [
      {
        "code": "FMAF01",
        "name": "Matematik - Funktionsteori",
        "points": "7.0",
        "year": "15/16",
        "registered": "10",
        "percentPassed": "30%",
        "teachingScore": "+50",
        "goalClearnessScore": "+50",
        "assessmentScore": "0",
        "workloadScore": "+38",
        "importanceScore": "+50",
        "satisfactionScore": "+50",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 3 (obligatoriska kurser)": [
      {
        "code": "FAFF25",
        "name": "Fysik",
        "points": "11.0",
        "year": "15/16",
        "registered": "96",
        "percentPassed": "44%",
        "teachingScore": "+3",
        "goalClearnessScore": "+2",
        "assessmentScore": "+42",
        "workloadScore": "+12",
        "importanceScore": "-45",
        "satisfactionScore": "-7",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererDenna kurs går endast ett år till i sin nuvarande 11 hp form. Vi tycker att kursen har funnit sina former men att det stora problemet att kursen inte upplevs som särskilt relevant för utbildningen kvarstår. Denna kritik verkar mest inriktad på termodynamiken och hållbarhetsprojekten och dessa moment försvinner vid nästa omläggning. Under det sista året får vi försöka lägga ännu större vikt vid att tydligt förklara att även om dessa moment inte direkt kopplar till programeringsarbete så har dom stor relevans för själva ingenjörsrollen och studentens tekniska allmänbildning och förhållandet till samhället. Det går t.ex. knappast en enda dag utan att nyheter och tidningar diskuterar energi- och klimat-frågorProgramledarens kommentarerKursen kommer bara att ges en omgång till. Programledningen ser inget behöv av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSF01",
        "name": "Ingenjörsprocessen för programvaruutveckling - ekonomi och kvalitet",
        "points": "4.0",
        "year": "15/16",
        "registered": "98",
        "percentPassed": "84%",
        "teachingScore": "-35",
        "goalClearnessScore": "-51",
        "assessmentScore": "-18",
        "workloadScore": "+10",
        "importanceScore": "0",
        "satisfactionScore": "-53",
        "comments": "Studierådets kommentarerDetta är en kurs som behöver ses över. Studenterna hade svårt att förstå vad de skulle göra till projektet. Att ha en tenta och ett projekt i en kurs på 4 poäng är för mycket. Överlag så var projektet otydligt, studenterna kände att de problem som uppstod i projektet inte hade med ämnet att göra utan snarare annat kringliggande sakerna.Kurslärarens kommentererKA response to CEQ for ETSF01 2015/16En av kursens största utmaningar är att förmedla relevansen av kursinnehållet, då det handlar om av icke-tekniska aspekter av programvaruutveckling (projektplanering/ledning etc.) Responsen är fortsatt blandad med både positiva och negativa fritext svar på denna punkt. Kursinnehållet behöver fortlöpande motiveras igenom hela kursen, inte bara i början. Årets två gästföreläsningar var uppskattade, och gav insikt i hur projekt leds och organiseras inom industrin. Upplägget med tema föreläsningar fungerade bra, dvs en vanlig föreläsning i pass 1 och en gästföreläsare som pratade om samma tema i pass 2.Information om kursupplägget behöver också fortsatt arbetas med. Även om informationen finns tillgänglig, t ex läsanvisningarna på kurshemsidan, så behövs den pekas på upprepade gånger under föreläsningarna. Även de pedagogiska upplägget behöver förklaras och motiveras ännu tydligare, t ex att man lär sej mer av att aktivt granska andras arbete än att passivt ta emot feedback.Pga årets läsveckoindelning blev introduktionenen till kursprojektet lite väl kort. Till nästa omgång behöver projektbeskrivning och genomgången av den förbättras för att tydligare förmedla syfte och upplägg. Den förbättring vi gjorde med att specifiera en tänkt arbetsgång verkar snarare ha skapat mer förvirring än hjälp studenterna förstå uppgiften.Användandet av Moodle för att hantera kamratgranskningarna av rapporterna var en förbättring i år. Dock kvarstår kommentarerna om ojämn kvalitet på utförda granskningar. Det skulle kanske kunna förbättras genom att inlämnad respons kontrolleras, dock är den största förbättringen att ännu tydligare peka på vinsterna för egen del av att granska andras arbete. Kamratgranskningsupplägget skulle kunna förbättras ytterligare, t ex med lärarledda diskussion frågor under de muntliga återkopplingstillfällena (övning 2 & 3).Slutligen så skulle jag vilja spränga in små övningar på föreläsningarna med praktiska och för teorin relevanta frågeställningar. Detta skulle kunna stimulera till reflektion och stödja aktivt lärande av föreläsningsinnehållet.Programledarens kommentarerKursen kommer att ges en gång till då den senare kommer att slås ihop med ing.proc. - samhällsaspekter i det nya obligatoriet för D.På CEQ-mötet diskuterades hur uppgiftsbeskrivningen för projektet kan förbättras då flera studenter upplever den rörig. Den kommer att ses över till nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering bg - Bilder och grafik": [
      {
        "code": "FMAN20",
        "name": "Bildanalys",
        "points": "7.5",
        "year": "15/16",
        "registered": "93",
        "percentPassed": "86%",
        "teachingScore": "+37",
        "goalClearnessScore": "+30",
        "assessmentScore": "+71",
        "workloadScore": "+21",
        "importanceScore": "+82",
        "satisfactionScore": "+58",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn uppskattad kurs med många nöjda studenter. Man har verkligen uppskattat examinationsupplägget med inlämningar och hemtenta. Den enda kritiken är att föreläsningarna håll olika kvalitet och att man vill ha ännu mer feedback på vad man gjort.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN25",
        "name": "Interaktionsdesign",
        "points": "7.5",
        "year": "15/16",
        "registered": "59",
        "percentPassed": "97%",
        "teachingScore": "+22",
        "goalClearnessScore": "+9",
        "assessmentScore": "+61",
        "workloadScore": "+29",
        "importanceScore": "+54",
        "satisfactionScore": "+28",
        "comments": "KommentarerStudierådets kommentarer41 % av kursens deltagare har svarat på enkäten. Studenterna uppskattar projektet och att man fått så fria tyglar och säger att handledarmötena har varit väldigt bra och gett bra feedback. Om man ska ha kamratgranskningar hade de gärna haft fler så att man hunnit lära sig vad man skulle ge feedback på. En del känner att arbetsbördan blev lite stor på grund av att en rapport skulle skrivas varje vecka. Hela processen borde betygssättas och inte bara slutprodukten. Många ha räven tyckt att artikeln de skulle läsa var rätt oklar och otydligt vad man skulle göra med den.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerVäldigt skilda uppfattningar om kursen från studenterna. Kursen samläses med fler studenter än tidigare.Utfallet diskuteras med kursansvarig.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "15/16",
        "registered": "118",
        "percentPassed": "83%",
        "teachingScore": "-2",
        "goalClearnessScore": "+20",
        "assessmentScore": "+38",
        "workloadScore": "+29",
        "importanceScore": "+61",
        "satisfactionScore": "+32",
        "comments": "KommentarerStudierådets kommentarerKursen har fått bra kommentarer både gällande struktur och innehåll och den anses av många vara intressant, användbar och angelägen för fortsatta studier. Föreläsaren ansågs kunnig i ämnet men att föreläsningarna i viss mån behöver bli tydligare och mer beskrivande för att ge en djupare förståelse i ämnet, föreläsarens intresse för ämnet var något som uppskattades mycket av studenterna. Både laborationerna, övningarna och de utdelade extrauppgifterna har varit mycket uppskattade av studenterna men flera ansåg att vissa laborationshandledare och övningsledare behövde bli mer insatta både språkligt och gällande kursinnehållet. Kursansvarig har mottagit kommentarer om att till nästa kursomgång se över framförallt laboration 3 då många studenter uppgav att det var för mycket arbete som skulle genomföras under laborationstiden. Huruvida laborationen förändras eller om en större del av laborationen förväntas förberedas i förtid kommer att ses över. Även facit till utdelade gamla tentor kommer att ses över då dessa anses bristfälliga av många studenter.Kurslärarens kommentererKursen läses av många olika program och studenternas förkunskaper är varierande. Ett försök till lösning på detta problem i år är extra-föreläsningar på specifika moment. Detta har uppskattats och kommer att utvecklas för att möta alla studenter på rätt nivå. Övningsuppgifterna var i år uppdelade i svårighetsgrad och extra övningar på olika nivåer hade lagts till. Datorövning 3 var ny och kommer att putsas till nästa år, då tiden för att genomföra den var något kort. Förberedelseuppgifterna till datorövningarna kommer att utökas så att tiden för att genomföra övningen på plats räcker till. Arbete pågår med att utöka formelsamlingen till att också omfatta grundläggande formler.Programledarens kommentarerKursen har i stort sett fungerat bra. Dock har det funnits problem med en övningsledare som haft svårt att förklara på engelska. Laboration 3 upplevdes också som svår och det framkom önskemål om att flytta något moment till laboration 2.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN35",
        "name": "Högpresterande datorgrafik",
        "points": "7.5",
        "year": "15/16",
        "registered": "37",
        "percentPassed": "84%",
        "teachingScore": "+47",
        "goalClearnessScore": "+22",
        "assessmentScore": "+40",
        "workloadScore": "0",
        "importanceScore": "+63",
        "satisfactionScore": "+70",
        "comments": "Studierådets kommentarerBra kurs med bra moment. Studenterna gillade projektet.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FAFF20",
        "name": "Multispektral avbildning",
        "points": "7.5",
        "year": "15/16",
        "registered": "13",
        "percentPassed": "69%",
        "comments": ""
      },
      {
        "code": "MAMN01",
        "name": "Avancerad interaktionsdesign",
        "points": "7.5",
        "year": "15/16",
        "registered": "45",
        "percentPassed": "96%",
        "teachingScore": "+47",
        "goalClearnessScore": "+15",
        "assessmentScore": "+70",
        "workloadScore": "+35",
        "importanceScore": "+85",
        "satisfactionScore": "+58",
        "comments": "Studierådets kommentarerMånga uppskattade projektet och tyckte att det var väldigt lärorikt men kringliggande saker behöver ses över. Work in Progress upplevdes som otydligt, det var svårt att få feedback på hur man låg till samt att det behöver kontrolleras hårdare att alla medlemmar faktiskt bidrarKurslärarens kommentererKursen går i det stora hela bra. Studenterna är nöjda med att få arbeta i projekt med relativt fria tyglar, vilket bidrar till hög motivation och hög genomströmning. Endast 13 av 45 har besvarat enkäten. Fritext-svaren tar trots detta upp relevanta saker att se över, även om några kommentarer är motstridiga. De två viktigaste punkterna vi ser är:I vårens kurs lade vi in en \u0094rapport-skiss\u0094 halvvägs in i projektet. Målen och kraven för denna skiss kommer vi att förtydliga ytterligare. Till kommande kurs kommer rapporten och teori-bakgrunden få ytterligare något större fokus, och en tydlig progression i rapport-skrivande jämfört med tidigare kurser i framför allt C-programmet ska artikuleras.Studenterna vill gärna ha löpande feedback på sitt projekt och känner att det är svårt att förstå vad man ska fokusera på (för att få bra betyg). Vi ska försöka vara (ännu) tydligare med kursmålen och förväntningarna, samt arbeta med tydligare eller mer strukturerad återkoppling på handledningstillfällena.En kommentar rör samarbets-problem i gruppen. Detta är något vi löpande arbetar med att förebygga, men kommer att strama upp det förebyggande arbetet genom att:1.\tLägga större tyngdpunkt på att hjälpa gruppen att artikulera förväntningar och roll-fördelning på första träffen2.\tAtt styra upp idé-genereringen ännu mer så att alla i grupperna känner sig delaktiga i beslut3.\tGöra en handlingsplan för vad som händer om samarbets-problem i gruppen ändå uppstårProgramledarens kommentarerVälfungerande kurs som uppskattas mycket av studenterna.KL och PL närvarande, inga studentrepresentanter.Fokus i diskussionen landade på projektarbetet och gruppdynamik (löpande feedback på projektet, gruppsammansättning,...).CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIF10",
        "name": "Signalbehandling - design och implementering",
        "points": "7.5",
        "year": "15/16",
        "registered": "41",
        "percentPassed": "61%",
        "teachingScore": "+30",
        "goalClearnessScore": "+23",
        "assessmentScore": "+47",
        "workloadScore": "+38",
        "importanceScore": "+50",
        "satisfactionScore": "+25",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSN20",
        "name": "Spatial statistik med bildanalys",
        "points": "7.5",
        "year": "15/16",
        "registered": "30",
        "percentPassed": "90%",
        "teachingScore": "+44",
        "goalClearnessScore": "+16",
        "assessmentScore": "+75",
        "workloadScore": "-12",
        "importanceScore": "+50",
        "satisfactionScore": "+50",
        "comments": "KommentarerStudierådets kommentarerKursen har fått mycket bra kritik av studenterna men arbetsbelastningen anses vara något hög. Kursansvarig har fått många positiva kommentarer och anses vara kunnig och engagerad samt väldigt hjälpsam under kursens gång. Dock ansåg flera att mer teori och bakgrund på föreläsningarna hade underlättat för förståelsen av kursinnehållet. Datorövningarna ansåg behövas bli fler och/eller ha fler handledare vid tillfällena. Inlämningsuppgifterna och kursinnehållet anses intressant och användbart.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursansvarig har inte kallat till CEQ-möte.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering dpd - Design av processorer och digitala system": [
      {
        "code": "ETIN20",
        "name": "Digital IC-konstruktion",
        "points": "7.5",
        "year": "15/16",
        "registered": "21",
        "percentPassed": "71%",
        "comments": ""
      },
      {
        "code": "EITF35",
        "name": "Digitala strukturer på kisel",
        "points": "7.5",
        "year": "15/16",
        "registered": "22",
        "percentPassed": "86%",
        "teachingScore": "+50",
        "goalClearnessScore": "+43",
        "assessmentScore": "+69",
        "workloadScore": "+6",
        "importanceScore": "+91",
        "satisfactionScore": "+41",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN70",
        "name": "Modern elektronik",
        "points": "7.5",
        "year": "15/16",
        "registered": "22",
        "percentPassed": "77%",
        "comments": ""
      },
      {
        "code": "EITF20",
        "name": "Datorarkitektur",
        "points": "7.5",
        "year": "15/16",
        "registered": "45",
        "percentPassed": "76%",
        "teachingScore": "+17",
        "goalClearnessScore": "+20",
        "assessmentScore": "+21",
        "workloadScore": "+25",
        "importanceScore": "+63",
        "satisfactionScore": "+54",
        "comments": "Studierådets kommentarerIntressant ämne med passionerad föreläsare. Har med exempel från verkligheten. Labbarna var dock inte så bra och kan förbättras.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF40",
        "name": "Digitala och analoga projekt",
        "points": "7.5",
        "year": "15/16",
        "registered": "8",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "ETIN45",
        "name": "DSP-design",
        "points": "7.5",
        "year": "15/16",
        "registered": "17",
        "percentPassed": "94%",
        "comments": ""
      },
      {
        "code": "ESSF10",
        "name": "Mätteknik",
        "points": "5.0",
        "year": "15/16",
        "registered": "70",
        "percentPassed": "96%",
        "teachingScore": "+41",
        "goalClearnessScore": "+44",
        "assessmentScore": "+40",
        "workloadScore": "+15",
        "importanceScore": "+79",
        "satisfactionScore": "+61",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN35",
        "name": "IC-projekt 1",
        "points": "7.5",
        "year": "15/16",
        "registered": "16",
        "percentPassed": "56%",
        "comments": ""
      },
      {
        "code": "EDAN15",
        "name": "Konstruktion av inbyggda system",
        "points": "7.5",
        "year": "15/16",
        "registered": "34",
        "percentPassed": "76%",
        "teachingScore": "+6",
        "goalClearnessScore": "+40",
        "assessmentScore": "+14",
        "workloadScore": "+35",
        "importanceScore": "+77",
        "satisfactionScore": "+35",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN40",
        "name": "IC-projekt 2",
        "points": "7.5",
        "year": "15/16",
        "registered": "12",
        "percentPassed": "75%",
        "comments": ""
      },
      {
        "code": "ETIN55",
        "name": "Integrerade A/D och D/A omvandlare",
        "points": "7.5",
        "year": "15/16",
        "registered": "20",
        "percentPassed": "90%",
        "comments": ""
      }
    ],
    "Specialisering is - Inbyggda system": [
      {
        "code": "EDAA25",
        "name": "C-programmering",
        "points": "3.0",
        "year": "15/16",
        "registered": "101",
        "percentPassed": "51%",
        "teachingScore": "+10",
        "goalClearnessScore": "+20",
        "assessmentScore": "+38",
        "workloadScore": "+7",
        "importanceScore": "+79",
        "satisfactionScore": "+36",
        "comments": "Studierådets kommentarerStudenternas uppfattade nöjdhet av kursen i förhållande till den upplevda relevansen av kursen är intressant att ta i beaktande vid eventuella framtida revidering av kursen. Kursens innehåll är intressant och lärorikt. Föreläsaren uppfattas som väldigt insatt och motiverande i sina undervisningsmetoder av de nöjda studenterna, medan de missnöjda studenterna påpekar att detaljrikedomen på föreläsningarna gör innehållet svårt att tillgodogöra sig. Förväntningar på studenternas prestationer (i labbar och tentamina) behöver också förtydligas. En analys av kursens fritextsvar ger klara och tydliga indikationer på att kursansvarig bör se över/beakta/tänka över följande:-- Antalet högskolepoäng på kursen-- Nivån på kursen (G1, G2 eller A)-- Förkunskapskrav (Bör utökas för att innefatta (exempelivs) fortsättningskurs i programmering, datorteknik/datorarkitektur eller motsvarande)Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. I år infördes automatiks rättning av inlämningsuppgifterna. Detta har fungerat mycket bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF35",
        "name": "Digitala strukturer på kisel",
        "points": "7.5",
        "year": "15/16",
        "registered": "22",
        "percentPassed": "86%",
        "teachingScore": "+50",
        "goalClearnessScore": "+43",
        "assessmentScore": "+69",
        "workloadScore": "+6",
        "importanceScore": "+91",
        "satisfactionScore": "+41",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN65",
        "name": "Kompilatorer",
        "points": "7.5",
        "year": "15/16",
        "registered": "79",
        "percentPassed": "94%",
        "teachingScore": "+47",
        "goalClearnessScore": "+52",
        "assessmentScore": "+63",
        "workloadScore": "-3",
        "importanceScore": "+85",
        "satisfactionScore": "+76",
        "comments": "Studierådets kommentarerKursen har i regel varit väldigt omtyckt av studenterna. Ämnet är intressant och kursens utförande är systematiskt, med en naturlig progression i tillgodogörande av färdigheter.Arbetsbelastningen har periodvis uppfattats som hög. Utslaget över hela kursens gång har dock arbetsbelastningen uppfattats som rimligt. Lab 2 och lab 4 (utav 6) har uppfattats som för tunga och tidskrävande. De teoretiska koncept som introducerats inför labbarna (2 och 4) har varit svåra och det har saknats tillräckligt med praktiska/konkreta exempel på hur en student ska lösa vissa uppgifter.Föreläsaren och labbhandledarna har uppfattats som kompetenta och hjälpsamma, även om det i vissa varit för lågt tempo på föreläsningar samt varierande kvalitet och kvantitet på feedbacken till studenterna under laborationerna.Under utvärderingsmötet (HT15) föreslogs följande ändringar till nästa år (16/17):-- labbhandledningarna ska skrivas om för att i större utsträckning skapa incitament för studenterna att påbörja laborationerna (och eventuellt färdigställa stora delar) i god tid innan laborationstillfällena.-- Moodle-quizen ska utökas med mer frågor som berör aspektorienterad programmering (inhertided and synthesized attributes och användandet av equations), något som varit en hög tröskel att ta sig över för en del studenter.-- Mer fokus på att kommunicera ut lämplig studieteknik till studenterna.Kurslärarens kommentererStudenterna är mycket nöjda med kursen och tycker att den är intressant och angelägen för deras utbildning. Speciellt uppskattar man upplägget med labbarna som ett kontinuerligt projekt som är synkroniserat med föreläsningarna.Många tycker att arbetsbelastningen har varit högre än i många andra kurser, men de flesta ser detta som positivt. När man analyserar antalet timmar studenterna lägger ner så är det helt klart inom den planerade mängden (200 timmar) även för de studenter som lägger ner mer tid på labbarna än normalstudenten. Man kan också notera att kursen haft en väldigt hög genomströmning: Av 78 som påbörjade kursen har 76 fullföljt alla labbarna, och av 76 tenterande klarade 71 tentan vid första tentatillfället. Jag tror att det faktum att man tvingas arbeta mycket med de omfattande labbarna gör det lättare att plugga till tentan så att man i högre utsträckning klarar den.Uppgifterna (labbarna) varierar mycket i svårighet vilket gör arbetsbelastningen under kursens gång ojämn. Dock inte mer än för andra kurser där man har inlämningsuppgifter. Till denna kursomgång flyttade jag vissa moment från de tyngsta labbarna till de lättare, och jag angav förväntad tidsåtgång för de olika labbarna. Detta har haft en mycket positiv effekt och gjort att studenterna lättare kan planera eftersom de vet när de tunga momenten i kursen kommer. Det är svårt att flytta fler moment eftersom man behöver föreläsa om dem innan labben ges.Till denna kursomgång har jag också utvecklat kontrollfrågor för ett antal av föreläsningarna, och lagt in i systemet Moodle. Dessa har utnyttjats av en stor del av studenterna, och har uppskattats av dem som utnyttjat dem. Dock har jag inte hunnit med att göra frågor till alla föreläsningar, men kommer att fortsätta med detta nästa kursomgång.Under kursen har vi utnyttjat studentforumet Piazza, vilket fungerat mycket bra, speciellt för detaljfrågor angående labbar och extentor. Vi kommer att fortsätta med det nästa kursomgång.På CEQ-mötet diskuterade vi dessutom ett antal detaljfrågor som kommit upp i arbetsrapporten, och som jag kommer att åtgärda till nästa kursomgång, speciellt angående fler exempel och övningar på attribut.Programledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN25",
        "name": "Multicoreprogrammering",
        "points": "6.0",
        "year": "15/16",
        "registered": "87",
        "percentPassed": "75%",
        "teachingScore": "+18",
        "goalClearnessScore": "+10",
        "assessmentScore": "+32",
        "workloadScore": "+18",
        "importanceScore": "+76",
        "satisfactionScore": "+31",
        "comments": "Studierådets kommentarerKursen uppfattas som oerhört angelägen för studenternas utbildning. Det finns en stor spridning rörande hur studenterna uppfattat att kommunikationen mellan lärare och studenter fungerat. Detta indikerar att kursansvarig bör se över vilka förväntningar och direktiv som kommuniceras ut till studenterna under kursens gång. Mycket kritik i fritextsvaren är riktade till kurshemsidans innehåll. Laborationerna uppskattas väldigt mycket.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling. Eventuellt kan kursens hemsida uppdateras och hållas aktuell.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EIEF01",
        "name": "Tillämpad mekatronik",
        "points": "10.0",
        "year": "15/16",
        "registered": "42",
        "percentPassed": "62%",
        "teachingScore": "+58",
        "goalClearnessScore": "-8",
        "assessmentScore": "+81",
        "workloadScore": "+4",
        "importanceScore": "+90",
        "satisfactionScore": "+75",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererOm strukturen på det individuella projektet:Vi har arbetat en del med att sätta milestones och som vi ser det fungerar dessa bra. I kursutvärderingen finns dock ett par kommentarer om att programmeringen i C tog mycket tid, något som man som student var oförberedd på.Vi lovar att till nästa kursomgång ytterligare betona att man måste reservera mycket tid för programmeringen. Vi överväger att kräva CYGWIN redan till milestone 1 för att komma igång med programmeringen tidigt. Vi kan kanske också flytta fram sista milestone för att ge mer tid åt den.I andra kommentarer efterlyses mer överblick och info om det individuella projektets delar. Vi tycker dock att vi gett en bra stomme och vill inte ge noggrannare instruktioner eftersom syftena med projektet bla är att studenten ska lära sig att självständigt designa och cada kort och lära sig att behärska konsten att läsa och förstå datablad.Om industriprojektet:Det framförs en önskan att samtliga projekt ska vara baserade ute på företag och inte på skolan, något som vi helt instämmer i och ska genomföra till nästa kursomgång.Tack för ett glatt samarbete med studenterna, som gjort tillämpad mekatronik till en mycket  trevlig kurs att jobba med!Gabriel, Getachew, Gunnar, HenrietteCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF20",
        "name": "Datorarkitektur",
        "points": "7.5",
        "year": "15/16",
        "registered": "45",
        "percentPassed": "76%",
        "teachingScore": "+17",
        "goalClearnessScore": "+20",
        "assessmentScore": "+21",
        "workloadScore": "+25",
        "importanceScore": "+63",
        "satisfactionScore": "+54",
        "comments": "Studierådets kommentarerIntressant ämne med passionerad föreläsare. Har med exempel från verkligheten. Labbarna var dock inte så bra och kan förbättras.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN80",
        "name": "Algoritmer i signalprocessorer - projektkurs",
        "points": "7.5",
        "year": "15/16",
        "registered": "10",
        "percentPassed": "80%",
        "comments": ""
      },
      {
        "code": "EITN30",
        "name": "Internet inuti",
        "points": "7.5",
        "year": "15/16",
        "registered": "32",
        "percentPassed": "100%",
        "teachingScore": "+40",
        "goalClearnessScore": "+59",
        "assessmentScore": "+81",
        "workloadScore": "+21",
        "importanceScore": "+96",
        "satisfactionScore": "+92",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererEfter det att jag läst kursvärderingssvaren bekräftar dessa vad jag förväntademig av studenterna. Stor frihet under eget ansvar präglar kursen. Varje kursdeltagare rekommenderas att tillsammans med sin gruppkompis välja ett tidsupplägg av hur kurs-problemen/-laborationerna skall lösas. Alla väljer sin lösning och bygger vidare på denna. Jag försvarar det egna initiativet. Det finns många sätt att lösa problemen. Viktigt är att alla i en grupp kan redogöra för den egna lösningen. Samtidigt som detaljerna kan vara viktiga måste fokus också finnas på de övergipande funktionerna och deras prestanda. Här är jag mycket nöjd med utfallet av examinationen. Från dag ett visst studenterna vad som förväntades av dem och de levererade rätt. Jag är nöjd med utfallet.Programledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTN01",
        "name": "Realtidssystem",
        "points": "10.0",
        "year": "15/16",
        "registered": "63",
        "percentPassed": "83%",
        "teachingScore": "+53",
        "goalClearnessScore": "+35",
        "assessmentScore": "+69",
        "workloadScore": "+28",
        "importanceScore": "+69",
        "satisfactionScore": "+64",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN15",
        "name": "Konstruktion av inbyggda system",
        "points": "7.5",
        "year": "15/16",
        "registered": "34",
        "percentPassed": "76%",
        "teachingScore": "+6",
        "goalClearnessScore": "+40",
        "assessmentScore": "+14",
        "workloadScore": "+35",
        "importanceScore": "+77",
        "satisfactionScore": "+35",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF35",
        "name": "Operativsystem",
        "points": "7.5",
        "year": "15/16",
        "registered": "35",
        "percentPassed": "43%",
        "teachingScore": "+3",
        "goalClearnessScore": "+3",
        "assessmentScore": "+35",
        "workloadScore": "+9",
        "importanceScore": "+58",
        "satisfactionScore": "+33",
        "comments": "Studierådets kommentarerLabbarna var bra men det behövdes mer hjälp med just C programmerandet, handledningarna var även svåra att förstå. I kursplanen nämns att man ska kunna jobba med Android men detta saknades i kursens innehåll.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs som är relevant för utbildningen. Inför nästa år bör kursplanen ses över. Det är två saker som behöver övervägas: ett, Android nämns i kursplanen men kursinnehållet är mer fokuserat på linux. två, under förväntade förkunskapskrav kan nämnas att under labbarna används programspråket c.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ks - Kommunikationssystem": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "15/16",
        "registered": "71",
        "percentPassed": "97%",
        "teachingScore": "-4",
        "goalClearnessScore": "-0",
        "assessmentScore": "+48",
        "workloadScore": "-19",
        "importanceScore": "+68",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerKursen anges som väldigt angelägen för utbildningen, specifikt projektens innehåll. Dock riktas en hel del kritik med avseende på kursens kvalité och arbetsbelastning. Kursen behöver till framtida kursomgångar ändra om hur förväntningar på studenterna kommuniceras ut. Beskrivningar, quizzer och handledningar behöver förfinas.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling. Dock kan frågorna i quizen ses över.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF15",
        "name": "Markovprocesser",
        "points": "7.5",
        "year": "15/16",
        "registered": "39",
        "percentPassed": "77%",
        "teachingScore": "+18",
        "goalClearnessScore": "+36",
        "assessmentScore": "+61",
        "workloadScore": "+70",
        "importanceScore": "+50",
        "satisfactionScore": "+57",
        "comments": "Studierådets kommentarerStudenterna har uppskattat kursen i sin helhet vad gäller ämnet, kursinnehållet och strukturen med föreläsningar, övningar och laborationer. Kursen har fått flera positiva kommentarer gällande föreläsarens struktur, pedagogik och föreläsningsinnehåll. Kurslitteraturen har fått positiv respons och både övningar och laborationer har upplevts intressanta och relevanta för kursen. Dock är övningsledarna något som många anser behöver ses över då de upplevdes sakna kunskaper, både språkligt och vad gäller kursinnehållet, för att kunna hjälpa till i den utsträckning som studenterna önskar.Kurslärarens kommentererIt is very positive that an absolute majority of students who haveanswered the CEQ found the course important for their education andwere generally satisfied with the course. However, there have beensome comments regarding teaching assistants for exercises which havebeen highlighted in \"free text answers\". I would like to assure thestudents that we take these comments very seriously. I have discussedthe issues with the head of department and we will certainly takethese comments into consideration in our planning for next year.Programledarens kommentarerKursanasvarig har inte kallat till något möte.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF05",
        "name": "Webbsäkerhet",
        "points": "4.0",
        "year": "15/16",
        "registered": "90",
        "percentPassed": "98%",
        "teachingScore": "+49",
        "goalClearnessScore": "+31",
        "assessmentScore": "+18",
        "workloadScore": "+32",
        "importanceScore": "+79",
        "satisfactionScore": "+63",
        "comments": "KommentarerStudierådets kommentarerStudenterna uppfattar kursen som otroligt relevant vilket innebär att själva kursinnehållet håller en bra nivå. Förväntningarna på studenterna verkar ha brustit (m.a.p fråga 18, 25) något som kan motverkas om kommunikationen (antingen på föreläsningar eller via anvisningar i labhandledning/hemsida) förtydligas. Kursen överlag var mycket bra. Onlinetentan kommer att göras om nästa år för att fungera bättre och antagligen kommer man få använda kurslitteraturen under onlinetenan/duggan. Projektet var både lärorikt och intressant.Kurslärarens kommentererDen stora nyheten i årets version av kursen var onlineskrivningen, som fick blandad kritik. En förbättring för nästa år är att tillåta studenterna att ha kurslitteraturen tillgänglig när man skriver provet. En annan är att bättre förbereda studenterna på att det inte är en rutinmässig eller enkel skrivning - den tar tid.Projekten fungerade mestadels bra, vilket är glädjande. Eventuellt skulle man kunna fokusera mer på attackerna.Programledarens kommentarerDet är glädjande att notera att kursen återigen bedöms ha mycket hög relevans för utbildningen. Kursen har fungerat bra, och vid CEQ-mötet ventilerades några eventuella förbättringsförslag.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN41",
        "name": "Avancerad webbsäkerhet",
        "points": "7.5",
        "year": "15/16",
        "registered": "58",
        "percentPassed": "97%",
        "teachingScore": "+45",
        "goalClearnessScore": "+58",
        "assessmentScore": "+59",
        "workloadScore": "-8",
        "importanceScore": "+98",
        "satisfactionScore": "+79",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererStudenterna har liknande åsikter om kursen som tidigare. Den verkar fungera bra och den känns mycket angelägen för deras utbildning. Den egentligen enda förändringen som gjordes jämfört med tidigare var att de sista två föreläsningarna plockades bort. Dessa föreläsningar upplevde jag själv inte som särskilt bra tidigare så jag ville testa om det blev skillnad om jag tog bort dem. Resultatmässigt på inlämningsuppgifterna märkte jag ingen större skillnad, men några påpekade på utvärderingen att de gärna hade haft föreläsningar på sista delen också. Jag har inte riktigt bestämt hur jag ska göra nästa år med detta, men jag har några olika alternativ som diskuteras med övriga lärare på kursen.Programledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling. Arbetsbelastningen behöver dock beaktas.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETTN01",
        "name": "Digital kommunikation, fortsättningskurs",
        "points": "7.5",
        "year": "15/16",
        "registered": "41",
        "percentPassed": "61%",
        "teachingScore": "+16",
        "goalClearnessScore": "+11",
        "assessmentScore": "+22",
        "workloadScore": "-7",
        "importanceScore": "+32",
        "satisfactionScore": "+19",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSF10",
        "name": "Internetprotokoll",
        "points": "7.5",
        "year": "15/16",
        "registered": "22",
        "percentPassed": "82%",
        "teachingScore": "-11",
        "goalClearnessScore": "-4",
        "assessmentScore": "+52",
        "workloadScore": "+11",
        "importanceScore": "+50",
        "satisfactionScore": "+25",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDIN01",
        "name": "Kryptoteknik",
        "points": "7.5",
        "year": "15/16",
        "registered": "66",
        "percentPassed": "58%",
        "teachingScore": "+17",
        "goalClearnessScore": "+11",
        "assessmentScore": "+52",
        "workloadScore": "-9",
        "importanceScore": "+46",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerÖverlag uppskattad kurs. Dock var omdömena sämre än tidigare år. Även resultaten på tentan var mycket sämre än tidigare.Generellt tyckte studenterna att tentan var tung. Många tidskrävande uppgifter.En del hade uppskattat om projekten gav högskolepoäng med tanke på hur mycket tid de tog. Fler övningstillfällen önskades och gärna en tentamensgenomgång i slutet av kursen.Fler exempel i slidesen hade uppskattats. Kursmaterialet behöver uppdateras bättre i samband med det nya kursupplägget.Kurslärarens kommentererKursen har gått bra och studenterna ser den som mycket relevant för sin utbildning. Det påpekas att det kanske är dags att uppdatera kursmaterialet, vilket ska ske.Även ett par extra övningstillfällen efterfrågas, då vi detta år inbjöd till projektfrågor på övningar.Programledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling. Studenternas kommentarer om det utdelade materialet och samordning mellan lärare och övningsledare behöver dock beaktas.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN10",
        "name": "Algebraiska strukturer",
        "points": "7.5",
        "year": "15/16",
        "registered": "15",
        "percentPassed": "20%",
        "comments": ""
      },
      {
        "code": "ETSN01",
        "name": "Avancerad telekommunikation",
        "points": "7.5",
        "year": "15/16",
        "registered": "35",
        "percentPassed": "63%",
        "teachingScore": "+12",
        "goalClearnessScore": "-2",
        "assessmentScore": "-19",
        "workloadScore": "-11",
        "importanceScore": "+17",
        "satisfactionScore": "+4",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThe course evaluation this year was much improved from last year, which is encouraging. It seems the changes to the course were appreciated by students. In particular, discussions with students indicated that they had a much clearer idea of what was required of them on the exam compared with the exam format used in previous years.However, there is still plenty of room for improvement. Based on both the CEQ responses as well as discussions with students, there were a number of issues in the course that I will work to address for next year. The course received a low score for \"appropriate assessment\" and there seems to be a perception among students that too much of the assessment depends on memorisation rather than demonstrating understanding. It is difficult to see where this perception arises, since fact-based questions made up only a small part of the assessment (30% of the written exam, and none of the project work at all). However, one possible contributing factor to this issue is that many students lack the assumed knowledge when they come into the course. This likely makes it very difficult for them to relate what they learn in the course to their previous studies, perhaps leading to the course material being perceived as only a collection of facts. Next year, the course project will be changed to be a group-based system design task along with some activities early in the course aimed at raising students' prior knowledge level. In addition, I intend to revise and improve the tutorial questions, including adding more questions that integrate different parts of the course.Another issue raised by students was that they did not get much out of the computer-based simulation labs. Although they were able to complete the lab tasks, they felt they did not really acquire an understanding of the simulator or how it works, but rather just followed the lab instructions by rote. We have trialled various permutations of networking simulation and none of them have been particularly successful. The students do not have the necessary programming background to make their own simulations, and there is not enough time in the course to thoroughly learn a simulation package such as we have been using. For these reasons, the computer labs will be removed from the course next year. This time will instead be used for the new system design project. The new project will also address some general competencies that are currently not present in the course. It will involve groupwork, a written report, and an oral presentation.Finally, students struggled with the course structure. Since it is a systems course, it consists of examining different topics and the relationships between them, rather than following a linear structure in which each topic builds on the previous one. Next year I will create an explicit concept map of the course showing how the different modules relate to each other and to the over-arching course goals of system evaluation and system design. This will be referred to throughout the course so that students have a better understanding of where we are up to and what has been covered so far. I will also combine the queueing thoery and congestion control modules into one traffic management module, to make it more clear how queueing thoery concepts are used in modelling and implementing congestion control mechanisms in routers and networks.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN30",
        "name": "Internet inuti",
        "points": "7.5",
        "year": "15/16",
        "registered": "32",
        "percentPassed": "100%",
        "teachingScore": "+40",
        "goalClearnessScore": "+59",
        "assessmentScore": "+81",
        "workloadScore": "+21",
        "importanceScore": "+96",
        "satisfactionScore": "+92",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererEfter det att jag läst kursvärderingssvaren bekräftar dessa vad jag förväntademig av studenterna. Stor frihet under eget ansvar präglar kursen. Varje kursdeltagare rekommenderas att tillsammans med sin gruppkompis välja ett tidsupplägg av hur kurs-problemen/-laborationerna skall lösas. Alla väljer sin lösning och bygger vidare på denna. Jag försvarar det egna initiativet. Det finns många sätt att lösa problemen. Viktigt är att alla i en grupp kan redogöra för den egna lösningen. Samtidigt som detaljerna kan vara viktiga måste fokus också finnas på de övergipande funktionerna och deras prestanda. Här är jag mycket nöjd med utfallet av examinationen. Från dag ett visst studenterna vad som förväntades av dem och de levererade rätt. Jag är nöjd med utfallet.Programledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN45",
        "name": "Informationsteori",
        "points": "7.5",
        "year": "15/16",
        "registered": "42",
        "percentPassed": "81%",
        "teachingScore": "+41",
        "goalClearnessScore": "+52",
        "assessmentScore": "+49",
        "workloadScore": "+32",
        "importanceScore": "+50",
        "satisfactionScore": "+64",
        "comments": "Studierådets kommentarerStudenterna är väldigt nöjda med kursen, särskillt tentan som de kände var utmanande på ett rättvist sätt, och då det var en hemtentamen så kunde man fördjupa sin förståelse under själva tentamen. Föreläsaren får även ett plus i kanten av flertalet studenter.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomför kurs. Programledningen ser inget behov av större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN21",
        "name": "Projekt i trådlös kommunikation",
        "points": "7.5",
        "year": "15/16",
        "registered": "29",
        "percentPassed": "69%",
        "teachingScore": "+57",
        "goalClearnessScore": "+34",
        "assessmentScore": "+64",
        "workloadScore": "-5",
        "importanceScore": "+86",
        "satisfactionScore": "+55",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering pv - Programvara": [
      {
        "code": "EDAA25",
        "name": "C-programmering",
        "points": "3.0",
        "year": "15/16",
        "registered": "101",
        "percentPassed": "51%",
        "teachingScore": "+10",
        "goalClearnessScore": "+20",
        "assessmentScore": "+38",
        "workloadScore": "+7",
        "importanceScore": "+79",
        "satisfactionScore": "+36",
        "comments": "Studierådets kommentarerStudenternas uppfattade nöjdhet av kursen i förhållande till den upplevda relevansen av kursen är intressant att ta i beaktande vid eventuella framtida revidering av kursen. Kursens innehåll är intressant och lärorikt. Föreläsaren uppfattas som väldigt insatt och motiverande i sina undervisningsmetoder av de nöjda studenterna, medan de missnöjda studenterna påpekar att detaljrikedomen på föreläsningarna gör innehållet svårt att tillgodogöra sig. Förväntningar på studenternas prestationer (i labbar och tentamina) behöver också förtydligas. En analys av kursens fritextsvar ger klara och tydliga indikationer på att kursansvarig bör se över/beakta/tänka över följande:-- Antalet högskolepoäng på kursen-- Nivån på kursen (G1, G2 eller A)-- Förkunskapskrav (Bör utökas för att innefatta (exempelivs) fortsättningskurs i programmering, datorteknik/datorarkitektur eller motsvarande)Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. I år infördes automatiks rättning av inlämningsuppgifterna. Detta har fungerat mycket bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN65",
        "name": "Kompilatorer",
        "points": "7.5",
        "year": "15/16",
        "registered": "79",
        "percentPassed": "94%",
        "teachingScore": "+47",
        "goalClearnessScore": "+52",
        "assessmentScore": "+63",
        "workloadScore": "-3",
        "importanceScore": "+85",
        "satisfactionScore": "+76",
        "comments": "Studierådets kommentarerKursen har i regel varit väldigt omtyckt av studenterna. Ämnet är intressant och kursens utförande är systematiskt, med en naturlig progression i tillgodogörande av färdigheter.Arbetsbelastningen har periodvis uppfattats som hög. Utslaget över hela kursens gång har dock arbetsbelastningen uppfattats som rimligt. Lab 2 och lab 4 (utav 6) har uppfattats som för tunga och tidskrävande. De teoretiska koncept som introducerats inför labbarna (2 och 4) har varit svåra och det har saknats tillräckligt med praktiska/konkreta exempel på hur en student ska lösa vissa uppgifter.Föreläsaren och labbhandledarna har uppfattats som kompetenta och hjälpsamma, även om det i vissa varit för lågt tempo på föreläsningar samt varierande kvalitet och kvantitet på feedbacken till studenterna under laborationerna.Under utvärderingsmötet (HT15) föreslogs följande ändringar till nästa år (16/17):-- labbhandledningarna ska skrivas om för att i större utsträckning skapa incitament för studenterna att påbörja laborationerna (och eventuellt färdigställa stora delar) i god tid innan laborationstillfällena.-- Moodle-quizen ska utökas med mer frågor som berör aspektorienterad programmering (inhertided and synthesized attributes och användandet av equations), något som varit en hög tröskel att ta sig över för en del studenter.-- Mer fokus på att kommunicera ut lämplig studieteknik till studenterna.Kurslärarens kommentererStudenterna är mycket nöjda med kursen och tycker att den är intressant och angelägen för deras utbildning. Speciellt uppskattar man upplägget med labbarna som ett kontinuerligt projekt som är synkroniserat med föreläsningarna.Många tycker att arbetsbelastningen har varit högre än i många andra kurser, men de flesta ser detta som positivt. När man analyserar antalet timmar studenterna lägger ner så är det helt klart inom den planerade mängden (200 timmar) även för de studenter som lägger ner mer tid på labbarna än normalstudenten. Man kan också notera att kursen haft en väldigt hög genomströmning: Av 78 som påbörjade kursen har 76 fullföljt alla labbarna, och av 76 tenterande klarade 71 tentan vid första tentatillfället. Jag tror att det faktum att man tvingas arbeta mycket med de omfattande labbarna gör det lättare att plugga till tentan så att man i högre utsträckning klarar den.Uppgifterna (labbarna) varierar mycket i svårighet vilket gör arbetsbelastningen under kursens gång ojämn. Dock inte mer än för andra kurser där man har inlämningsuppgifter. Till denna kursomgång flyttade jag vissa moment från de tyngsta labbarna till de lättare, och jag angav förväntad tidsåtgång för de olika labbarna. Detta har haft en mycket positiv effekt och gjort att studenterna lättare kan planera eftersom de vet när de tunga momenten i kursen kommer. Det är svårt att flytta fler moment eftersom man behöver föreläsa om dem innan labben ges.Till denna kursomgång har jag också utvecklat kontrollfrågor för ett antal av föreläsningarna, och lagt in i systemet Moodle. Dessa har utnyttjats av en stor del av studenterna, och har uppskattats av dem som utnyttjat dem. Dock har jag inte hunnit med att göra frågor till alla föreläsningar, men kommer att fortsätta med detta nästa kursomgång.Under kursen har vi utnyttjat studentforumet Piazza, vilket fungerat mycket bra, speciellt för detaljfrågor angående labbar och extentor. Vi kommer att fortsätta med det nästa kursomgång.På CEQ-mötet diskuterade vi dessutom ett antal detaljfrågor som kommit upp i arbetsrapporten, och som jag kommer att åtgärda till nästa kursomgång, speciellt angående fler exempel och övningar på attribut.Programledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN25",
        "name": "Multicoreprogrammering",
        "points": "6.0",
        "year": "15/16",
        "registered": "87",
        "percentPassed": "75%",
        "teachingScore": "+18",
        "goalClearnessScore": "+10",
        "assessmentScore": "+32",
        "workloadScore": "+18",
        "importanceScore": "+76",
        "satisfactionScore": "+31",
        "comments": "Studierådets kommentarerKursen uppfattas som oerhört angelägen för studenternas utbildning. Det finns en stor spridning rörande hur studenterna uppfattat att kommunikationen mellan lärare och studenter fungerat. Detta indikerar att kursansvarig bör se över vilka förväntningar och direktiv som kommuniceras ut till studenterna under kursens gång. Mycket kritik i fritextsvaren är riktade till kurshemsidans innehåll. Laborationerna uppskattas väldigt mycket.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling. Eventuellt kan kursens hemsida uppdateras och hållas aktuell.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN20",
        "name": "Språkteknologi",
        "points": "7.5",
        "year": "15/16",
        "registered": "69",
        "percentPassed": "93%",
        "teachingScore": "+17",
        "goalClearnessScore": "+24",
        "assessmentScore": "+51",
        "workloadScore": "+49",
        "importanceScore": "+33",
        "satisfactionScore": "+28",
        "comments": "Studierådets kommentarerKursen har ett genomsnittligt högt anseende men sett över de individuella svaren råder det en stor spridning rörande hur kursen har uppfattats. Detta indikerar på att direktiv, information och förväntingar inte kommunicerats ut på ett ändamålsenligt sätt. Arbetsbelastningen och svårigheten är i regel till studenternas behag men en kan fråga sig om det motsvarar en avancerad 7.5hp kurs. Ämnet uppfattas som intressant. Föreläsaren anses vara engagerad och undervisningsmetodiken är i många fall bra.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN40",
        "name": "Funktionsprogrammering",
        "points": "7.5",
        "year": "15/16",
        "registered": "105",
        "percentPassed": "67%",
        "teachingScore": "+5",
        "goalClearnessScore": "+24",
        "assessmentScore": "+51",
        "workloadScore": "+25",
        "importanceScore": "+56",
        "satisfactionScore": "+40",
        "comments": "Studierådets kommentarerStudenterna är överlag nöjda med kursen och tycker att det är ett intressant ämne. Projekten är roliga och det är bra att man får lära sig haskell.Föreläsningarna är dock inte så givande.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling. Dock krävs ett omfattande planeringsarbete inför nästa kursomgång då kursen samläses med en 5hp kurs på G-nivå.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN01",
        "name": "Constraint-programmering",
        "points": "7.5",
        "year": "15/16",
        "registered": "78",
        "percentPassed": "83%",
        "teachingScore": "+20",
        "goalClearnessScore": "+49",
        "assessmentScore": "+52",
        "workloadScore": "+8",
        "importanceScore": "+43",
        "satisfactionScore": "+47",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling men studenterna upplever den första labben sopa väldigt svår. Den kanske behöver lite med vägledning eller information.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF15",
        "name": "Algoritmimplementering",
        "points": "5.0",
        "year": "15/16",
        "registered": "60",
        "percentPassed": "48%",
        "teachingScore": "+26",
        "goalClearnessScore": "+13",
        "assessmentScore": "+38",
        "workloadScore": "+18",
        "importanceScore": "+71",
        "satisfactionScore": "+48",
        "comments": "Studierådets kommentarerKursen verkar ha fungerat bra med många nöjda studenter. Labbarna är uppskattade samt föreläsarens engagemang.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen fungerar väl varför kursevalueringen diskuterades via epost. Inga kommentarer har inkommit.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering se - Software engineering": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "15/16",
        "registered": "71",
        "percentPassed": "97%",
        "teachingScore": "-4",
        "goalClearnessScore": "-0",
        "assessmentScore": "+48",
        "workloadScore": "-19",
        "importanceScore": "+68",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerKursen anges som väldigt angelägen för utbildningen, specifikt projektens innehåll. Dock riktas en hel del kritik med avseende på kursens kvalité och arbetsbelastning. Kursen behöver till framtida kursomgångar ändra om hur förväntningar på studenterna kommuniceras ut. Beskrivningar, quizzer och handledningar behöver förfinas.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl fungerande kurs. Programledningen ser inget behov av någon större kursutveckling. Dock kan frågorna i quizen ses över.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN25",
        "name": "Interaktionsdesign",
        "points": "7.5",
        "year": "15/16",
        "registered": "59",
        "percentPassed": "97%",
        "teachingScore": "+22",
        "goalClearnessScore": "+9",
        "assessmentScore": "+61",
        "workloadScore": "+29",
        "importanceScore": "+54",
        "satisfactionScore": "+28",
        "comments": "KommentarerStudierådets kommentarer41 % av kursens deltagare har svarat på enkäten. Studenterna uppskattar projektet och att man fått så fria tyglar och säger att handledarmötena har varit väldigt bra och gett bra feedback. Om man ska ha kamratgranskningar hade de gärna haft fler så att man hunnit lära sig vad man skulle ge feedback på. En del känner att arbetsbördan blev lite stor på grund av att en rapport skulle skrivas varje vecka. Hela processen borde betygssättas och inte bara slutprodukten. Många ha räven tyckt att artikeln de skulle läsa var rätt oklar och otydligt vad man skulle göra med den.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerVäldigt skilda uppfattningar om kursen från studenterna. Kursen samläses med fler studenter än tidigare.Utfallet diskuteras med kursansvarig.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSN05",
        "name": "Programvaruutveckling för stora system",
        "points": "7.5",
        "year": "15/16",
        "registered": "58",
        "percentPassed": "100%",
        "teachingScore": "-36",
        "goalClearnessScore": "-23",
        "assessmentScore": "+53",
        "workloadScore": "+57",
        "importanceScore": "+57",
        "satisfactionScore": "-10",
        "comments": "Studierådets kommentarerTrots att kursen uppfattas som väldigt angelägen, är det många studenter som inte är nöjda med kursen. Från statistiken och frihetsvaren i arbetsrapporten verkar det framstå som om att kommunikationen mellan student och lärare brister. Förväntningar på studenterna m.a.p prestation är undermålig. Konceptet av att arbeta i stora grupper uppskattas väldigt mycket av studenterna.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerFlera ändringar har gjorts inför årets kursomgång, uppgiften var ny och det var en ny kurslärare. Detta har lett till en del missförstånd och brister i kommunikationen. Inför nästa år bär uppgiftesbeskrivningen ses över.  Installation av nödvändiga verktyg bör även göras i god tid på skolans datorer. Jag är övertygad om att erfarenheter från året kommer att göra kursen mycket bättre nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN10",
        "name": "Konfigurationshantering",
        "points": "7.5",
        "year": "15/16",
        "registered": "68",
        "percentPassed": "97%",
        "teachingScore": "+44",
        "goalClearnessScore": "+29",
        "assessmentScore": "+20",
        "workloadScore": "-6",
        "importanceScore": "+64",
        "satisfactionScore": "+52",
        "comments": "Studierådets kommentarerVäldigt bra lärare och relevant för vår utbildning men kurslitteraturen behöver uppdateras/Förnyas.Kurslärarens kommentererI am very happy to see that once again students find this course very important for their education (and future work) and find the teaching good.Once again students find that the workload is high. I can only say that this must (again) be a subjective feeling. Very little has changed on the course (except a few things to easen the workload) since I made a survey 3-4 years ago. This survey showed that almost no students came anyway near to the 200 hours required for a 7.5 credit course. However, a couple of students commented on the high number of different activities on the course (I see them as supporting different ways of learning). This might be the root of this subjective feeling. So next year I will try to make it more clear and explicit that there are a few \"streams\" of related activities - and not a load of single activities.Many students comment on the course literature and state that parts of it is \"outdated\". I did not see any student calling parts of the course literature (maybe except for the part on PDM) irrelevant - which makes me happy. In fact many students find Feiler's report difficult to read (and outdated being from 1990), but also very central and important for the course for the concepts it introduces. So if \"outdated\" would be an argument, we'd have to rewrite the Bible instead of trying to re-cast its concepts in a modern context. If I find more \"current\" literature that covers the same concepts and principles in a better way, I will include that - otherwise I am happy as it is.The theme for week 3 (The Study) of the course will be reworked for next year. There needs to be a more clear focus on the four work model from Feiler - and I want to include something on a \"modern\" topic that some might meet in their work afterwards: CoDe/DevOps. This means that the two models from Feiler that are hard to read (too many irrelevant details that some students find difficult to filter away) will be integrated in the introduction and overview part - and I will have to re-write Feiler's text about the checkout-checkin and long transaction models. This leaves space in the in-depth part for adding a substantial paper about CoDe/DevOps - where it should be possible to find a \"modern\" reference.From my own evalution questionnaire, it results that there are some problems with the workshop exercises. Mostly people feel that the metaphor exercises take up too much time. It has never been my intention and I also say that at the beginning of each exercise session. I will probably have to write it in the exercises too and make it absolutely clear that the metaphor part is \"time-boxed\". There has also been some requests for more \"use cases and real-life examples\". I have added such things over the years, but with a rather \"patchy\" result. I plan to go through all eercise sessions to streamline them and also plan to do some shop-lifting from relevant discussions from various SCM-related groups on LinkedIn.A surprising result from my own evaluation questionnaire was that this year the students appreciated the video lectures much more than the following discussion sessions - last year it was the opposite. Since nothing has changed in the setup, the results was a little puzzling. At the meeting with the student representatives this was discussed and it was noted by one of the representatives that the discussion questions (that are posed by the students) were not always that easy to have good discussions about. So it was suggested to provide better/more \"guidance\" for those groups who had to come up with the discussion questions in order to ensure more \"discussable\" questions. That sounds like a good idea.Programledarens kommentarerEn väl genomförd kurs. Programledningen ser inget behov av någon omfattande kursutveckling. I dialogen med studenterna behöver strukturen på kursen vara tydlig (paper + review)CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN01",
        "name": "Constraint-programmering",
        "points": "7.5",
        "year": "15/16",
        "registered": "78",
        "percentPassed": "83%",
        "teachingScore": "+20",
        "goalClearnessScore": "+49",
        "assessmentScore": "+52",
        "workloadScore": "+8",
        "importanceScore": "+43",
        "satisfactionScore": "+47",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kuromgång. Programledningen ser inget behöv av någon större kursutveckling men studenterna upplever den första labben sopa väldigt svår. Den kanske behöver lite med vägledning eller information.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTN01",
        "name": "Realtidssystem",
        "points": "10.0",
        "year": "15/16",
        "registered": "63",
        "percentPassed": "83%",
        "teachingScore": "+53",
        "goalClearnessScore": "+35",
        "assessmentScore": "+69",
        "workloadScore": "+28",
        "importanceScore": "+69",
        "satisfactionScore": "+64",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ssr - System, signaler och reglering": [
      {
        "code": "FRTN10",
        "name": "Flervariabel reglering",
        "points": "7.5",
        "year": "15/16",
        "registered": "71",
        "percentPassed": "77%",
        "teachingScore": "+48",
        "goalClearnessScore": "+26",
        "assessmentScore": "+65",
        "workloadScore": "+21",
        "importanceScore": "+84",
        "satisfactionScore": "+73",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN55",
        "name": "Signalseparation - oberoende komponenter",
        "points": "7.5",
        "year": "15/16",
        "registered": "18",
        "percentPassed": "72%",
        "comments": ""
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "15/16",
        "registered": "118",
        "percentPassed": "83%",
        "teachingScore": "-2",
        "goalClearnessScore": "+20",
        "assessmentScore": "+38",
        "workloadScore": "+29",
        "importanceScore": "+61",
        "satisfactionScore": "+32",
        "comments": "KommentarerStudierådets kommentarerKursen har fått bra kommentarer både gällande struktur och innehåll och den anses av många vara intressant, användbar och angelägen för fortsatta studier. Föreläsaren ansågs kunnig i ämnet men att föreläsningarna i viss mån behöver bli tydligare och mer beskrivande för att ge en djupare förståelse i ämnet, föreläsarens intresse för ämnet var något som uppskattades mycket av studenterna. Både laborationerna, övningarna och de utdelade extrauppgifterna har varit mycket uppskattade av studenterna men flera ansåg att vissa laborationshandledare och övningsledare behövde bli mer insatta både språkligt och gällande kursinnehållet. Kursansvarig har mottagit kommentarer om att till nästa kursomgång se över framförallt laboration 3 då många studenter uppgav att det var för mycket arbete som skulle genomföras under laborationstiden. Huruvida laborationen förändras eller om en större del av laborationen förväntas förberedas i förtid kommer att ses över. Även facit till utdelade gamla tentor kommer att ses över då dessa anses bristfälliga av många studenter.Kurslärarens kommentererKursen läses av många olika program och studenternas förkunskaper är varierande. Ett försök till lösning på detta problem i år är extra-föreläsningar på specifika moment. Detta har uppskattats och kommer att utvecklas för att möta alla studenter på rätt nivå. Övningsuppgifterna var i år uppdelade i svårighetsgrad och extra övningar på olika nivåer hade lagts till. Datorövning 3 var ny och kommer att putsas till nästa år, då tiden för att genomföra den var något kort. Förberedelseuppgifterna till datorövningarna kommer att utökas så att tiden för att genomföra övningen på plats räcker till. Arbete pågår med att utöka formelsamlingen till att också omfatta grundläggande formler.Programledarens kommentarerKursen har i stort sett fungerat bra. Dock har det funnits problem med en övningsledare som haft svårt att förklara på engelska. Laboration 3 upplevdes också som svår och det framkom önskemål om att flytta något moment till laboration 2.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETTN01",
        "name": "Digital kommunikation, fortsättningskurs",
        "points": "7.5",
        "year": "15/16",
        "registered": "41",
        "percentPassed": "61%",
        "teachingScore": "+16",
        "goalClearnessScore": "+11",
        "assessmentScore": "+22",
        "workloadScore": "-7",
        "importanceScore": "+32",
        "satisfactionScore": "+19",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN60",
        "name": "Optimal och adaptiv signalbehandling",
        "points": "7.5",
        "year": "15/16",
        "registered": "26",
        "percentPassed": "73%",
        "teachingScore": "-7",
        "goalClearnessScore": "+5",
        "assessmentScore": "+55",
        "workloadScore": "+28",
        "importanceScore": "+55",
        "satisfactionScore": "+9",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN80",
        "name": "Algoritmer i signalprocessorer - projektkurs",
        "points": "7.5",
        "year": "15/16",
        "registered": "10",
        "percentPassed": "80%",
        "comments": ""
      },
      {
        "code": "FRTN15",
        "name": "Prediktiv reglering",
        "points": "7.5",
        "year": "15/16",
        "registered": "32",
        "percentPassed": "75%",
        "teachingScore": "+1",
        "goalClearnessScore": "-27",
        "assessmentScore": "+52",
        "workloadScore": "+6",
        "importanceScore": "+83",
        "satisfactionScore": "+6",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTN01",
        "name": "Realtidssystem",
        "points": "10.0",
        "year": "15/16",
        "registered": "63",
        "percentPassed": "83%",
        "teachingScore": "+53",
        "goalClearnessScore": "+35",
        "assessmentScore": "+69",
        "workloadScore": "+28",
        "importanceScore": "+69",
        "satisfactionScore": "+64",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "BMEN01",
        "name": "Medicinsk signalbehandling",
        "points": "7.5",
        "year": "15/16",
        "registered": "43",
        "percentPassed": "79%",
        "teachingScore": "+25",
        "goalClearnessScore": "-9",
        "assessmentScore": "+29",
        "workloadScore": "-10",
        "importanceScore": "+62",
        "satisfactionScore": "+31",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIF10",
        "name": "Signalbehandling - design och implementering",
        "points": "7.5",
        "year": "15/16",
        "registered": "41",
        "percentPassed": "61%",
        "teachingScore": "+30",
        "goalClearnessScore": "+23",
        "assessmentScore": "+47",
        "workloadScore": "+38",
        "importanceScore": "+50",
        "satisfactionScore": "+25",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTA10",
        "name": "Introduktion till Kinas samhällsliv, kultur och språk",
        "points": "3.0",
        "year": "15/16",
        "registered": "25",
        "percentPassed": "76%",
        "teachingScore": "+4",
        "goalClearnessScore": "-28",
        "assessmentScore": "+8",
        "workloadScore": "+47",
        "importanceScore": "+20",
        "satisfactionScore": "+10",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTA35",
        "name": "Introduktionskurs i kinesiska för civilingenjörer",
        "points": "15.0",
        "year": "15/16",
        "registered": "18",
        "percentPassed": "94%",
        "teachingScore": "+33",
        "goalClearnessScore": "+25",
        "assessmentScore": "+38",
        "workloadScore": "+38",
        "importanceScore": "+50",
        "satisfactionScore": "+50",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTF60",
        "name": "Introduktionskurs i kinesiska för civilingenjörer, del 2",
        "points": "15.0",
        "year": "15/16",
        "registered": "13",
        "percentPassed": "100%",
        "teachingScore": "-46",
        "goalClearnessScore": "-42",
        "assessmentScore": "+13",
        "workloadScore": "+25",
        "importanceScore": "+67",
        "satisfactionScore": "-33",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMNN25",
        "name": "Avancerad kurs i numeriska algoritmer med Python/SciPy",
        "points": "7.5",
        "year": "15/16",
        "registered": "38",
        "percentPassed": "97%",
        "teachingScore": "+52",
        "goalClearnessScore": "+19",
        "assessmentScore": "+81",
        "workloadScore": "+26",
        "importanceScore": "+83",
        "satisfactionScore": "+63",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIF05",
        "name": "Grundläggande radioteknik",
        "points": "7.5",
        "year": "15/16",
        "registered": "38",
        "percentPassed": "87%",
        "teachingScore": "+42",
        "goalClearnessScore": "+35",
        "assessmentScore": "+23",
        "workloadScore": "+25",
        "importanceScore": "+50",
        "satisfactionScore": "+46",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MMKF15",
        "name": "Tillämpad Robotteknik",
        "points": "7.5",
        "year": "15/16",
        "registered": "50",
        "percentPassed": "92%",
        "teachingScore": "+12",
        "goalClearnessScore": "-41",
        "assessmentScore": "+47",
        "workloadScore": "+3",
        "importanceScore": "+38",
        "satisfactionScore": "0",
        "comments": "Studierådets kommentarerKursen lyfts fram som rolig och intressant och föreläsaren får mycket beröm för sitt engagemang och sin pedagogiska förmåga. Kursansvariga har mycket att jobba på, särskilt när det gäller organisation och strukturering av övningar och projekt. Det upplevs som att det finns för få övningsledare, även om de som finns är väldigt bra.Det studenterna helst vill ha ändrat är tydligheten i vad som skall göras och när det skall göras, särskilt då assignment 1. På projektet vill studenterna ha mer tid och tydligare instruktioner om vad som skall presenteras och lämnas in.Kursansvariga är medvetna om problemen i kursen och vill ta till sig åsikterna från CEQ-utvärderingen. Till nästa kursomgång kommer till exempel projektet introduceras tidigare.Kurslärarens kommentererWe appreciate the student's feedback and constructive suggestions and will for next year introduce the course project already from the beginning of the course and support some of the lectures with more exercises to get more practice of the corresponding topics for everyone (the variety and character of projects to choose from was very much appreciated but will naturally put focus on different parts of the lectured material among the groups and not everyone will cover/in depth apply the same theory).We agree with the importance of clarity in information, communication and planning from the very beginning of the course.Sign-up lists for the computer exercises and the hands-on labs, will be introduced to better match the teaching staff and the large enrolment of students and to decrease the experienced bottlenecks. The computers in some of the scheduled rooms were unfortunately not up standard for the required software and we will investigate this matter for next year. We are very glad to read all the positive and appreciative comments on the relevance of the course, especially the lab exercises and project work and the possibility with the hands-on experiences.  Despite the late start of the projects it is impressive to see the dedicated work and all the enthusiasm put into the projects.Programledarens kommentarerKursen är uppskattad och speciellt kommenteras projekten och upplägget med hemtentamen i positiva ordalag. Informationen till studenterna kring kursupplägg, projekt och examination som ges under kursens gång kommer att ses över inför nästa år och mindre övningsgrupper kommer att eftersträvas.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN15",
        "name": "Olinjära dynamiska system",
        "points": "7.5",
        "year": "15/16",
        "registered": "20",
        "percentPassed": "70%",
        "comments": ""
      },
      {
        "code": "GEMA25",
        "name": "Tyska för tekniker",
        "points": "7.5",
        "year": "15/16",
        "registered": "19",
        "percentPassed": "84%",
        "teachingScore": "+50",
        "goalClearnessScore": "+54",
        "assessmentScore": "+36",
        "workloadScore": "+69",
        "importanceScore": "+61",
        "satisfactionScore": "+72",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "GEMA70",
        "name": "Japanska för tekniker",
        "points": "15.0",
        "year": "15/16",
        "registered": "9",
        "percentPassed": "78%",
        "comments": ""
      },
      {
        "code": "FMAN30",
        "name": "Medicinsk bildanalys",
        "points": "7.5",
        "year": "15/16",
        "registered": "45",
        "percentPassed": "80%",
        "teachingScore": "+14",
        "goalClearnessScore": "-3",
        "assessmentScore": "+73",
        "workloadScore": "-1",
        "importanceScore": "+69",
        "satisfactionScore": "+44",
        "comments": "KommentarerStudierådets kommentarerKursinnehållet har fått positiv kritik från studenterna och många upplever upplägget med inlämningar och muntlig tentamen som en väl vald examinationsform. Just inlämningsuppgifterna anser många vara bra, de anges ha intressanta ämnen som är relevanta även utanför kursens ramar och vara utvecklande och lärorika. Något som behöver förbättras är instruktionerna till dessa då många anger att de varit otydliga och svåra att tolka. Snabbare och mer informativ rättning av inlämningsuppgifterna efterfrågas av nästan alla som fyllt i enkäten. Fler övningsledare och fler övningstillfällen efterfrågas också. Föreläsaren har fått positiv kritik av studenterna.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursansvarig har inte kallat till CEQ-möteCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTN05",
        "name": "Olinjär reglering och servosystem",
        "points": "7.5",
        "year": "15/16",
        "registered": "68",
        "percentPassed": "62%",
        "teachingScore": "+25",
        "goalClearnessScore": "+22",
        "assessmentScore": "+48",
        "workloadScore": "+1",
        "importanceScore": "+81",
        "satisfactionScore": "+45",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMNN05",
        "name": "Simuleringsverktyg",
        "points": "7.5",
        "year": "15/16",
        "registered": "28",
        "percentPassed": "93%",
        "teachingScore": "+27",
        "goalClearnessScore": "+8",
        "assessmentScore": "+75",
        "workloadScore": "+18",
        "importanceScore": "+68",
        "satisfactionScore": "+36",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMF15",
        "name": "Arbetsorganisation och ledarskap",
        "points": "6.0",
        "year": "15/16",
        "registered": "25",
        "percentPassed": "88%",
        "teachingScore": "+18",
        "goalClearnessScore": "-10",
        "assessmentScore": "-23",
        "workloadScore": "+39",
        "importanceScore": "+41",
        "satisfactionScore": "+32",
        "comments": "KommentarerStudierådets kommentarerDet bästa med kursen\u0095\tGästföreläsningarna har uppskattats mycket och verkar, enligt många, vara det bästa med kursen\u0095\tEngagemanget hos de flesta föreläsarna\u0095\tMikael Blomé verkar ha uppskattats speciellt. Ett citat från en elevkommentar är: \u0094 En väldigt entusiastisk lärare som hjälpte studenterna när det blev oklarheter\u0094\u0095\tNär föreläsaren använder sig av verkliga exempel man verkligen känner igen sig i\u0095\tGrupparbetet\u0095\tStudenternas och lärarnas goda samarbeteVad som främst behöver förbättras med kursen\u0095\tLärarnas förmåga att svara på mail och kommunikationen mellan lärare och elever kan förbättras, speciellt när det kommer till att svara på frågor angående tentor eller kursmaterial. Problem verkar ha uppstått med fel kursmaterial på hemsidan och funderingar kring instuderingsfrågor som inte blev besvarade. \u0095\tVissa instuderingsfrågor var svåra att hitta, exempelvis frågan om strukturkapital som förekom på tentan\u0095\tTydligare struktur och deadlines, svårt att veta när saker och ting skulle lämnas in\u0095\tCaseövningar utöver föreläsningar efterfrågas\u0095\tDuggans poängsättning ifrågasattes\u0095\tEn för stor del av kursen handlar om att lära sig utantillkunskap. Kursen behöver inte bli mer omfattande men betydligt djupare\u0095\tReflektionerna på 200 ord borde följas upp. Efter att texten är skriven borde det finnas någon form av diskussionKurslärarens kommentererKursen fungerar väl och är relevant med hänsyn till innehåll och pedagogiskt upplägg vilket framgått i diskussion med studenter och ur CEQ-rapporten.Examinationen upplevs enligt CEQ inte som förståelseinriktad i högre utsträckning. Här finns två omständigheter kan förklara CEQ-svaren dels att duggan är en del av examinationen och bygger på att lära sig begrepp, dels att projektarbetet inte beaktas då studenterna svarar på frågan om examination. Detta ska studenterna uppmärksammas på och CEQ-enkäten ska därför kompletteras med frågor kring detta inför 2017. Däremot upplever studenterna en otydlighet i krav och förväntningar vilket å ena sidan är något förvånande med tanke på väl beskrivna mallar och instruktioner. Å andra sidan rymmer kursen många moment vilket gör kursen komplex. Inför 2017 blir det färre antal moment som istället görs mer djupgående. Detta bör öka tydligheten och samtidigt innebära en fördjupning av ämnet. En till två veckor in i kursen kommer det att göras en enkätbaserad utvärdering bland studenterna avseende tydlighet i kursen.Programledarens kommentarerKursansvarig liksom gästföreläsarna får fina vitsord från studenterna. Dock efterfrågas, liksom de senaste åren, en ökad tydlighet vad gäller instruktioner kring uppgifter och en tydligare kursstruktur. Detta bör kursansvariga arbeta med för att lyfta kursen ytterligare.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN10",
        "name": "Kanalmodellering för trådlös kommunikation",
        "points": "7.5",
        "year": "15/16",
        "registered": "22",
        "percentPassed": "64%",
        "comments": ""
      },
      {
        "code": "ETIA10",
        "name": "Patent och annan immaterialrätt",
        "points": "7.5",
        "year": "15/16",
        "registered": "64",
        "percentPassed": "83%",
        "teachingScore": "+55",
        "goalClearnessScore": "+51",
        "assessmentScore": "+23",
        "workloadScore": "+70",
        "importanceScore": "+63",
        "satisfactionScore": "+73",
        "comments": "Studierådets kommentarerMycket positiva kommentarer på kursen och föreläsaren. Svårighetsgraden på tentan upplevdes som låg.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerDenna för F nya kurs är mycket uppskattad, men det går inte att utläsa av CEQ specifikt vad de fåtaliga F:arna tyckte om den. Innehållet upplevs som mycket intressant och relevant för utbildningen. Tentamen upplevdes som enkel.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSN35",
        "name": "Stationär och icke-stationär spektralanalys",
        "points": "7.5",
        "year": "15/16",
        "registered": "23",
        "percentPassed": "74%",
        "comments": ""
      },
      {
        "code": "GEMA01",
        "name": "Franska för tekniker: språk, kultur och samhällsliv, grundkurs",
        "points": "7.5",
        "year": "15/16",
        "registered": "9",
        "percentPassed": "56%",
        "comments": ""
      },
      {
        "code": "GEMA65",
        "name": "Kinesiska för tekniker",
        "points": "7.5",
        "year": "15/16",
        "registered": "8",
        "percentPassed": "63%",
        "comments": ""
      },
      {
        "code": "GEMA55",
        "name": "Medicin för tekniker",
        "points": "6.0",
        "year": "15/16",
        "registered": "16",
        "percentPassed": "75%",
        "comments": ""
      },
      {
        "code": "EIEN01",
        "name": "Mekatronik, industriell produktframtagning",
        "points": "10.0",
        "year": "15/16",
        "registered": "21",
        "percentPassed": "90%",
        "comments": ""
      },
      {
        "code": "EITA05",
        "name": "Teknikhistoria",
        "points": "4.5",
        "year": "15/16",
        "registered": "80",
        "percentPassed": "79%",
        "teachingScore": "-5",
        "goalClearnessScore": "+29",
        "assessmentScore": "+35",
        "workloadScore": "+69",
        "importanceScore": "+5",
        "satisfactionScore": "+38",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN25",
        "name": "Variationskalkyl",
        "points": "7.5",
        "year": "15/16",
        "registered": "19",
        "percentPassed": "47%",
        "comments": ""
      },
      {
        "code": "FMSN30",
        "name": "Linjär och logistisk regression",
        "points": "7.5",
        "year": "15/16",
        "registered": "11",
        "percentPassed": "73%",
        "comments": ""
      },
      {
        "code": "EEMN01",
        "name": "Mikrosensorer",
        "points": "7.5",
        "year": "15/16",
        "registered": "11",
        "percentPassed": "73%",
        "comments": ""
      },
      {
        "code": "FRTN30",
        "name": "Nätverksdynamik",
        "points": "7.5",
        "year": "15/16",
        "registered": "40",
        "percentPassed": "68%",
        "teachingScore": "+32",
        "goalClearnessScore": "+11",
        "assessmentScore": "+69",
        "workloadScore": "-4",
        "importanceScore": "+42",
        "satisfactionScore": "+68",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN15",
        "name": "Radiosystem",
        "points": "7.5",
        "year": "15/16",
        "registered": "24",
        "percentPassed": "50%",
        "comments": ""
      },
      {
        "code": "ETTN15",
        "name": "Moderna trådlösa system - LTE och dess efterföljare",
        "points": "7.5",
        "year": "15/16",
        "registered": "28",
        "percentPassed": "68%",
        "teachingScore": "+42",
        "goalClearnessScore": "+51",
        "assessmentScore": "+36",
        "workloadScore": "-9",
        "importanceScore": "+65",
        "satisfactionScore": "+65",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN10",
        "name": "Multipelantennsystem",
        "points": "7.5",
        "year": "15/16",
        "registered": "25",
        "percentPassed": "68%",
        "comments": ""
      },
      {
        "code": "EEMN10",
        "name": "Datorbaserade mätsystem",
        "points": "7.5",
        "year": "15/16",
        "registered": "19",
        "percentPassed": "84%",
        "comments": ""
      },
      {
        "code": "EEMN05",
        "name": "EMC, störningar och störningsbegränsning",
        "points": "7.5",
        "year": "15/16",
        "registered": "28",
        "percentPassed": "93%",
        "teachingScore": "+90",
        "goalClearnessScore": "+78",
        "assessmentScore": "+71",
        "workloadScore": "+56",
        "importanceScore": "+100",
        "satisfactionScore": "+100",
        "comments": "Kommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EEMF05",
        "name": "Medicinsk mätteknik",
        "points": "7.5",
        "year": "15/16",
        "registered": "6",
        "percentPassed": "83%",
        "comments": ""
      },
      {
        "code": "EEMN15",
        "name": "Ultraljudsfysik och teknik",
        "points": "7.5",
        "year": "15/16",
        "registered": "13",
        "percentPassed": "92%",
        "teachingScore": "+36",
        "goalClearnessScore": "+36",
        "assessmentScore": "+23",
        "workloadScore": "+21",
        "importanceScore": "+63",
        "satisfactionScore": "+71",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iDenna uppgift har ej fyllts i."
      }
    ]
  }
}