{
  "C": {
    "Årskurs 1 (obligatoriska kurser)": [
      {
        "code": "EITA55",
        "name": "Kommunikationssystem",
        "points": "7.5",
        "year": "17/18",
        "registered": "47",
        "percentPassed": "60%",
        "teachingScore": "+2",
        "goalClearnessScore": "-23",
        "assessmentScore": "+20",
        "workloadScore": "+0",
        "importanceScore": "+76",
        "satisfactionScore": "+6",
        "comments": "KommentarerStudierådets kommentarerStudenterna ansåg att kursen kändes problematisk p.g.a. problem med kurshemsidan där det stod felaktig information angående datum samt uppgifter. Studenterna ansåg även att tentan var svårare i år än tidigare.Kurslärarens kommentererDen negativa trenden vad avser tentaresultatet har brutits. Detta är desto mer positivt då jag själv tycker att tentan var något svårare än tidigare år.Det var förvånande att se att alla staplar i sammanfattningfiguren blivit så negativa. Mötet kom dock överens om att det troligen beror på den mindre tydliga informationen och felaktigheterna på webbsidan. Ännu mer förvånande att inget om dessa problem meddelades kusrledning under kursen, när problemet kunde rättas till.Synkronisering mellan kursledning/lärare och labbhandledare behöver ses över.Programledarens kommentarerKursen fick sämre omdöme mot tidigare år utan någon egentlig kursförändring. Största missnöjet tycks ha orsakats av att informationen på kurshemsidan inte presenterades tydligt - vilket ska fixas till nästa år. I övrigt uppskattas både lärare, projekt, labbar och övningar.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAA05",
        "name": "Endimensionell analys",
        "points": "15.0",
        "year": "17/18",
        "registered": "43",
        "percentPassed": "23%",
        "teachingScore": "-7",
        "goalClearnessScore": "+30",
        "assessmentScore": "+59",
        "workloadScore": "-26",
        "importanceScore": "+60",
        "satisfactionScore": "+17",
        "comments": "KommentarerStudierådets kommentarerKursen har bra innehåll och är viktig men många studenter uppfattar den som utmanande. Arbetsbelastningen är för många hög och det är bland annat därför den uppfattas som extra svår. Ett stort problem är att det är få studenter på övningarna och det räknas för lite utanför dessa. Många hamnar efter i övningarna och tycker därför inte föreläsningarna ger någonting eftersom de har hunnit förstå tidigare avsnitt. Ett annat problem som vi diskuterade på mötet är att studenterna skräms upp i början genom att kursen sägs vara riktigt svår och ger därför nästan upp när de fastnar. Ett förslag är att LTH istället borde betona att det krävs mycket jobb för att klara den, men att det inte är en omöjlighet. Vi är även positiva till förslaget till nya typer av övningar eftersom det troligen skulle få fler att vilja ligga i fas och räkna mer.Kurslärarens kommentererPå mötet framfördes önskemål om att skriva mer fullständiga lösningar på tavlan, samt att ha ett par övningar för varje kursavsnitt som tydligare belyser de typiska svårigheterna och metoderna för just detta avsnitt. För föreläsaren tycks det som om det svårare materialet måste komma något tidigare i kursen för att bättre kunna smältas av studenterna. Detta höll studenterna med om. Till exempel så kommer gränsvärden och derivator att läggas tidigare i kursen eftersom de utgör en såpass viktig del av kursen.Programledarens kommentarerSkrivningsresultaten var något bättre än föregående år. En jämförelse med betygsfördelningen från förra kursomgången antyder dock att denna tentan var lättare.Studenterna uppfattar kursen som svår och arbetskrävande. Det tidiga studentbortfallet från övningarna diskuterades men fick ingen ordentlig förklaring eller \"lösning\".Tempoväxlingen efter fyra föreläsningar kanske bidrar.Det diskuterades att direkt börja med gränsvärdesbegreppet i stället för gymnasierepetition, som en rivstart.Glädjande inför nästa år är att Uppsalamodellen kommer att införas till fullo, inklusive bonuspoäng till tentan på redovisningsuppgifterna. Både PL och KL har arbetat för detta, så det ska bli intressant att se hur bra det tas emot av studenterna och hur utfallet blir.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTA65",
        "name": "Kognition",
        "points": "4.5",
        "year": "17/18",
        "registered": "48",
        "percentPassed": "92%",
        "teachingScore": "+12",
        "goalClearnessScore": "+4",
        "assessmentScore": "+44",
        "workloadScore": "+53",
        "importanceScore": "+44",
        "satisfactionScore": "+29",
        "comments": "KommentarerStudierådets kommentarerOklart hur labbarna passade in i kursen. Att öva på att skriva rapport var dock relevant och bra att man fick mycket feedback på den, det hjälpte inför slutinlämningen.Överväga att använda sig av konceptet \"flipped classroom\" på labbarna.Gästföreläsningarna gav inte särskilt mycket, lite onödig information och vissa kändes väldigt \"daterade\".För dålig information inför deluppgift 2, svårt att dra kopplingarna som behövdes för att klara den uppgiften helt och hållet.För långsamt tempo på föreläsningarna.Kurslärarens kommentererJag vill tacka för mycket användbar feedback på kursutvärderingarna. Kursen har precis bytt plats i utbildningssystemet och min läsning av kursutvärderingarna är att vi inte helt hittat rätt i våra förändringar av kursen - på vissa ställen har vi gjort det för lätt och på andra har vi inte förklarat och motiverat kursinnehållet tillräckligt väl. Detta ska åtgärdas till nästa kursomgång. Samtidigt har vi fått positiva kommentarer om att kursen var rolig att läsa och att den kändes relevant och det tackar vi så mycket för.Programledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 2 (obligatoriska kurser)": [
      {
        "code": "FMAB30",
        "name": "Flerdimensionell analys",
        "points": "6.0",
        "year": "17/18",
        "registered": "38",
        "percentPassed": "37%",
        "teachingScore": "+48",
        "goalClearnessScore": "+62",
        "assessmentScore": "+40",
        "workloadScore": "+19",
        "importanceScore": "+69",
        "satisfactionScore": "+65",
        "comments": "Studierådets kommentarerKursen var väl genomförd och de enda potentiella förändringarna är småsaker. Kursen får gärna fortsätta i samma stil som detta år.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen fungerar bra och KL uppskattas mycket.KL lade stor vikt vid att alla studenter skulle få förståelse för kursmaterialet. Detta uppskattades mycket av C- och D-studenterna, medan BME-studenterna ofta tyckte att \"det var för lätt\" och ville ha mer utmaningar. Djupare analys av denna diskrepans ligger utanför CEQ-mötets ramar, men då BME generellt är starkare i matematik så är detta kanske inte förvånande. Fördelningen för CEQ-poäng skilde sig av denna anledning (PLs tolkning) kraftigt mellan de olika programmen - märktes särskilt på \"god undervisning\".KLs just-in-time-test uppskattades väldigt mycket av studenterna, och detta upplägg drar åt hållet kontinuerlig examination. Studenterna får under kursens gång veta hur de ligger till. I samband med detta diskuterades även om det skulle vara möjligt och meningsfullt att använda sig av kontinuerliga och självrättande Moodle-test enligt liknande princip.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSF05",
        "name": "Internetprotokoll",
        "points": "9.0",
        "year": "17/18",
        "registered": "42",
        "percentPassed": "95%",
        "teachingScore": "-44",
        "goalClearnessScore": "-38",
        "assessmentScore": "+32",
        "workloadScore": "-52",
        "importanceScore": "+50",
        "satisfactionScore": "-46",
        "comments": "KommentarerStudierådets kommentarerDet som vi kom fram på mötet var att kursen kommer få en ny kursansvarig till hösten och förhoppningsvis kommer upplägget av bland annat projekten göras om och vara mer tydligare för studenterna. Routerlabben var oftast svår att förstå och informationen för samma labb fanns på flera ställen, vilket var förvirrande för studenterna. Detta skulle förbättras genom att försöka få allt information på samma sida.Quizen skulle de också fortsätta med eftersom det var en bra möjlighet för studenterna att lära sig mer.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerNärvarande på CEQ-mötet var PL, KL samt representanter för SRD. Vi diskuterade främst organiseringen av kursen, att studenterna upplevde det som lite rörigt med tre lärare som var involverade i kursen. Nästa år kommer kursen att byta kursansvarig och han kommer antagligen att göra om kursen en del.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA01",
        "name": "Programmeringsteknik - fördjupningskurs",
        "points": "7.5",
        "year": "17/18",
        "registered": "35",
        "percentPassed": "51%",
        "teachingScore": "+33",
        "goalClearnessScore": "+45",
        "assessmentScore": "+61",
        "workloadScore": "+11",
        "importanceScore": "+88",
        "satisfactionScore": "+63",
        "comments": "Studierådets kommentarerUnder kursens gång har föreläsningarna varit givande och båda föreläsarna har visat på stort engagemang och kunskap. Vi studenter har uppskattat att de har visat förståelse för vad vi har tyckt varit svårt och verkligen försökt att reda ut det för oss.Att ge möjlighet till fredags-frågestunden och även öppna kontorstider är bland det bästa! Det minskar även stress för studenterna då vi vet att det finns extra hjälp att få. Gällande föreläsningarna, hade det varit uppskattat om vi studenter hade fått vara mer aktiva och låta studenterna \"tänka själva\" och på annat sätt skapa mer diskussion mellan studenterna. Labbarna fungerade väl och det gjorde även projektet. Studenterna uppskattade under projektet att få välja mellan olika alternativ och att skapa ett program \"from scratch\". Här var de öppna-kontorstiderna toppenbra.Kurslärarens kommentererDet är glädjande att så många är nöjda med kursen och finner den relevant för sin utbildning.Under läsåret 2017/2018 har vi sett över ordningen på kursinnehållet samt uppdaterat labbarna. Om tid finns inför nästa läsår ska övningsuppgifterna ses över. Ev kommer en del av dessa att läggas in på moodle och kunna lösas direkt på dator. Övningsuppgifterna är viktiga. Det räcker inte med att göra labbarna, man måste också göra övningsuppgifterna för att träna på alla kurmoment. På CEQ-mötet diskuterade vi debugging. Det är viktigt att studenterna kan det inför senare kurser. Vi planerar att repetera debugging på föreläsningarna och att lägga in en debugging-uppgift på någon av labbarna.Programledarens kommentarerKursen verkar fungera mycket bra och lärarna uppskattas av studenterna.C och E samläste.En möjlig förbättringspunkt diskuterades, inspirerad av en studentkommentar i CEQ-enkäten, att lägga in fler \"mindre frågor\" i labbarna för att bättre knyta praktiken till teorin.Låg svarsfrekvens på CEQ, inte så många fritextsvar.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMA15",
        "name": "Interaktionsdesign, grundkurs",
        "points": "7.5",
        "year": "17/18",
        "registered": "38",
        "percentPassed": "92%",
        "teachingScore": "+46",
        "goalClearnessScore": "+18",
        "assessmentScore": "+19",
        "workloadScore": "+28",
        "importanceScore": "+56",
        "satisfactionScore": "+50",
        "comments": "Studierådets kommentarerPå mötet togs det upp att det var otydligt med vad rapporterna skulle innehålla samt att feedback på inlämningar gärna får vara mer specifik för de grupper som behöver det. Kursen har varit bra, mycket inlämningar och mycket att göra men allt som har gjorts har varit relevant för duggor/tenta vilket uppskattas mycket av studenterna. Kursansvariga har angett att de kommer förbättra instruktioner till rapporten samt meddela handledare att ge konkret feedback till grupper ifall det behövs.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen har moderniserats, nu görs inlämningar med jämna mellanrum för att sprida ut arbetsbelastningen jämnare över kursen. Dessutom läggs en dugga tidigt så att studenterna tvingas till att läsa teorin tidigt i kursen. Studenterna är nöjda med omläggningen, som verkar fungera mycket bra. Mindre förbättringar diskuterades, men inga större omstruktureringar planeras inför nästa kursomgång.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 3 (obligatoriska kurser)": [
      {
        "code": "EITG05",
        "name": "Digital kommunikation",
        "points": "7.5",
        "year": "17/18",
        "registered": "86",
        "percentPassed": "62%",
        "teachingScore": "-3",
        "goalClearnessScore": "+12",
        "assessmentScore": "+49",
        "workloadScore": "+5",
        "importanceScore": "+33",
        "satisfactionScore": "+11",
        "comments": "KommentarerStudierådets kommentarerLaborationen var bra och gav förståelse. Kursen kan förbättras med fler praktiska exempel. Studenterna ansåg att förslaget om att justera föreläsningarnas ordning kan vara bra.Kurslärarens kommentererThis is the first year in which I was giving this course, and I have mostly taken over the content and structure from the previous teacher. Looking at the overall results of the exam, I am quite satisfied. Some students remarked in the evaluation that the questions were very different from the previous years, but the majority was able to adapt well and demonstrate a solid understanding of the material.The students like the laboratories and exercise lessons very much, but would like to have more examples in the lectures to make them more interesting. Unfortunately, we do not have resources for more laboratory hours, but I plan to split the lab into two sessions so that the first one can take place earlier. I am also thinking about including more Matlab examples in the lecture and creating some online quizzes that make the material more accessible.Programledarens kommentarerKursen fungerar bra och lärarna är uppskattade.Det efterlystes att synka övningsledarna så att alla först skulle köra genomgång av teorin innan man gick över till problemlösning - övningarna fick en hel del ros för att de hjälpte till att bygga upp förståelse.Tentamen var lite annorlunda mot tidigare år, vilket störde många studenter. Samtidigt konstaterades att uppgifterna på tentan täcktes väl av kursen. Till nästa år finns en ny extenta att titta på, vilket troligen minskar shockfaktorn något. Helheltsmässigt bedöms \"nya\" tentamen bättre spegla det som bör vara studenternas målbild.Att läraren tog upp konkreta exempel uppskattades, gärna fler sådana till nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF60",
        "name": "Objektorienterad modellering och design",
        "points": "4.5",
        "year": "17/18",
        "registered": "21",
        "percentPassed": "71%",
        "teachingScore": "+76",
        "goalClearnessScore": "+50",
        "assessmentScore": "+73",
        "workloadScore": "+10",
        "importanceScore": "+93",
        "satisfactionScore": "+71",
        "comments": "Studierådets kommentarerDet är en väldigt uppskattad kurs med få klagomål. Att flytta det andra projektet lite så folk hinner förbereda sig hade uppskattats. Att blanda C:are och D:are i projektgrupperna kan också vara bra.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerNärvarande på CEQ-mötet var representanter från SRD, KL och PL. Kursen anses som bra och viktig för utbildningen. Det var en del diskussion kring styrningen av projektet, bland annat hur gruppindelningen görs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF05",
        "name": "Webbsäkerhet",
        "points": "4.0",
        "year": "17/18",
        "registered": "81",
        "percentPassed": "91%",
        "teachingScore": "+49",
        "goalClearnessScore": "+53",
        "assessmentScore": "+46",
        "workloadScore": "+27",
        "importanceScore": "+79",
        "satisfactionScore": "+71",
        "comments": "KommentarerStudierådets kommentarerDe flesta gillade kursen. Det som kan förbättras var att kunna komma åt XAMPP utan egen dator/laptop. Studenterna upplevde att det var hög arbetsbelastning på projektet och att det borde läggas högskolepoäng på projeket och även eventuellt öka högskolepoängen för hela kursen. Kunde gå igenom mer på övningarna. Föreläsaren var väldigt uppskattad.Kurslärarens kommentererKursen fungerar bra, men några förbättringar diskuterades. Justeringar i tiden mellan två försök på online-tentamen, kan komma att utökas till två timmar. För projekten ska kommande peer-review ordnas så att högst tre grupper reviewar samtidigt. Kursen upplevs som tung i förhållande till antalet poäng den ger.Programledarens kommentarerNärvarande på CEQ-mötet var representant för SRD, KL samt PL. Studenterna är nöjda med kursen och den anses viktig för utbildningen. Det var en del diskussion kring projektet men annars uppplevs kursen som bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSF25",
        "name": "Affärsdriven programvaruutveckling",
        "points": "7.5",
        "year": "17/18",
        "registered": "32",
        "percentPassed": "97%",
        "teachingScore": "-19",
        "goalClearnessScore": "-36",
        "assessmentScore": "+53",
        "workloadScore": "+14",
        "importanceScore": "+23",
        "satisfactionScore": "-23",
        "comments": "KommentarerStudierådets kommentarerSeminarierna var bra och ändringen för att göra de obligatoriska tror vi är en god tanke. Kvaliten på peer review var väldigt olika och tyvärr var många dåliga, om något kan göras för att förbättra detta så vore det väldigt bra - exempelvis om kursansvarig berättar att dom kommer ta stickprov och kan underkännas. Största problemet många upplevde under kursen var kommunikationen. Instruktioner var utspridda och det behövdes skickas många mail med tillägg. Det vore bättre om informationen var samlad i ett (eller litet antal) dokument i högsta möjliga mån, och att informationen från mail hamnar i dessa dokument. Gästföreläsningarna var väldigt bra.Kurslärarens kommentererThis was the first instance of this new course. The examination was based on two students assignments; a project (in groups of 6) and an individual (or pair) essay assignment. The course material was covered by lectures (by course admin and by guest lecturers) and by seminars where literature was discussed and aspects of the assignments covered. The students received feedback on their assignments through peer-review guided by teacher-designed assessment criteria and by direct teacher feedback on one draft of the project report.The assignment descriptions were gradually explained throughout the course and the information was distributed over multiple sources (description doc, grading grid, seminar material, emails and lecture slides). This will be improved and one main source of information will be provided for each assignment. This source will then be referred to when presenting and explaining the assignments (e.g. at lectures, or in emails) to highlight that the information is not new. I will also consider merging the course web page with moodle to provide one information platform for the course.For some of the course content, the purpose and content of these need to be improved and covered in one of the first lectures. In particular, this applies to software project management (SPM), peer-reviewed literature and reading of scientific literature. For SPM, this includes clarifying its relationship to business plans and models (to provide an intial cost evaluation and plan for developing the software product) and how the examination of this part is done within the project assignment. This also relates to the course book which covers this topic. The book provides a good overview of SPM and this topic is covered by 3 of the lectures. I will consider if it is possible to provide an extract in the compendium but it is likely that more than the allowed max 15 pages are required (due to copyright laws). The seminars mainly worked well and were appreciated by the students, but can still be further improved. For example, by focusing more on the connected assignments. If possible, it would be desirable to decrease the sizes of the classes to allow for more discussions and teacher feedback. I am also considering letting one teaching assistant manage the seminars related to the project assignment, and one the seminars related to the essay assignment.Currently the two assignments are interleaven during the course with hand-ins for each assignment every other week. Since the students find that this causes an overhead in context switching between the two assignments I will consider if it is possible to initally focus on the project assignment and introduce the essay assignment later on. The drawback of this option is that the lead time for each assignment will be decreased, reducing the time for the topics / assignment to mature.Programledarens kommentarerKursen har något lägre CEQ-betyg i år och flera förbättringspunkter diskuterades. Den primära rörde informationspaketering. Studenterna upplevde kursinformation som rörig, att de inte sällan fick samma eller olika information från olika källor eller i olika dokument på kurshemsidan. Majoriteten av fritextkommentarerna berörde detta, och SRD uttalade en stark önskan att detta fixas till nästa kursomgång.Seminarierna var uppskattade och kändes särskilt relevanta.Boken diskuterades också. Några studenter tyckte att boken är relativt dyr och att den inte används i så stor (tillräckligt stor?) utsträckning.Flera studenter reagerade på att anmälan till projektgrupper stänger före första kurstillfället. KL argumenterade att detta görs i andra kurser och att det behövs för att få igång projekten snabbare.Sammanvägning av betygen från de två projekten berördes också.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTF05",
        "name": "Reglerteknik, allmän kurs",
        "points": "7.5",
        "year": "17/18",
        "registered": "32",
        "percentPassed": "69%",
        "teachingScore": "+35",
        "goalClearnessScore": "+46",
        "assessmentScore": "+42",
        "workloadScore": "+44",
        "importanceScore": "+17",
        "satisfactionScore": "+67",
        "comments": "Det är roligt att kursen uppskattas av så många. CEQ-mötet gav intressanta uppslag till förbättringar av övningar och laborationer som vi kommer att diskutera. Bland annat verkar det finnas ett intresse för någon form av seminarieövning i kursen.Programledarens kommentarerPå mötet deltog flera studentrepresentanter, KL samt PL. Kursen är väldigt omtyckt bland studenterna och diskussionen rörde främst en del organisation av laborationer och övningar.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering da - Användbarhet och design": [
      {
        "code": "MAMF50",
        "name": "Användbarhetsutvärdering",
        "points": "7.5",
        "year": "17/18",
        "registered": "32",
        "percentPassed": "97%",
        "teachingScore": "+46",
        "goalClearnessScore": "+45",
        "assessmentScore": "+36",
        "workloadScore": "+63",
        "importanceScore": "+77",
        "satisfactionScore": "+75",
        "comments": "Studierådets kommentarerStudenter hade velat kunna göra en större del av projektet tidigare och kände att kursens upplägg inte gjorde detta möjligt. Utöver detta så var kursen väl genomförd.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerPL, kommentar enbart baserad på arbetsrapporten.Kursen uppskattas av studenterna och verkar fungera mycket bra. Några möjliga förbättringspunkter tas upp, men helhetsbilden är mycket positiv.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "17/18",
        "registered": "80",
        "percentPassed": "94%",
        "teachingScore": "-5",
        "goalClearnessScore": "-12",
        "assessmentScore": "+52",
        "workloadScore": "-31",
        "importanceScore": "+75",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerArbetsbelastningen på kursen blev mycket tuffare senare i kursen och det hade varit bra om man kunde flytta fram saker i tiden. Många är missnöjda med hur det sista projektet sköttes och hade velat ha feedback från läraren och inte bara peer-review då andra studenter inte erbjuder samma nivå på feedbacken.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn bra kurs, men informationen och labbhandledningen behöver vara tydligare.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN45",
        "name": "Människa, teknik, organisation och hantering av risker",
        "points": "7.5",
        "year": "17/18",
        "registered": "63",
        "percentPassed": "98%",
        "teachingScore": "+38",
        "goalClearnessScore": "+35",
        "assessmentScore": "+35",
        "workloadScore": "+64",
        "importanceScore": "+57",
        "satisfactionScore": "+43",
        "comments": "KommentarerStudierådets kommentarerKursen har fått relativt höga betyg på CEQ-enkäterna. Bland annat anses kursen relevant för det kommande arbetslivet. Hemtentamen kändes väldigt förståelseinriktad och bra. Projektet var väldigt uppskattat då man fick en inblick i arbetslivet. Genomgången av en extenta som var nytt för i år, var väldigt uppskattat av eleverna då man fick en inblick i hur den kursansvariga tänker när hon rättar tentorna. Opponeringen däremot upplevdes som att studenterna inte riktigt tog på allvar alternativt inte visste hur man skulle förbereda sig. Den kursansvariga sa att det ligger instruktioner om hur opponeringen ska genomföras men att hon kan poängtera ytterligare vad som behövs tänkas på. Kurslitteraturen som blev försenad var ett problem för de som drabbades men är inget den kursansvariga kan styra över då det är tryckeriets ansvar att få ut det i tid. Några studenter skrev att de tyckte att projektet kunde komma igång tidigare och att det kunde vara kortare tid mellan studiebesök 1 och 2. Den kursansvariga svarade att första handledarmötet var redan läsvecka 1 och att det blir svårt att tidigarelägga. Anledningen varför det är cirka 2 veckor mellan studiebesöken är för att studenterna ska kunna förbereda sig väl och sätt sig in i litteraturen innan besök 2. Dessutom ska besöken läggas så att det passar företagen. En annan kritik som togs upp var att olika handledare var olika engagerade i projektarbetet. Detta är svårt att komma ifrån då människor är olika. Den kursansvariga brukar däremot kommunicera med sina handledare om hur de ska förhålla sig till sina studentgrupper. Till nästa år kommer reflektionerna att vara stängda för att motverka att studenterna läser varandras reflektioner istället för att läsa kurslitteraturen.Kurslärarens kommentererKursen upplevs som både relevant och angelägen för studenternas utbildning. Man upplever även projektarbetet med studiebesök i praktisk verksamhet som givande och roligt. Tentamens utformning som hemtenta uppskattas och har fungerat bra. Den lokala rutinen för att anonymisera hemtentan fungerade utan problem. Nytt för i år var två tentamensseminarium där en extenta gicks igenom och diskuterades. Momentet verkar ha fallit ut positivt för studenternas förberedelse inför hemtentan. Några studenter tyckte opponeringstillfället vid projektpresentationerna kan förbättras. Till nästa kursomgång kommer opponeringens fokus att ligga på att ställa diskuterande frågor samt att frågor om formalia och rapportlayout tas bort. Studenternas skriftliga reflektioner kommer inte längre att läggas på ett gemensamt forum för alla att läsa, då det kom kritik om att kopiering förekom.Programledarens kommentarerStudenterna är överlag nöjda med kursen. Många studenter upplevde att hemtentamen var bra och fokuserade på förståelse mer än faktaredovisning. Detta är något som kursansvarig har jobbat med inför kursen. Det var även väldigt uppskattat att kursansvarig gick igenom en tentaövning, vilket var första gången (efter kommentarer från tidigare CEQ). Projektet tyckte studenterna var intressant och givande och man uppskattade konsultationstider och den feedback man fick. Även studiebesöken uppskattades. Studenterna skulle gärna vilja att man på förhand gick igenom hur opponeringen vid redovisningarna kan genomföras och trycka på att det ska vara mer diskussionsfrågor (snarare än att lyfta stavfel osv.). Kursansvarig kommer lägga mer vikt vid detta inför nästa år. Kursansvarig kommer även se över reflektionsuppgifterna inför nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ks - Kommunikationssystem": [
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "17/18",
        "registered": "120",
        "percentPassed": "84%",
        "teachingScore": "+29",
        "goalClearnessScore": "+49",
        "assessmentScore": "+53",
        "workloadScore": "+51",
        "importanceScore": "+75",
        "satisfactionScore": "+63",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen fungerar väl och PL har valt att CEQ-möte hållas i form av mejlkonversation. Inga kommentarer har inkommit.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETTN15",
        "name": "Moderna trådlösa system - LTE och dess efterföljare",
        "points": "7.5",
        "year": "17/18",
        "registered": "8",
        "percentPassed": "100%",
        "teachingScore": "+60",
        "goalClearnessScore": "+36",
        "assessmentScore": "+17",
        "workloadScore": "+19",
        "importanceScore": "+78",
        "satisfactionScore": "+50",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThis was the first time I taught the course and hence I followed the same course plan as the previous teacher. I learned in the process that I can be more focused on the key topics and cover less of the other topics, in order to improve the students' learning experience. The written CEQ feedback also supports such a change. I will also give more opportunities to the students to discuss the short project and raise questions about it. However, in general, I am quite satisfied with the outcome, as is also indicated by the CEQ feedback.CEQ-enkäten fylldes iCEQ forms were completed during the last lecture of the course."
      },
      {
        "code": "EITN10",
        "name": "Multipelantennsystem",
        "points": "7.5",
        "year": "17/18",
        "registered": "23",
        "percentPassed": "43%",
        "comments": ""
      }
    ],
    "Specialisering pv - Programvara": [
      {
        "code": "EDAA25",
        "name": "C-programmering",
        "points": "3.0",
        "year": "17/18",
        "registered": "77",
        "percentPassed": "36%",
        "teachingScore": "-19",
        "goalClearnessScore": "+26",
        "assessmentScore": "+66",
        "workloadScore": "+5",
        "importanceScore": "+64",
        "satisfactionScore": "+33",
        "comments": "KommentarerStudierådets kommentarerMånga studenter upplever att se saknar bra material att jobba med när de studerar, hänvisningar till övningsuppgifter tillsammans med läshänvisningar hade hjälp. Man upplevde även att det var svårt att få hjälp med enklare grejer i samband med inlämningarna då rättningen inte gav bra feedback. En del hade även önskat att det var tydligare i början av kursen att det inte är en grundkurs.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerDetta är en ambitiös kurs mer rätt mycket innehåll. Inför framtiden kan innehållet i större utsträckning anpassas efter kursens storlek då arbetsbördan är hög. I övrigt är kursen bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN65",
        "name": "Kompilatorer",
        "points": "7.5",
        "year": "17/18",
        "registered": "57",
        "percentPassed": "67%",
        "teachingScore": "+38",
        "goalClearnessScore": "+44",
        "assessmentScore": "+70",
        "workloadScore": "-1",
        "importanceScore": "+81",
        "satisfactionScore": "+61",
        "comments": "Kursrepresentantens kommentarerThis challenging course that requires critical thinking and logic is a must for anyone who wants to understand what happens every time they press the \"compile\" button to run their code. Overall, the students are satisfied, and the lengthy assignments are required in order to get a hands-on experience with an actual compiler.Kurslärarens kommentererStudenterna är mycket nöjda med kursen och tycker att den är mycket angelägen för deras utbildning. Några citat: \"Labbarna var väldigt givande.\", \"Bästa kursen på LTH.\"Många tycker att arbetsbelastningen är hög, men inte för hög. De anser att labbarna är mycket lärorika och att det är roligt att de bygger på varandra så att man i slutänden har konstruerat en hel kompilator.Många uppskattar Moodle-quizzarna som repetition på föreläsningarna. De täcker ännu inte hela kursen, men jag har lagt till något fler frågor i år, och planerar att lägga till ytterligare nästa år.På CEQ-mötet diskuterade vi dessutom ett antal detaljfrågor om ytterligare småförbättringar och förtydliganden som jag planerar att införa till nästa år.Programledarens kommentarerEn väl genomförd kurs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN20",
        "name": "Språkteknologi",
        "points": "7.5",
        "year": "17/18",
        "registered": "76",
        "percentPassed": "93%",
        "teachingScore": "+12",
        "goalClearnessScore": "+34",
        "assessmentScore": "+40",
        "workloadScore": "+27",
        "importanceScore": "+69",
        "satisfactionScore": "+29",
        "comments": "Studierådets kommentarerLabbinstruktionerna behöver skrivas om då en stor del av studenterna upplevde att de lade ner många timmar som de inte hade behövt p.g.a. de inte kunde utläsa instruktionerna. Innehållet i kursen var dock mycket uppskattat och många upplevde att labbarna var intressanta när de fått allt att fungera.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Förbättringspotential finns i ökad tydlighet i labbinstruktionerna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF55",
        "name": "Realtidsprogrammering",
        "points": "6.0",
        "year": "17/18",
        "registered": "149",
        "percentPassed": "50%",
        "teachingScore": "-14",
        "goalClearnessScore": "-18",
        "assessmentScore": "+44",
        "workloadScore": "-48",
        "importanceScore": "+68",
        "satisfactionScore": "+11",
        "comments": "KommentarerStudierådets kommentarerKursen är överlag bra. Det som borde ändras till nästa år är en tidigare introduktion till C programmering. Detta så att studenterna är ordentligt förberedda för projektet.Kurslärarens kommentererInstämmer med synpunkterna i allmänhet, och kring projektdelen i synnerhet. En bättre introduktion/hjälp till C-programmering av serverdelen i projektet kommer att göras till nästa år. Detta och andra synpunkter, samt behov av revidering av kursmaterialet, har diskuterats med tillträdande ny kursansvarig för nästa år.Programledarens kommentarerPå mötet deltog KL,PLD samt studentrepresentant för D. Kursen anses väldigt nyttig för utbildningen men arbetsbelastningen i projektet känns för hög eftersom studenterna även måste lära sig programmera i C. Under mötet diskuterades detta och det finns en del konkreta förslag till åtgärder. Kursen kommer även att byta kursansvarig nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN55",
        "name": "Avancerade algoritmer",
        "points": "7.5",
        "year": "17/18",
        "registered": "50",
        "percentPassed": "92%",
        "teachingScore": "+36",
        "goalClearnessScore": "+20",
        "assessmentScore": "+79",
        "workloadScore": "+23",
        "importanceScore": "+59",
        "satisfactionScore": "+69",
        "comments": "Studierådets kommentarerKursen är väldigt uppskattad och många studenter gillar den skarpt. Det enda som eventuellt skulle kunna ändras är att ha mer övningar som förbereder en på den typen av frågor man kommer att få på tentan. Det är väldigt synd att kursen läggs ner och vi hoppas att man kommer att kunna starta upp den igen i framtiden.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen fugenrar bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN26",
        "name": "Multicoreprogrammering",
        "points": "7.5",
        "year": "17/18",
        "registered": "58",
        "percentPassed": "71%",
        "teachingScore": "+47",
        "goalClearnessScore": "+41",
        "assessmentScore": "+54",
        "workloadScore": "+40",
        "importanceScore": "+83",
        "satisfactionScore": "+71",
        "comments": "Studierådets kommentarerAtt få prova på olika språk var väldigt uppskattat hos de flesta studenter. Det finns många olika småsaker som kan förbättras med kursen men i helhet är studenterna nöjda med den.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. En möjligt förbättring är tydliga instruktioner till labbarna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering sec - Säkerhet": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "17/18",
        "registered": "80",
        "percentPassed": "94%",
        "teachingScore": "-5",
        "goalClearnessScore": "-12",
        "assessmentScore": "+52",
        "workloadScore": "-31",
        "importanceScore": "+75",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerArbetsbelastningen på kursen blev mycket tuffare senare i kursen och det hade varit bra om man kunde flytta fram saker i tiden. Många är missnöjda med hur det sista projektet sköttes och hade velat ha feedback från läraren och inte bara peer-review då andra studenter inte erbjuder samma nivå på feedbacken.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn bra kurs, men informationen och labbhandledningen behöver vara tydligare.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF60",
        "name": "Statistiska metoder för säkerhetsanalys",
        "points": "7.5",
        "year": "17/18",
        "registered": "25",
        "percentPassed": "100%",
        "teachingScore": "-60",
        "goalClearnessScore": "-23",
        "assessmentScore": "+15",
        "workloadScore": "+51",
        "importanceScore": "+30",
        "satisfactionScore": "-30",
        "comments": "KommentarerStudierådets kommentarerStudenterna var överlag missnöjda med kursen i sin helhet. Föreläsaren kommer att se över svårighetsnivån på föreläsningarna till nästa år för att ta hänsyn till majoriteten av studenternas förkunskaper. Laborationerna upplevdes som ett gott komplement till övrig undervisning och handledarna var uppskattade. Många studenter hade synpunkter på kurslitteraturen som upplevdes svår att ta till sig. Kursansvarig kommer till nästa år att lägga till fler övningsuppgifter samt eventuellt ta fram förklaringar till vissa övningsuppgifter för att komplettera kurslitteraturens kortfattade facit. Studenterna upplevde också att det var stor skillnad i svårighetsgrad mellan övningsuppgifterna och tentamen. Det fanns synpunkter kring att tentamensuppgifterna var mycket lika, eller identiska, med tidigare tentamen. Kursansvarig kommer att göra vissa förändringar till nästa år för att göra tentamen mer förståelseinriktad. Dessa förändringar av tentamen kommer tydligt att kommuniceras till studenterna under kursens gång.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen hade fått blandade omdömen då den gavs i HT17. Studenterna uppskattade laborationer och övningar, men föreläsningarna fick blandad kritik. Det fanns även klagomål på tentan eftersom den var för lik uppgifter som studenterna redan hade sett eller löst. En mer utmanande tenta efterfrågades. Kursansvarig höll med om kritiken och lovade att ändra på tentan. På sikt kommer den att bli mer utmanande, men kursansvarig kommer att göra ändringar i steg och informera studenterna om ändringarna.Det påpekades av studenterna att vissa svårigheter kanske kunde ha lösts under kursens gång. Kursansvarig kommer därför att hålla mer regelbundna möten med studenterna nästa gång kursen ges.Kursansvarig var mycket tillmötesgående på CEQ-mötet och lyssnade på studenternas kommentarer. Dessutom var kursansvarig medveten om vissa problem, t ex schemaläggning av laborationen, vilket kommer att åtgärdas inför nästa kursomgång.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN45",
        "name": "Människa, teknik, organisation och hantering av risker",
        "points": "7.5",
        "year": "17/18",
        "registered": "63",
        "percentPassed": "98%",
        "teachingScore": "+38",
        "goalClearnessScore": "+35",
        "assessmentScore": "+35",
        "workloadScore": "+64",
        "importanceScore": "+57",
        "satisfactionScore": "+43",
        "comments": "KommentarerStudierådets kommentarerKursen har fått relativt höga betyg på CEQ-enkäterna. Bland annat anses kursen relevant för det kommande arbetslivet. Hemtentamen kändes väldigt förståelseinriktad och bra. Projektet var väldigt uppskattat då man fick en inblick i arbetslivet. Genomgången av en extenta som var nytt för i år, var väldigt uppskattat av eleverna då man fick en inblick i hur den kursansvariga tänker när hon rättar tentorna. Opponeringen däremot upplevdes som att studenterna inte riktigt tog på allvar alternativt inte visste hur man skulle förbereda sig. Den kursansvariga sa att det ligger instruktioner om hur opponeringen ska genomföras men att hon kan poängtera ytterligare vad som behövs tänkas på. Kurslitteraturen som blev försenad var ett problem för de som drabbades men är inget den kursansvariga kan styra över då det är tryckeriets ansvar att få ut det i tid. Några studenter skrev att de tyckte att projektet kunde komma igång tidigare och att det kunde vara kortare tid mellan studiebesök 1 och 2. Den kursansvariga svarade att första handledarmötet var redan läsvecka 1 och att det blir svårt att tidigarelägga. Anledningen varför det är cirka 2 veckor mellan studiebesöken är för att studenterna ska kunna förbereda sig väl och sätt sig in i litteraturen innan besök 2. Dessutom ska besöken läggas så att det passar företagen. En annan kritik som togs upp var att olika handledare var olika engagerade i projektarbetet. Detta är svårt att komma ifrån då människor är olika. Den kursansvariga brukar däremot kommunicera med sina handledare om hur de ska förhålla sig till sina studentgrupper. Till nästa år kommer reflektionerna att vara stängda för att motverka att studenterna läser varandras reflektioner istället för att läsa kurslitteraturen.Kurslärarens kommentererKursen upplevs som både relevant och angelägen för studenternas utbildning. Man upplever även projektarbetet med studiebesök i praktisk verksamhet som givande och roligt. Tentamens utformning som hemtenta uppskattas och har fungerat bra. Den lokala rutinen för att anonymisera hemtentan fungerade utan problem. Nytt för i år var två tentamensseminarium där en extenta gicks igenom och diskuterades. Momentet verkar ha fallit ut positivt för studenternas förberedelse inför hemtentan. Några studenter tyckte opponeringstillfället vid projektpresentationerna kan förbättras. Till nästa kursomgång kommer opponeringens fokus att ligga på att ställa diskuterande frågor samt att frågor om formalia och rapportlayout tas bort. Studenternas skriftliga reflektioner kommer inte längre att läggas på ett gemensamt forum för alla att läsa, då det kom kritik om att kopiering förekom.Programledarens kommentarerStudenterna är överlag nöjda med kursen. Många studenter upplevde att hemtentamen var bra och fokuserade på förståelse mer än faktaredovisning. Detta är något som kursansvarig har jobbat med inför kursen. Det var även väldigt uppskattat att kursansvarig gick igenom en tentaövning, vilket var första gången (efter kommentarer från tidigare CEQ). Projektet tyckte studenterna var intressant och givande och man uppskattade konsultationstider och den feedback man fick. Även studiebesöken uppskattades. Studenterna skulle gärna vilja att man på förhand gick igenom hur opponeringen vid redovisningarna kan genomföras och trycka på att det ska vara mer diskussionsfrågor (snarare än att lyfta stavfel osv.). Kursansvarig kommer lägga mer vikt vid detta inför nästa år. Kursansvarig kommer även se över reflektionsuppgifterna inför nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ssr - System, signaler och reglering": [
      {
        "code": "FRTN10",
        "name": "Flervariabel reglering",
        "points": "7.5",
        "year": "17/18",
        "registered": "68",
        "percentPassed": "75%",
        "teachingScore": "+30",
        "goalClearnessScore": "+38",
        "assessmentScore": "+63",
        "workloadScore": "+20",
        "importanceScore": "+70",
        "satisfactionScore": "+52",
        "comments": "KommentarerKursrepresentantens kommentarerI det stora hela har kursen fungerat väldigt bra, och det upplevs inte att något akut behöver förändras. Inför nästa år kommer fokus att läggas på att gå ifrån den nuvarande kursboken (Glad & Ljung) och i stället använda ett kompendium som är mer skräddarsytt för kursens innehåll.Några övriga punkter som tagits upp av studenterna är att det gärna får finnas fler övningsuppgifter på en väldigt grundläggande nivå som introduktion till nya koncept. Det önskas även att utrustning som används i kursen fräschas upp, och fixas. Specifikt gäller det DVD-spelaren som \u0094användes\u0094 som demo under en föreläsning, och processen i laboration 3. I början av denna kursomgången hölls repetitionsseminarier för de som inte läst reglerteknik på ett tag. Dessa var uppskattade, men somliga hade önskat ännu mer repetition, i form av ett repetitions-övningshäfte med väldigt tydliga lösningsförslag. Detta häfte kommer förhoppningsvis kunna sammanställas, och skickas ut till alla kursregistrerade strax innan nästa kursomgång startar, så de har tid att fräscha upp minnet.Både föreläsaren och labb-/övningsledarna upplevs för övrigt ha gjort ett fantastiskt jobb.Kurslärarens kommentererKursen fick överlag ett mycket gott omdöme i år. Repetitionen i början av föreläsningarna uppskattades liksom användandet av Piazza för att ställa frågor. Laborationerna uppskattades för den praktiska förståelsen, även om lab 3 hade vissa tekniska problem. Något som fick viss kritik är hur övningarna är upplagda och även hur/om datorer används för att lösa talen. Vid CEQ-mötet diskuterade vi möjliga förändringar i kursen till nästa år:- Mer föreläsning på svarta tavlan, mindre OH- Färdigställa \"lecture notes\" för att minska behov av läroboken Glad&Ljung- Varva vanliga övningssalar med våra labbsalar för bättre arbetsmiljö- Mer struktur och guidning i manualen till lab 1- Helst en helt ny process till lab 3- Häfte med repetitionsuppgifter för att fräscha upp förkunskaper innan kursen börjarCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN55",
        "name": "Signalseparation - oberoende komponenter",
        "points": "7.5",
        "year": "17/18",
        "registered": "27",
        "percentPassed": "52%",
        "teachingScore": "+60",
        "goalClearnessScore": "+51",
        "assessmentScore": "+70",
        "workloadScore": "+17",
        "importanceScore": "+91",
        "satisfactionScore": "+68",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "17/18",
        "registered": "120",
        "percentPassed": "84%",
        "teachingScore": "+29",
        "goalClearnessScore": "+49",
        "assessmentScore": "+53",
        "workloadScore": "+51",
        "importanceScore": "+75",
        "satisfactionScore": "+63",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen fungerar väl och PL har valt att CEQ-möte hållas i form av mejlkonversation. Inga kommentarer har inkommit.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN70",
        "name": "Matristeori",
        "points": "6.0",
        "year": "17/18",
        "registered": "53",
        "percentPassed": "75%",
        "teachingScore": "+23",
        "goalClearnessScore": "+34",
        "assessmentScore": "+75",
        "workloadScore": "+11",
        "importanceScore": "+82",
        "satisfactionScore": "+56",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF80",
        "name": "Datorgrafik",
        "points": "7.5",
        "year": "17/18",
        "registered": "40",
        "percentPassed": "83%",
        "teachingScore": "+29",
        "goalClearnessScore": "+37",
        "assessmentScore": "+39",
        "workloadScore": "+23",
        "importanceScore": "+46",
        "satisfactionScore": "+50",
        "comments": "Studierådets kommentarerKursen upplevdes som väldigt tung mot slutet och det hade varit bra ifall man kunde lägga labbarna tidigare och kanske även lagt in lite extra hjälp med c++ för de studenter som inte använt det innan. Annars så var labbarna bra och de praktiska delarna väldigt lärorika.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Extra inläsningsmaterial eller extra föreläsning för studenterna som tidigare inte stött på C++ hade varit bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF50",
        "name": "Introduktion till trådlösa system",
        "points": "7.5",
        "year": "17/18",
        "registered": "49",
        "percentPassed": "82%",
        "teachingScore": "+38",
        "goalClearnessScore": "+42",
        "assessmentScore": "+7",
        "workloadScore": "+31",
        "importanceScore": "+56",
        "satisfactionScore": "+53",
        "comments": "KommentarerStudierådets kommentarerUppskattad kurs bland studenterna och speciellt föreläsaren beröms för sitt engagemang. Laborationerna är också omtyckta av studenterna då de väl speglar kursens innehåll.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF15",
        "name": "Markovprocesser",
        "points": "7.5",
        "year": "17/18",
        "registered": "54",
        "percentPassed": "61%",
        "teachingScore": "+13",
        "goalClearnessScore": "+32",
        "assessmentScore": "+44",
        "workloadScore": "+54",
        "importanceScore": "+39",
        "satisfactionScore": "+45",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSN05",
        "name": "Programvaruutveckling för stora system",
        "points": "7.5",
        "year": "17/18",
        "registered": "71",
        "percentPassed": "97%",
        "teachingScore": "-11",
        "goalClearnessScore": "-17",
        "assessmentScore": "+55",
        "workloadScore": "+21",
        "importanceScore": "+80",
        "satisfactionScore": "+20",
        "comments": "Studierådets kommentarerDet var stora problem med administrationen i kursen. Saker såsom kommunikation mellan olika parter, gruppindelning, information som kommer ut för sent var till stora bekymmer. Det är en väldigt stor andel av studenterna som är missnöjda med kursen och administrationen kring den är det stora problemet.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen har ett visst behov av översyn och modernisering.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MIOA01",
        "name": "Industriell ekonomi, allmän kurs",
        "points": "9.0",
        "year": "17/18",
        "registered": "97",
        "percentPassed": "92%",
        "teachingScore": "+54",
        "goalClearnessScore": "+54",
        "assessmentScore": "+49",
        "workloadScore": "+30",
        "importanceScore": "+84",
        "satisfactionScore": "+78",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerMycket glädjande att kursen har gått utomordentligt bra i år!CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN20",
        "name": "Bildanalys",
        "points": "7.5",
        "year": "17/18",
        "registered": "113",
        "percentPassed": "88%",
        "teachingScore": "+54",
        "goalClearnessScore": "+32",
        "assessmentScore": "+63",
        "workloadScore": "+18",
        "importanceScore": "+75",
        "satisfactionScore": "+69",
        "comments": "KommentarerStudierådets kommentarerKursen och dess upplägg är uppskattade av studenterna. Föreläsningarna var omtyckta och föreläsaren ansträngde sig för att göra ämnet intressant. Den kritik som kommer fram är att det var lång väntetid på övningstillfällena och att instruktionerna till inlämningarna innehöll fel och oklarheter. För att förbättra det skulle det behövas fler övningsledare på övningstillfällena och instruktionerna skulle kunna ses över och uppdateras till nästa kursomgång.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMNN35",
        "name": "Numeriska metoder för datorgrafik",
        "points": "6.0",
        "year": "17/18",
        "registered": "9",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "EITN35",
        "name": "Projekt i elektro- och informationsteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "1",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "MION25",
        "name": "Teknologistrategier",
        "points": "7.5",
        "year": "17/18",
        "registered": "47",
        "percentPassed": "87%",
        "teachingScore": "+41",
        "goalClearnessScore": "-5",
        "assessmentScore": "+16",
        "workloadScore": "+38",
        "importanceScore": "+53",
        "satisfactionScore": "+34",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN35",
        "name": "Projekt i elektro- och informationsteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "1",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "EITN35",
        "name": "Projekt i elektro- och informationsteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "1",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "EITN35",
        "name": "Projekt i elektro- och informationsteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "1",
        "percentPassed": "100%",
        "comments": ""
      }
    ]
  },
  "D": {
    "Årskurs 1 (obligatoriska kurser)": [
      {
        "code": "EDAA60",
        "name": "Datorer och datoranvändning",
        "points": "3.0",
        "year": "17/18",
        "registered": "110",
        "percentPassed": "96%",
        "teachingScore": "+14",
        "goalClearnessScore": "+48",
        "assessmentScore": "+21",
        "workloadScore": "+52",
        "importanceScore": "+56",
        "satisfactionScore": "+47",
        "comments": "KommentarerStudierådets kommentarerKursens innehåll är relevant för studenterna. Föreläsningarna var det dock lite splittring kring och det var en del studenter som upplevde att föreläsningarna var \"uttänjda\".Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAA05",
        "name": "Endimensionell analys",
        "points": "15.0",
        "year": "17/18",
        "registered": "109",
        "percentPassed": "36%",
        "teachingScore": "-8",
        "goalClearnessScore": "+32",
        "assessmentScore": "+56",
        "workloadScore": "-31",
        "importanceScore": "+47",
        "satisfactionScore": "+21",
        "comments": "KommentarerStudierådets kommentarerEndimensionell är notoriskt känd för att vara en svår kurs att klara av.  Materialet, om än så relevant till programmet, har svåra abstraktionsnivåer och ett brett krav på basal fakta som exempelvis additionsformler för de trigonometriska funktionerna.  Utöver den stora teori mängden förväntas studenterna, som är vana med gymnasiematematik, börja skriva bevis med en praxis som inte är uppenbar. Dessa kunskaper kräver tid och det är kanske just det som är en förbättringsmöjlighet. Fler föreläsningar så att tempot dras ner lite samt någon morot så att fler går på övningstillfällena. Kanske att LTH introducerar fler små delmoment som ger högskolepoäng där dessa moment har tentaliknande uppgifter. På sådant vis får studenterna träning i att skriva tenta uppgifter (och får feedback på deras skrivande) samt möjligheten att plocka poäng under tiden och inte enbart vid två tillfällen. I sammanfattningen av arbetsrapporten för FMAA05 (D-programmet) är det just \u0093Lämplig arbetsbelastning\u0094 som fått lägst resultat rent kvalitativt, och således där LTH borde fokusera sina krafter. En sak som var positiv var seminarietillfällena. De gav studenter som strävar efter de högre betygen möjligheten att utveckla sina färdigheter till fullo. Vi hoppas dessa förslag kan förbättra kursen inför nästa år när kursen ges.Kurslärarens kommentererSe kommentarer för C-programmet. Både C och D gick samma föreläsningsserie för denna kurs.Programledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA45",
        "name": "Programmering, grundkurs",
        "points": "7.5",
        "year": "17/18",
        "registered": "109",
        "percentPassed": "68%",
        "teachingScore": "+46",
        "goalClearnessScore": "+37",
        "assessmentScore": "+68",
        "workloadScore": "-6",
        "importanceScore": "+98",
        "satisfactionScore": "+61",
        "comments": "KommentarerStudierådets kommentarerSom helhet är kursen bra mottagen men det finns vissa saker som anses kunna förbättras: Införa extrainsatta föreläsningar för nybörjare i början av kursen för att hjälpa dem lite extra i början då de upplever att kursen går väldigt snabbt. Det är svårt med handledartid ibland, särskilt för vissa av de svårare labbarna och att man försöker hitta någon lösning för detta. Det hade även varit bra om man kunnat omkonstruera vissa labbar som varit väldigt svåra/för lätta.Kurslärarens kommenterer* Status: Kursen går för andra gången i sin nya skepnad med Scala som förstaspråk.Kursen fungerar mycket bra: tentaresultatet är gott (ca 80% godkända) och CEQvisar på stor entusiasm för kursupplägg och -innehåll. Kursen läses gemensamtmed D17 (96st tenterande) och W (9st tenterande) och även W-are anser att kursenär mycket relevant för deras utbildning. * Åtgärder: Baserat på erfarenheter från årets omgång och CEQ är det lämpligt attse över vissa laborationer, övningar och projekt vad gäller innehåll ochomfattning. Utformningen av extraundervisningen för de som har det extra svårtmed programmering kan också ses över vad gäller placering och inriktning.* Speciellt för W: Ett stort problem för W-are är att alternativobligatoriet såsom det är konstruerat för närvarande tvingar studenterna att klämma in ämnetprogrammering i överlastade läsperioder med ca 125% studiefart. Detta är intehållbart och kursansvarig ber därför programledningen att finna en lösning somgör det möjligt för W-are att läsa programmering under normal studietakt.Programledarens kommentarerEn väl genomförd kurs. Kursansvarig arbetar kontinuerligt på att utveckla kursen.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EXTA65",
        "name": "Kognition",
        "points": "4.5",
        "year": "17/18",
        "registered": "135",
        "percentPassed": "90%",
        "teachingScore": "-9",
        "goalClearnessScore": "-12",
        "assessmentScore": "+30",
        "workloadScore": "+49",
        "importanceScore": "+19",
        "satisfactionScore": "-18",
        "comments": "KommentarerStudierådets kommentarerFör mycket fokus på bara ett perspektiv för bra kognitiv design (Norman).Intressant med gästföreläsare, tyvärr kändes de inte som att de gav någonting för att klara kursen.Labbarna kändes inte som att de passade in i kursen eller var bra gjorda. Förslag om att använda sig av flipped classroom verkar vara mer attraktivt.Många anser att då det är svårt att få ihop 3000 ord om ett litet ämne som t.ex en mikrovågsugn så istället blir rapporten fylld med onödig information för att nå upp.All kursinformation borde vara samlad på ett ställe för att underlätta för studenterna. I nuläget finns den utspridd och i vissa fall svåråtkomlig (live@lund).Bättre feedback.Andra delen av inlämningsuppgiften kändes mer som psykologi än kognition och ingen av föreläsningarna eller kursmaterialet hade förberett en på vad man skulle skriva.Kurslärarens kommentererJag vill tacka för mycket användbar feedback på kursutvärderingarna. Kursen har precis bytt plats i utbildningssystemet och min läsning av kursutvärderingarna är att vi inte helt hittat rätt i våra förändringar av kursen - på vissa ställen har vi gjort det för lätt och på andra har vi inte förklarat och motiverat kursinnehållet tillräckligt väl. Detta ska åtgärdas till nästa kursomgång. Samtidigt har vi fått positiva kommentarer om att kursen var rolig att läsa och att den kändes relevant och det tackar vi så mycket för.Programledarens kommentarerDiskussionerna på CEQ-mötet indikerar på att studenterna uppskattar kursen mer än vad siffrorna i CEQ-frågorna indikerar. På mötet bestämdes att mindre justeringar ska göras nästa år. Tempot på föreläsningarna ska ökas något, instruktionerna ska kompletteras där främst syfte och mål med uppgiften ska förtydligas.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 2 (obligatoriska kurser)": [
      {
        "code": "FMAB30",
        "name": "Flerdimensionell analys",
        "points": "6.0",
        "year": "17/18",
        "registered": "81",
        "percentPassed": "51%",
        "teachingScore": "+21",
        "goalClearnessScore": "+35",
        "assessmentScore": "+41",
        "workloadScore": "+3",
        "importanceScore": "+48",
        "satisfactionScore": "+50",
        "comments": "Studierådets kommentarerKursen FMAB30 var en utmärkt kurs och föreläsaren var en fantastisk pedagog.Kursen behöver inte någon större ändring, inga klagomål eller synpunkter om kursen från studenterna har uppfattats.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF60",
        "name": "Objektorienterad modellering och design",
        "points": "4.5",
        "year": "17/18",
        "registered": "76",
        "percentPassed": "88%",
        "teachingScore": "+72",
        "goalClearnessScore": "+45",
        "assessmentScore": "+50",
        "workloadScore": "+45",
        "importanceScore": "+98",
        "satisfactionScore": "+81",
        "comments": "Studierådets kommentarerEn kurs som har varit väldigt uppskattad även om den varit krävande. Att ändra på projekten vore uppskattat då det blev lite för lite tid till andra projektet.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerNärvarande på CEQ-mötet var representanter från SRD, KL och PL. Kursen anses som bra och viktig för utbildningen. Det var en del diskussion kring styrningen av projektet, bland annat hur gruppindelningen görs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF65",
        "name": "Digitalteknik",
        "points": "9.0",
        "year": "17/18",
        "registered": "90",
        "percentPassed": "62%",
        "teachingScore": "-17",
        "goalClearnessScore": "-8",
        "assessmentScore": "+65",
        "workloadScore": "-6",
        "importanceScore": "+57",
        "satisfactionScore": "+38",
        "comments": "Väldigt få ifyllda enkäter gör det svårt att summera. Av de som lämnat in enkät uppfattas kursens innehåll som mycket relevant för utbildningen. Laborationsdelen var krävande och givande och föreläsningarna gick lite långsamt på enkla delar och för fort på svåra delar. Till nästa kursomgång sker en omläggning av kursens innehåll så att all klassisk teori från boken föreläses under ht1 och tenteras direkt i oktober.Programledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF45",
        "name": "Datorkommunikation",
        "points": "7.5",
        "year": "17/18",
        "registered": "89",
        "percentPassed": "55%",
        "teachingScore": "-18",
        "goalClearnessScore": "-13",
        "assessmentScore": "-6",
        "workloadScore": "+21",
        "importanceScore": "+71",
        "satisfactionScore": "-5",
        "comments": "Studierådets kommentarerDet som främst behöver förbättras till nästa år är att det behövs lite mer struktur i vilka informationskanaler som gäller och allra helst att det bara finns en informationskanal, då många studenter upplevde detta som otydligt.Kurslärarens kommentererKursen gick i nuvarande form för andra gången och vi har fortfarande en del uppstartsproblem. Vi har fått spendera mycket tid på att få ordning på projektstyrningen. Till nästa år ska vi uppdatera projektbeskrivningen och göra den mer tydlig. Jag ska även ta in en senior lärare till som hjälper mig med kursansvaret. Dessutom kommer I-arna som tidigare läst EITF25 samtidigt att nu läsa denna kursen istället vilket kommer att göra det lättare för oss.Programledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Årskurs 2 (alternativobligatoriska kurser)": [],
    "Årskurs 3 (obligatoriska kurser)": [
      {
        "code": "FRTF05",
        "name": "Reglerteknik, allmän kurs",
        "points": "7.5",
        "year": "17/18",
        "registered": "72",
        "percentPassed": "63%",
        "teachingScore": "+46",
        "goalClearnessScore": "+63",
        "assessmentScore": "+61",
        "workloadScore": "+19",
        "importanceScore": "+44",
        "satisfactionScore": "+61",
        "comments": "Studierådets kommentarerEn bra och uppskattad kurs. Föreläsaren och handledarna är väldigt duktiga och tillför mycket. Den sista uppgiften på labb 2 är något onödig komplicerad, kursansvarig kommer kika på det.Kurslärarens kommentererDet är roligt att kursen överlag får så bra kritik. En del kommentarer gällande organisationen av laborationerna ska vi undersöka för att försöka minimera väntetiden för teknologer under laborationerna.Programledarens kommentarerEn väl genomförd kurs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF45",
        "name": "Matematisk statistik, allmän kurs",
        "points": "9.0",
        "year": "17/18",
        "registered": "81",
        "percentPassed": "58%",
        "teachingScore": "-69",
        "goalClearnessScore": "-27",
        "assessmentScore": "+44",
        "workloadScore": "-2",
        "importanceScore": "+50",
        "satisfactionScore": "-29",
        "comments": "Studierådets kommentarerDet fanns ett stort missnöje kring administrationen av kursen. På mötet fick vi en bra förklarning på vad som hände, i grunden två sjukskrivningar som sammanföll med att vissa ändringar höll på att göras i kursen. Institutionen har tagit åt sig kritik och kommer jobba på att hantera ett sånt problem bättre i framtiden. Ett omarbete är planerat av kursen som SRD ställer sig positivt. En möjlighet är att byta till en engelsk kursbok, vilket vore bra eftersom det finns mycket material online på engelska men i dagsläget kan det vara svårt att hitta den engelska termen för ett koncept. Man har också tänkt lägga upp länken till ett dictionary som översätter dom svenska termerna till de engelska.Tyvärr kommer antalet övningstillfälle minska, på grund av minskade anslag. Det är synd eftersom övningsledarna och tillfällena var väldigt uppskattade.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerSjukskrivningar på institutionen har tyvärr drabbat denna kursomgång. Kursen håller på att anpassas efter de ekonomiska förutsättningar som finns, vilket bl.a. innebär att labbarna ska göras mer självständigt av studenterna. Arbetet med att att ta fram det nya kursmaterialet var inte klart i tid pga sjukskrivningarna, vilket skapade förvirring både för lärarna och studenterna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF55",
        "name": "Realtidsprogrammering",
        "points": "6.0",
        "year": "17/18",
        "registered": "149",
        "percentPassed": "50%",
        "teachingScore": "-14",
        "goalClearnessScore": "-18",
        "assessmentScore": "+44",
        "workloadScore": "-48",
        "importanceScore": "+68",
        "satisfactionScore": "+11",
        "comments": "KommentarerStudierådets kommentarerKursen är överlag bra. Det som borde ändras till nästa år är en tidigare introduktion till C programmering. Detta så att studenterna är ordentligt förberedda för projektet.Kurslärarens kommentererInstämmer med synpunkterna i allmänhet, och kring projektdelen i synnerhet. En bättre introduktion/hjälp till C-programmering av serverdelen i projektet kommer att göras till nästa år. Detta och andra synpunkter, samt behov av revidering av kursmaterialet, har diskuterats med tillträdande ny kursansvarig för nästa år.Programledarens kommentarerPå mötet deltog KL,PLD samt studentrepresentant för D. Kursen anses väldigt nyttig för utbildningen men arbetsbelastningen i projektet känns för hög eftersom studenterna även måste lära sig programmera i C. Under mötet diskuterades detta och det finns en del konkreta förslag till åtgärder. Kursen kommer även att byta kursansvarig nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSF25",
        "name": "Affärsdriven programvaruutveckling",
        "points": "7.5",
        "year": "17/18",
        "registered": "78",
        "percentPassed": "95%",
        "teachingScore": "-23",
        "goalClearnessScore": "-39",
        "assessmentScore": "+33",
        "workloadScore": "-1",
        "importanceScore": "+11",
        "satisfactionScore": "-50",
        "comments": "Studierådets kommentarerSeminarierna var bra och ändringen för att göra de obligatoriska tror vi är en god tanke. Kvaliten på peer review var väldigt olika och tyvärr var många dåliga, om något kan göras för att förbättra detta så vore det väldigt bra - exempelvis om kursansvarig berättar att de kommer ta stickprov och kan underkännas. Ett problem många upplevde under kursen var kommunikationen - Instruktioner var utspridda och det behövdes skickas många mail med tillägg. Det vore bättre om informationen var samlad i ett (eller litet antal) dokument i högsta möjliga mån, och informationen från mail hamnar i dessa dokument. I essay så behövde vissa grupper byta ämne under kursens gång på grund av att deras ämnesval saknade literatur - det vore väldigt bra om grupperna var tvungna att göra en literatursökning innan dom väljer och får lite hjälp med detta av seminariehandledarna. Gästföreläsningarna var väldigt bra.Kurslärarens kommentererThis was the first instance of this new course. The examination was based on two students assignments; a project (in groups of 6) and an individual (or pair) essay assignment. The course material was covered by lectures (by course admin and by guest lecturers) and by seminars where literature was discussed and aspects of the assignments covered. The students received feedback on their assignments through peer-review guided by teacher-designed assessment criteria and by direct teacher feedback on one draft of the project report.The assignment descriptions were gradually explained throughout the course and the information was distributed over multiple sources (description doc, grading grid, seminar material, emails and lecture slides). This will be improved and one main source of information will be provided for each assignment. This source will then be referred to when presenting and explaining the assignments (e.g. at lectures, or in emails) to highlight that the information is not new. I will also consider merging the course web page with moodle to provide one information platform for the course.For some of the course content, the purpose and content of these need to be improved and covered in one of the first lectures. In particular, this applies to software project management (SPM), peer-reviewed literature and reading of scientific literature. For SPM, this includes clarifying its relationship to business plans and models (to provide an intial cost evaluation and plan for developing the software product) and how the examination of this part is done within the project assignment. This also relates to the course book which covers this topic. The book provides a good overview of SPM and this topic is covered by 3 of the lectures. I will consider if it is possible to provide an extract in the compendium but it is likely that more than the allowed max 15 pages are required (due to copyright laws). The seminars mainly worked well and were appreciated by the students, but can still be further improved. For example, by focusing more on the connected assignments. If possible, it would be desirable to decrease the sizes of the classes to allow for more discussions and teacher feedback. I am also considering letting one teaching assistant manage the seminars related to the project assignment, and one the seminars related to the essay assignment.Currently the two assignments are interleaven during the course with hand-ins for each assignment every other week. Since the students find that this causes an overhead in context switching between the two assignments I will consider if it is possible to initally focus on the project assignment and introduce the essay assignment later on. The drawback of this option is that the lead time for each assignment will be decreased, reducing the time for the topics / assignment to mature.Programledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering bg - Bilder och grafik": [
      {
        "code": "FMAN20",
        "name": "Bildanalys",
        "points": "7.5",
        "year": "17/18",
        "registered": "113",
        "percentPassed": "88%",
        "teachingScore": "+54",
        "goalClearnessScore": "+32",
        "assessmentScore": "+63",
        "workloadScore": "+18",
        "importanceScore": "+75",
        "satisfactionScore": "+69",
        "comments": "KommentarerStudierådets kommentarerKursen och dess upplägg är uppskattade av studenterna. Föreläsningarna var omtyckta och föreläsaren ansträngde sig för att göra ämnet intressant. Den kritik som kommer fram är att det var lång väntetid på övningstillfällena och att instruktionerna till inlämningarna innehöll fel och oklarheter. För att förbättra det skulle det behövas fler övningsledare på övningstillfällena och instruktionerna skulle kunna ses över och uppdateras till nästa kursomgång.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAF80",
        "name": "Datorgrafik",
        "points": "7.5",
        "year": "17/18",
        "registered": "40",
        "percentPassed": "83%",
        "teachingScore": "+29",
        "goalClearnessScore": "+37",
        "assessmentScore": "+39",
        "workloadScore": "+23",
        "importanceScore": "+46",
        "satisfactionScore": "+50",
        "comments": "Studierådets kommentarerKursen upplevdes som väldigt tung mot slutet och det hade varit bra ifall man kunde lägga labbarna tidigare och kanske även lagt in lite extra hjälp med c++ för de studenter som inte använt det innan. Annars så var labbarna bra och de praktiska delarna väldigt lärorika.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Extra inläsningsmaterial eller extra föreläsning för studenterna som tidigare inte stött på C++ hade varit bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN25",
        "name": "Interaktionsdesign",
        "points": "7.5",
        "year": "17/18",
        "registered": "67",
        "percentPassed": "76%",
        "teachingScore": "+53",
        "goalClearnessScore": "+33",
        "assessmentScore": "+69",
        "workloadScore": "+5",
        "importanceScore": "+73",
        "satisfactionScore": "+63",
        "comments": "KommentarerStudierådets kommentarerÖverlag är studenterna nöjda med kursen. Projektet i kursen var ett bra sätt att lära sig det kursen gick ut på. Bra att få jobba i tvärvetenskapliga grupper. Studenterna upplever även att kursen är relevant för deras utbildning. Kontinuerlig uppföljning med veckovisa handledningar var positivt för arbetsgången.Instruktionerna om vanliga fel i artikelskrivandet som gavs ut efter kamratgranskningen hade kunnat delas ut innan artikel börjar skrivas. Många fick skriva om stor del av sin artikel från grunden, något som hade motverkats om de fick denna information från början. Arbetsbelastningen var för hög med för många olika ingående moment i kursen på för lite tid. Var svårt att hinna med att göra det man ville till nästa handledning när det var så kort tid. Begränsningen på 2000 ord för artikeln är för lite för att kunna få med allt man tycker är viktigt. Mycket upprepning för TD-studenterna med avseende på designprocessen vilket inte är så givande. Svårt och förvirrande att växla mellan svenska och engelska i kursen.Under kursens gång hålls ett möte mellan studenter och kurslärare. På detta möte kom man fram till följande förslag till nästa kurs: Införa schemalagda arbetspass för projektarbetet för att underlätta för studenter från olika program. Undersöka möjligheten för TD-studenter att ta en mer av en projektledande roll i gruppen för att få ut mer av kursen.Kurslärarens kommentererKursen fick bra omdöme utan att för den skulle anses för lätt. Detta tyder både CEQ-resultatet och resultatet i kursen på. Många fritextsvar indikerar att en ökad tydlighet efterfrågas för att underlätta det kontinuerliga projektarbetet. Dessa förändringar är tänkta att genomföras utifrån det:- Bearbeta instruktionerna för projektuppgift samt individuell uppgift så att det inte finns dubbeltydig information samt att det blir enklare för den enskilde studenten att förstå de centrala arbetsmomenten i respektive projektsteg.- Ställa tidiga krav på organisationen i grupperna för att säkerställa att det finns gemensamma tider för att arbeta i grupperna. Detta kommer att genomföras som ytterligare krav i det initiala gruppkontraktet. Här kommer också en utökad diskussion om rollerna i projektgruppen utifrån intresse och inriktning hos varje enskild student att förstärkas.- Den individuella examinationsuppgiften verkar ha fungerat för alla studenter oavsett program och kommer att se ut på ungefär samma sätt med mindre modifieringar i utformning och instruktion.- Kurslitteraturen kommer att förtydligas ytterligare genom att enbart en bok kommer att ligga till grund för kursinnehållet. Denna kommer att åtföljas av läsanvisningar samt kompletteras med artiklar eller webbaserad information vid behov.Programledarens kommentarerStudenterna är nöjda med kursen och tycker att den är relevant för utbildningen. Det som kom upp under mötet med studenter och kursansvarig är att vissa upplevt arbetsbördan som för hög med många moment som ska hinnas med varje vecka och att vissa moment som fokuserar på den grundläggande designprocessen känns överflödiga för TD-studenterna. Schemaläggning av grupparbetestillfällen, gruppsammansättning och studenternas roller inom grupperna ses över inför nästa tillfälle.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "17/18",
        "registered": "120",
        "percentPassed": "84%",
        "teachingScore": "+29",
        "goalClearnessScore": "+49",
        "assessmentScore": "+53",
        "workloadScore": "+51",
        "importanceScore": "+75",
        "satisfactionScore": "+63",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen fungerar väl och PL har valt att CEQ-möte hållas i form av mejlkonversation. Inga kommentarer har inkommit.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN70",
        "name": "Matristeori",
        "points": "6.0",
        "year": "17/18",
        "registered": "53",
        "percentPassed": "75%",
        "teachingScore": "+23",
        "goalClearnessScore": "+34",
        "assessmentScore": "+75",
        "workloadScore": "+11",
        "importanceScore": "+82",
        "satisfactionScore": "+56",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMNN35",
        "name": "Numeriska metoder för datorgrafik",
        "points": "6.0",
        "year": "17/18",
        "registered": "9",
        "percentPassed": "100%",
        "comments": ""
      }
    ],
    "Specialisering dpd - Design av processorer och digitala system": [
      {
        "code": "ETIN20",
        "name": "Digital IC-konstruktion",
        "points": "7.5",
        "year": "17/18",
        "registered": "36",
        "percentPassed": "44%",
        "teachingScore": "+35",
        "goalClearnessScore": "+35",
        "assessmentScore": "+32",
        "workloadScore": "-3",
        "importanceScore": "+64",
        "satisfactionScore": "+48",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF35",
        "name": "Digitala strukturer på kisel",
        "points": "7.5",
        "year": "17/18",
        "registered": "34",
        "percentPassed": "76%",
        "teachingScore": "+43",
        "goalClearnessScore": "+43",
        "assessmentScore": "+50",
        "workloadScore": "-8",
        "importanceScore": "+81",
        "satisfactionScore": "+61",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETIN70",
        "name": "Modern elektronik",
        "points": "7.5",
        "year": "17/18",
        "registered": "14",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "EITF80",
        "name": "Elektromagnetisk fältteori",
        "points": "9.0",
        "year": "17/18",
        "registered": "55",
        "percentPassed": "36%",
        "teachingScore": "+50",
        "goalClearnessScore": "+34",
        "assessmentScore": "+70",
        "workloadScore": "-32",
        "importanceScore": "+74",
        "satisfactionScore": "+54",
        "comments": "Studierådets kommentarerStudenterna är överlag nöjda med kursen vilket syns i Ceq-svaren. Finns ingenting att tillägga utom det som togs upp på mötet. Keep up the good work!Kurslärarens kommentererThis is the 5th time I am teaching this course. Overall, it has been a good year. the major changes implemented (based on the previous year's CEQ feedback) had been:1) Revision of exercise problems to correct small errors2) Detailed solutions to all exercise problems now in electronic version3) Even more small demos and examples (e.g. visit from nok9 AB)From the latest CEQ, I was happy to see that students appreciated the demos/examples a lot, including Lars Olsson's demo and a visit from nok9. However, some concerns were raised, which my teaching assistant and I also noticed. We will make some changes accordingly:1) The written test is seen to be too long (10 short questions in two hours). We plan to change it to 6 questions, to allow students who understand the problems to complete the tasks and be more thorough with the answers.2) The students seemed unprepared for the written test, and some were unsure of the topics covered in the test. We will delay the test so that the students will have at least one week to study (and catch up with) the materials after they have been taught. I will also put more effort to emphasize the topics covered.3) I will propose to make the math course \"Calculus in Several Variables\" a prerequisite, as we noticed that the students who struggle the most in my course are those who are weak in math (my course teaches and apply some advanced math, which builds on previous math courses). Some students mentioned that the exercise classes are too crowded and the waiting time to get help can be long (and a wish to have more teaching assistants). I have been keeping track of the attendance and observed that it was only on rare occasions when many show up (but still within the seating capacity) and this only happened in one class (not the second class). I will stress more to the students that they should consider attending the second class instead. Another important task for me is that I should coordinate with the new course responsible teacher for EITF75 (6.0hp) to ensure that most of the course assignments are kept in the earlier part of HT1 so that the students can put more time into my course, which starts in the 4th week of HT1 (i.e., balancing the study load). This arrangement had worked very well before and I hope it can continue.Programledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iExam Information Session"
      },
      {
        "code": "EDAN85",
        "name": "Konstruktion av inbyggda system, fördjupningskurs",
        "points": "7.5",
        "year": "17/18",
        "registered": "10",
        "percentPassed": "100%",
        "comments": ""
      }
    ],
    "Specialisering is - Inbyggda system": [
      {
        "code": "EDAA25",
        "name": "C-programmering",
        "points": "3.0",
        "year": "17/18",
        "registered": "77",
        "percentPassed": "36%",
        "teachingScore": "-19",
        "goalClearnessScore": "+26",
        "assessmentScore": "+66",
        "workloadScore": "+5",
        "importanceScore": "+64",
        "satisfactionScore": "+33",
        "comments": "KommentarerStudierådets kommentarerMånga studenter upplever att se saknar bra material att jobba med när de studerar, hänvisningar till övningsuppgifter tillsammans med läshänvisningar hade hjälp. Man upplevde även att det var svårt att få hjälp med enklare grejer i samband med inlämningarna då rättningen inte gav bra feedback. En del hade även önskat att det var tydligare i början av kursen att det inte är en grundkurs.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerDetta är en ambitiös kurs mer rätt mycket innehåll. Inför framtiden kan innehållet i större utsträckning anpassas efter kursens storlek då arbetsbördan är hög. I övrigt är kursen bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF35",
        "name": "Digitala strukturer på kisel",
        "points": "7.5",
        "year": "17/18",
        "registered": "34",
        "percentPassed": "76%",
        "teachingScore": "+43",
        "goalClearnessScore": "+43",
        "assessmentScore": "+50",
        "workloadScore": "-8",
        "importanceScore": "+81",
        "satisfactionScore": "+61",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN65",
        "name": "Kompilatorer",
        "points": "7.5",
        "year": "17/18",
        "registered": "57",
        "percentPassed": "67%",
        "teachingScore": "+38",
        "goalClearnessScore": "+44",
        "assessmentScore": "+70",
        "workloadScore": "-1",
        "importanceScore": "+81",
        "satisfactionScore": "+61",
        "comments": "Kursrepresentantens kommentarerThis challenging course that requires critical thinking and logic is a must for anyone who wants to understand what happens every time they press the \"compile\" button to run their code. Overall, the students are satisfied, and the lengthy assignments are required in order to get a hands-on experience with an actual compiler.Kurslärarens kommentererStudenterna är mycket nöjda med kursen och tycker att den är mycket angelägen för deras utbildning. Några citat: \"Labbarna var väldigt givande.\", \"Bästa kursen på LTH.\"Många tycker att arbetsbelastningen är hög, men inte för hög. De anser att labbarna är mycket lärorika och att det är roligt att de bygger på varandra så att man i slutänden har konstruerat en hel kompilator.Många uppskattar Moodle-quizzarna som repetition på föreläsningarna. De täcker ännu inte hela kursen, men jag har lagt till något fler frågor i år, och planerar att lägga till ytterligare nästa år.På CEQ-mötet diskuterade vi dessutom ett antal detaljfrågor om ytterligare småförbättringar och förtydliganden som jag planerar att införa till nästa år.Programledarens kommentarerEn väl genomförd kurs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN85",
        "name": "Konstruktion av inbyggda system, fördjupningskurs",
        "points": "7.5",
        "year": "17/18",
        "registered": "10",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "EDAN26",
        "name": "Multicoreprogrammering",
        "points": "7.5",
        "year": "17/18",
        "registered": "58",
        "percentPassed": "71%",
        "teachingScore": "+47",
        "goalClearnessScore": "+41",
        "assessmentScore": "+54",
        "workloadScore": "+40",
        "importanceScore": "+83",
        "satisfactionScore": "+71",
        "comments": "Studierådets kommentarerAtt få prova på olika språk var väldigt uppskattat hos de flesta studenter. Det finns många olika småsaker som kan förbättras med kursen men i helhet är studenterna nöjda med den.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. En möjligt förbättring är tydliga instruktioner till labbarna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ks - Kommunikationssystem": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "17/18",
        "registered": "80",
        "percentPassed": "94%",
        "teachingScore": "-5",
        "goalClearnessScore": "-12",
        "assessmentScore": "+52",
        "workloadScore": "-31",
        "importanceScore": "+75",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerArbetsbelastningen på kursen blev mycket tuffare senare i kursen och det hade varit bra om man kunde flytta fram saker i tiden. Många är missnöjda med hur det sista projektet sköttes och hade velat ha feedback från läraren och inte bara peer-review då andra studenter inte erbjuder samma nivå på feedbacken.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn bra kurs, men informationen och labbhandledningen behöver vara tydligare.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITG05",
        "name": "Digital kommunikation",
        "points": "7.5",
        "year": "17/18",
        "registered": "86",
        "percentPassed": "62%",
        "teachingScore": "-3",
        "goalClearnessScore": "+12",
        "assessmentScore": "+49",
        "workloadScore": "+5",
        "importanceScore": "+33",
        "satisfactionScore": "+11",
        "comments": "KommentarerStudierådets kommentarerLaborationen var bra och gav förståelse. Kursen kan förbättras med fler praktiska exempel. Studenterna ansåg att förslaget om att justera föreläsningarnas ordning kan vara bra.Kurslärarens kommentererThis is the first year in which I was giving this course, and I have mostly taken over the content and structure from the previous teacher. Looking at the overall results of the exam, I am quite satisfied. Some students remarked in the evaluation that the questions were very different from the previous years, but the majority was able to adapt well and demonstrate a solid understanding of the material.The students like the laboratories and exercise lessons very much, but would like to have more examples in the lectures to make them more interesting. Unfortunately, we do not have resources for more laboratory hours, but I plan to split the lab into two sessions so that the first one can take place earlier. I am also thinking about including more Matlab examples in the lecture and creating some online quizzes that make the material more accessible.Programledarens kommentarerKursen fungerar bra och lärarna är uppskattade.Det efterlystes att synka övningsledarna så att alla först skulle köra genomgång av teorin innan man gick över till problemlösning - övningarna fick en hel del ros för att de hjälpte till att bygga upp förståelse.Tentamen var lite annorlunda mot tidigare år, vilket störde många studenter. Samtidigt konstaterades att uppgifterna på tentan täcktes väl av kursen. Till nästa år finns en ny extenta att titta på, vilket troligen minskar shockfaktorn något. Helheltsmässigt bedöms \"nya\" tentamen bättre spegla det som bör vara studenternas målbild.Att läraren tog upp konkreta exempel uppskattades, gärna fler sådana till nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF15",
        "name": "Markovprocesser",
        "points": "7.5",
        "year": "17/18",
        "registered": "54",
        "percentPassed": "61%",
        "teachingScore": "+13",
        "goalClearnessScore": "+32",
        "assessmentScore": "+44",
        "workloadScore": "+54",
        "importanceScore": "+39",
        "satisfactionScore": "+45",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF05",
        "name": "Webbsäkerhet",
        "points": "4.0",
        "year": "17/18",
        "registered": "81",
        "percentPassed": "91%",
        "teachingScore": "+49",
        "goalClearnessScore": "+53",
        "assessmentScore": "+46",
        "workloadScore": "+27",
        "importanceScore": "+79",
        "satisfactionScore": "+71",
        "comments": "KommentarerStudierådets kommentarerDe flesta gillade kursen. Det som kan förbättras var att kunna komma åt XAMPP utan egen dator/laptop. Studenterna upplevde att det var hög arbetsbelastning på projektet och att det borde läggas högskolepoäng på projeket och även eventuellt öka högskolepoängen för hela kursen. Kunde gå igenom mer på övningarna. Föreläsaren var väldigt uppskattad.Kurslärarens kommentererKursen fungerar bra, men några förbättringar diskuterades. Justeringar i tiden mellan två försök på online-tentamen, kan komma att utökas till två timmar. För projekten ska kommande peer-review ordnas så att högst tre grupper reviewar samtidigt. Kursen upplevs som tung i förhållande till antalet poäng den ger.Programledarens kommentarerNärvarande på CEQ-mötet var representant för SRD, KL samt PL. Studenterna är nöjda med kursen och den anses viktig för utbildningen. Det var en del diskussion kring projektet men annars uppplevs kursen som bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering pv - Programvara": [
      {
        "code": "EDAN55",
        "name": "Avancerade algoritmer",
        "points": "7.5",
        "year": "17/18",
        "registered": "50",
        "percentPassed": "92%",
        "teachingScore": "+36",
        "goalClearnessScore": "+20",
        "assessmentScore": "+79",
        "workloadScore": "+23",
        "importanceScore": "+59",
        "satisfactionScore": "+69",
        "comments": "Studierådets kommentarerKursen är väldigt uppskattad och många studenter gillar den skarpt. Det enda som eventuellt skulle kunna ändras är att ha mer övningar som förbereder en på den typen av frågor man kommer att få på tentan. Det är väldigt synd att kursen läggs ner och vi hoppas att man kommer att kunna starta upp den igen i framtiden.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen fugenrar bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAA25",
        "name": "C-programmering",
        "points": "3.0",
        "year": "17/18",
        "registered": "77",
        "percentPassed": "36%",
        "teachingScore": "-19",
        "goalClearnessScore": "+26",
        "assessmentScore": "+66",
        "workloadScore": "+5",
        "importanceScore": "+64",
        "satisfactionScore": "+33",
        "comments": "KommentarerStudierådets kommentarerMånga studenter upplever att se saknar bra material att jobba med när de studerar, hänvisningar till övningsuppgifter tillsammans med läshänvisningar hade hjälp. Man upplevde även att det var svårt att få hjälp med enklare grejer i samband med inlämningarna då rättningen inte gav bra feedback. En del hade även önskat att det var tydligare i början av kursen att det inte är en grundkurs.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerDetta är en ambitiös kurs mer rätt mycket innehåll. Inför framtiden kan innehållet i större utsträckning anpassas efter kursens storlek då arbetsbördan är hög. I övrigt är kursen bra.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN65",
        "name": "Kompilatorer",
        "points": "7.5",
        "year": "17/18",
        "registered": "57",
        "percentPassed": "67%",
        "teachingScore": "+38",
        "goalClearnessScore": "+44",
        "assessmentScore": "+70",
        "workloadScore": "-1",
        "importanceScore": "+81",
        "satisfactionScore": "+61",
        "comments": "Kursrepresentantens kommentarerThis challenging course that requires critical thinking and logic is a must for anyone who wants to understand what happens every time they press the \"compile\" button to run their code. Overall, the students are satisfied, and the lengthy assignments are required in order to get a hands-on experience with an actual compiler.Kurslärarens kommentererStudenterna är mycket nöjda med kursen och tycker att den är mycket angelägen för deras utbildning. Några citat: \"Labbarna var väldigt givande.\", \"Bästa kursen på LTH.\"Många tycker att arbetsbelastningen är hög, men inte för hög. De anser att labbarna är mycket lärorika och att det är roligt att de bygger på varandra så att man i slutänden har konstruerat en hel kompilator.Många uppskattar Moodle-quizzarna som repetition på föreläsningarna. De täcker ännu inte hela kursen, men jag har lagt till något fler frågor i år, och planerar att lägga till ytterligare nästa år.På CEQ-mötet diskuterade vi dessutom ett antal detaljfrågor om ytterligare småförbättringar och förtydliganden som jag planerar att införa till nästa år.Programledarens kommentarerEn väl genomförd kurs.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN20",
        "name": "Språkteknologi",
        "points": "7.5",
        "year": "17/18",
        "registered": "76",
        "percentPassed": "93%",
        "teachingScore": "+12",
        "goalClearnessScore": "+34",
        "assessmentScore": "+40",
        "workloadScore": "+27",
        "importanceScore": "+69",
        "satisfactionScore": "+29",
        "comments": "Studierådets kommentarerLabbinstruktionerna behöver skrivas om då en stor del av studenterna upplevde att de lade ner många timmar som de inte hade behövt p.g.a. de inte kunde utläsa instruktionerna. Innehållet i kursen var dock mycket uppskattat och många upplevde att labbarna var intressanta när de fått allt att fungera.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. Förbättringspotential finns i ökad tydlighet i labbinstruktionerna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EDAN26",
        "name": "Multicoreprogrammering",
        "points": "7.5",
        "year": "17/18",
        "registered": "58",
        "percentPassed": "71%",
        "teachingScore": "+47",
        "goalClearnessScore": "+41",
        "assessmentScore": "+54",
        "workloadScore": "+40",
        "importanceScore": "+83",
        "satisfactionScore": "+71",
        "comments": "Studierådets kommentarerAtt få prova på olika språk var väldigt uppskattat hos de flesta studenter. Det finns många olika småsaker som kan förbättras med kursen men i helhet är studenterna nöjda med den.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn väl genomförd kurs. En möjligt förbättring är tydliga instruktioner till labbarna.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering se - Software engineering": [
      {
        "code": "EITN50",
        "name": "Avancerad datasäkerhet",
        "points": "7.5",
        "year": "17/18",
        "registered": "80",
        "percentPassed": "94%",
        "teachingScore": "-5",
        "goalClearnessScore": "-12",
        "assessmentScore": "+52",
        "workloadScore": "-31",
        "importanceScore": "+75",
        "satisfactionScore": "+18",
        "comments": "Studierådets kommentarerArbetsbelastningen på kursen blev mycket tuffare senare i kursen och det hade varit bra om man kunde flytta fram saker i tiden. Många är missnöjda med hur det sista projektet sköttes och hade velat ha feedback från läraren och inte bara peer-review då andra studenter inte erbjuder samma nivå på feedbacken.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerEn bra kurs, men informationen och labbhandledningen behöver vara tydligare.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMN25",
        "name": "Interaktionsdesign",
        "points": "7.5",
        "year": "17/18",
        "registered": "67",
        "percentPassed": "76%",
        "teachingScore": "+53",
        "goalClearnessScore": "+33",
        "assessmentScore": "+69",
        "workloadScore": "+5",
        "importanceScore": "+73",
        "satisfactionScore": "+63",
        "comments": "KommentarerStudierådets kommentarerÖverlag är studenterna nöjda med kursen. Projektet i kursen var ett bra sätt att lära sig det kursen gick ut på. Bra att få jobba i tvärvetenskapliga grupper. Studenterna upplever även att kursen är relevant för deras utbildning. Kontinuerlig uppföljning med veckovisa handledningar var positivt för arbetsgången.Instruktionerna om vanliga fel i artikelskrivandet som gavs ut efter kamratgranskningen hade kunnat delas ut innan artikel börjar skrivas. Många fick skriva om stor del av sin artikel från grunden, något som hade motverkats om de fick denna information från början. Arbetsbelastningen var för hög med för många olika ingående moment i kursen på för lite tid. Var svårt att hinna med att göra det man ville till nästa handledning när det var så kort tid. Begränsningen på 2000 ord för artikeln är för lite för att kunna få med allt man tycker är viktigt. Mycket upprepning för TD-studenterna med avseende på designprocessen vilket inte är så givande. Svårt och förvirrande att växla mellan svenska och engelska i kursen.Under kursens gång hålls ett möte mellan studenter och kurslärare. På detta möte kom man fram till följande förslag till nästa kurs: Införa schemalagda arbetspass för projektarbetet för att underlätta för studenter från olika program. Undersöka möjligheten för TD-studenter att ta en mer av en projektledande roll i gruppen för att få ut mer av kursen.Kurslärarens kommentererKursen fick bra omdöme utan att för den skulle anses för lätt. Detta tyder både CEQ-resultatet och resultatet i kursen på. Många fritextsvar indikerar att en ökad tydlighet efterfrågas för att underlätta det kontinuerliga projektarbetet. Dessa förändringar är tänkta att genomföras utifrån det:- Bearbeta instruktionerna för projektuppgift samt individuell uppgift så att det inte finns dubbeltydig information samt att det blir enklare för den enskilde studenten att förstå de centrala arbetsmomenten i respektive projektsteg.- Ställa tidiga krav på organisationen i grupperna för att säkerställa att det finns gemensamma tider för att arbeta i grupperna. Detta kommer att genomföras som ytterligare krav i det initiala gruppkontraktet. Här kommer också en utökad diskussion om rollerna i projektgruppen utifrån intresse och inriktning hos varje enskild student att förstärkas.- Den individuella examinationsuppgiften verkar ha fungerat för alla studenter oavsett program och kommer att se ut på ungefär samma sätt med mindre modifieringar i utformning och instruktion.- Kurslitteraturen kommer att förtydligas ytterligare genom att enbart en bok kommer att ligga till grund för kursinnehållet. Denna kommer att åtföljas av läsanvisningar samt kompletteras med artiklar eller webbaserad information vid behov.Programledarens kommentarerStudenterna är nöjda med kursen och tycker att den är relevant för utbildningen. Det som kom upp under mötet med studenter och kursansvarig är att vissa upplevt arbetsbördan som för hög med många moment som ska hinnas med varje vecka och att vissa moment som fokuserar på den grundläggande designprocessen känns överflödiga för TD-studenterna. Schemaläggning av grupparbetestillfällen, gruppsammansättning och studenternas roller inom grupperna ses över inför nästa tillfälle.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETSN05",
        "name": "Programvaruutveckling för stora system",
        "points": "7.5",
        "year": "17/18",
        "registered": "71",
        "percentPassed": "97%",
        "teachingScore": "-11",
        "goalClearnessScore": "-17",
        "assessmentScore": "+55",
        "workloadScore": "+21",
        "importanceScore": "+80",
        "satisfactionScore": "+20",
        "comments": "Studierådets kommentarerDet var stora problem med administrationen i kursen. Saker såsom kommunikation mellan olika parter, gruppindelning, information som kommer ut för sent var till stora bekymmer. Det är en väldigt stor andel av studenterna som är missnöjda med kursen och administrationen kring den är det stora problemet.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen har ett visst behov av översyn och modernisering.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MAMF50",
        "name": "Användbarhetsutvärdering",
        "points": "7.5",
        "year": "17/18",
        "registered": "32",
        "percentPassed": "97%",
        "teachingScore": "+46",
        "goalClearnessScore": "+45",
        "assessmentScore": "+36",
        "workloadScore": "+63",
        "importanceScore": "+77",
        "satisfactionScore": "+75",
        "comments": "Studierådets kommentarerStudenter hade velat kunna göra en större del av projektet tidigare och kände att kursens upplägg inte gjorde detta möjligt. Utöver detta så var kursen väl genomförd.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerPL, kommentar enbart baserad på arbetsrapporten.Kursen uppskattas av studenterna och verkar fungera mycket bra. Några möjliga förbättringspunkter tas upp, men helhetsbilden är mycket positiv.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      }
    ],
    "Specialisering ssr - System, signaler och reglering": [
      {
        "code": "EITG05",
        "name": "Digital kommunikation",
        "points": "7.5",
        "year": "17/18",
        "registered": "86",
        "percentPassed": "62%",
        "teachingScore": "-3",
        "goalClearnessScore": "+12",
        "assessmentScore": "+49",
        "workloadScore": "+5",
        "importanceScore": "+33",
        "satisfactionScore": "+11",
        "comments": "KommentarerStudierådets kommentarerLaborationen var bra och gav förståelse. Kursen kan förbättras med fler praktiska exempel. Studenterna ansåg att förslaget om att justera föreläsningarnas ordning kan vara bra.Kurslärarens kommentererThis is the first year in which I was giving this course, and I have mostly taken over the content and structure from the previous teacher. Looking at the overall results of the exam, I am quite satisfied. Some students remarked in the evaluation that the questions were very different from the previous years, but the majority was able to adapt well and demonstrate a solid understanding of the material.The students like the laboratories and exercise lessons very much, but would like to have more examples in the lectures to make them more interesting. Unfortunately, we do not have resources for more laboratory hours, but I plan to split the lab into two sessions so that the first one can take place earlier. I am also thinking about including more Matlab examples in the lecture and creating some online quizzes that make the material more accessible.Programledarens kommentarerKursen fungerar bra och lärarna är uppskattade.Det efterlystes att synka övningsledarna så att alla först skulle köra genomgång av teorin innan man gick över till problemlösning - övningarna fick en hel del ros för att de hjälpte till att bygga upp förståelse.Tentamen var lite annorlunda mot tidigare år, vilket störde många studenter. Samtidigt konstaterades att uppgifterna på tentan täcktes väl av kursen. Till nästa år finns en ny extenta att titta på, vilket troligen minskar shockfaktorn något. Helheltsmässigt bedöms \"nya\" tentamen bättre spegla det som bör vara studenternas målbild.Att läraren tog upp konkreta exempel uppskattades, gärna fler sådana till nästa år.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FRTN10",
        "name": "Flervariabel reglering",
        "points": "7.5",
        "year": "17/18",
        "registered": "68",
        "percentPassed": "75%",
        "teachingScore": "+30",
        "goalClearnessScore": "+38",
        "assessmentScore": "+63",
        "workloadScore": "+20",
        "importanceScore": "+70",
        "satisfactionScore": "+52",
        "comments": "KommentarerKursrepresentantens kommentarerI det stora hela har kursen fungerat väldigt bra, och det upplevs inte att något akut behöver förändras. Inför nästa år kommer fokus att läggas på att gå ifrån den nuvarande kursboken (Glad & Ljung) och i stället använda ett kompendium som är mer skräddarsytt för kursens innehåll.Några övriga punkter som tagits upp av studenterna är att det gärna får finnas fler övningsuppgifter på en väldigt grundläggande nivå som introduktion till nya koncept. Det önskas även att utrustning som används i kursen fräschas upp, och fixas. Specifikt gäller det DVD-spelaren som \u0094användes\u0094 som demo under en föreläsning, och processen i laboration 3. I början av denna kursomgången hölls repetitionsseminarier för de som inte läst reglerteknik på ett tag. Dessa var uppskattade, men somliga hade önskat ännu mer repetition, i form av ett repetitions-övningshäfte med väldigt tydliga lösningsförslag. Detta häfte kommer förhoppningsvis kunna sammanställas, och skickas ut till alla kursregistrerade strax innan nästa kursomgång startar, så de har tid att fräscha upp minnet.Både föreläsaren och labb-/övningsledarna upplevs för övrigt ha gjort ett fantastiskt jobb.Kurslärarens kommentererKursen fick överlag ett mycket gott omdöme i år. Repetitionen i början av föreläsningarna uppskattades liksom användandet av Piazza för att ställa frågor. Laborationerna uppskattades för den praktiska förståelsen, även om lab 3 hade vissa tekniska problem. Något som fick viss kritik är hur övningarna är upplagda och även hur/om datorer används för att lösa talen. Vid CEQ-mötet diskuterade vi möjliga förändringar i kursen till nästa år:- Mer föreläsning på svarta tavlan, mindre OH- Färdigställa \"lecture notes\" för att minska behov av läroboken Glad&Ljung- Varva vanliga övningssalar med våra labbsalar för bättre arbetsmiljö- Mer struktur och guidning i manualen till lab 1- Helst en helt ny process till lab 3- Häfte med repetitionsuppgifter för att fräscha upp förkunskaper innan kursen börjarCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN55",
        "name": "Signalseparation - oberoende komponenter",
        "points": "7.5",
        "year": "17/18",
        "registered": "27",
        "percentPassed": "52%",
        "teachingScore": "+60",
        "goalClearnessScore": "+51",
        "assessmentScore": "+70",
        "workloadScore": "+17",
        "importanceScore": "+91",
        "satisfactionScore": "+68",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMSF10",
        "name": "Stationära stokastiska processer",
        "points": "7.5",
        "year": "17/18",
        "registered": "120",
        "percentPassed": "84%",
        "teachingScore": "+29",
        "goalClearnessScore": "+49",
        "assessmentScore": "+53",
        "workloadScore": "+51",
        "importanceScore": "+75",
        "satisfactionScore": "+63",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKursen fungerar väl och PL har valt att CEQ-möte hållas i form av mejlkonversation. Inga kommentarer har inkommit.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN70",
        "name": "Matristeori",
        "points": "6.0",
        "year": "17/18",
        "registered": "53",
        "percentPassed": "75%",
        "teachingScore": "+23",
        "goalClearnessScore": "+34",
        "assessmentScore": "+75",
        "workloadScore": "+11",
        "importanceScore": "+82",
        "satisfactionScore": "+56",
        "comments": "Studierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMNN25",
        "name": "Avancerad kurs i numeriska algoritmer med Python/SciPy",
        "points": "7.5",
        "year": "17/18",
        "registered": "35",
        "percentPassed": "100%",
        "teachingScore": "+51",
        "goalClearnessScore": "+8",
        "assessmentScore": "+73",
        "workloadScore": "+11",
        "importanceScore": "+63",
        "satisfactionScore": "+50",
        "comments": "Studierådets kommentarerKursen upplevdes som intressant och föreläsaren var uppskattad. Redovisningsupplägget var även det uppskattat. Den kritiken som lyfts fram är att uppgifter adderades till inlämningarna som gjorde det svårt för studenterna att planera.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITF50",
        "name": "Introduktion till trådlösa system",
        "points": "7.5",
        "year": "17/18",
        "registered": "49",
        "percentPassed": "82%",
        "teachingScore": "+38",
        "goalClearnessScore": "+42",
        "assessmentScore": "+7",
        "workloadScore": "+31",
        "importanceScore": "+56",
        "satisfactionScore": "+53",
        "comments": "KommentarerStudierådets kommentarerUppskattad kurs bland studenterna och speciellt föreläsaren beröms för sitt engagemang. Laborationerna är också omtyckta av studenterna då de väl speglar kursens innehåll.Kurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MMKF15",
        "name": "Tillämpad Robotteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "43",
        "percentPassed": "40%",
        "teachingScore": "+38",
        "goalClearnessScore": "+5",
        "assessmentScore": "+62",
        "workloadScore": "+18",
        "importanceScore": "+54",
        "satisfactionScore": "+43",
        "comments": "Studierådets kommentarerStudenterna tycker att föreläsare och övningsledare på kursen har varit mycket trevliga, kunniga och hjälpsamma. Kursen har gjort att studenterna fått en inblick i hur deras robotkunskaper fungerar i praktiken och det har varit uppskattat att fått testa mjukvara som används i industrin. Det uppskattas att det är många praktiska moment under kursens gång både i form av laborationer och projektet. Studenterna tycker att informationsflödet och strukturen behöver förbättras då information från ansvariga ofta kom sent. Studenterna önskar att ansvariga till nästa år har gått igenom övningsuppgifterna ordentligt för att kunna ge tydliga uppgiftsbeskrivningar och svar på frågor som uppkommer. Det önskas även en föreläsning eller ett kompendium i terminalspråk vilket hade kunnat ge studenterna bättre förutsättningar inför det kommande projektet i kursen. Studenterna tycker att kursen i sig är superintressant men att den i dagsläget är för ostrukturerad vilket skapar stor frustration då nya lektionstillfällen med kort varsel kan innebära schemakrockar med andra kurser.Kurslärarens kommentererWe are happy to see in the CEQ-answers and submitted comments that thecourse is considered to be very relevant and that there was a largevalue and appreciation in applying the course contents in hands-onlaboratory sessions and in the student projects.We realize the challenge to start early with the projects even ifeverythng is not yet covered in the lectures and exercises, but will try to improve the course information about this to give a better understandinghow the different parts connect already in the beginning of the course.It was also commented that some of the more advances topics from the lectureswere covered only in some project(s) and at the (optional)take-home-exam, but this is a deliberate trade-off. One of the usedmatlab toolboxes had unfortunately changed quite a lot during theyear, which caused problems for some of the computerexercises. Updated exercises are now being prepared for nextyear. Based on the study background, experience, and particularinterest in a certain domain of robotics among the participants, weconsider it to be of large value to offer a number of different topicsfor the course project, but will follow the recommendations to specifythe pre-requisites and expected outcomes for the individual projectsin more detail for next year. It was very nice to see all the demonstrations at the projectpresentation to highlight what can be achieved within the course.CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "FMAN60",
        "name": "Optimering",
        "points": "6.0",
        "year": "17/18",
        "registered": "58",
        "percentPassed": "50%",
        "teachingScore": "+46",
        "goalClearnessScore": "+29",
        "assessmentScore": "+69",
        "workloadScore": "+3",
        "importanceScore": "+85",
        "satisfactionScore": "+35",
        "comments": "Kommentarer har ej inkommet före utsatt tidProgramledarens kommentarerKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MIOA01",
        "name": "Industriell ekonomi, allmän kurs",
        "points": "9.0",
        "year": "17/18",
        "registered": "97",
        "percentPassed": "92%",
        "teachingScore": "+54",
        "goalClearnessScore": "+54",
        "assessmentScore": "+49",
        "workloadScore": "+30",
        "importanceScore": "+84",
        "satisfactionScore": "+78",
        "comments": "KommentarerStudierådets kommentarerKommentarer har ej inkommit före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidProgramledarens kommentarerMycket glädjande att kursen har gått utomordentligt bra i år!CEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "ETTN15",
        "name": "Moderna trådlösa system - LTE och dess efterföljare",
        "points": "7.5",
        "year": "17/18",
        "registered": "8",
        "percentPassed": "100%",
        "teachingScore": "+60",
        "goalClearnessScore": "+36",
        "assessmentScore": "+17",
        "workloadScore": "+19",
        "importanceScore": "+78",
        "satisfactionScore": "+50",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererThis was the first time I taught the course and hence I followed the same course plan as the previous teacher. I learned in the process that I can be more focused on the key topics and cover less of the other topics, in order to improve the students' learning experience. The written CEQ feedback also supports such a change. I will also give more opportunities to the students to discuss the short project and raise questions about it. However, in general, I am quite satisfied with the outcome, as is also indicated by the CEQ feedback.CEQ-enkäten fylldes iCEQ forms were completed during the last lecture of the course."
      },
      {
        "code": "EITN10",
        "name": "Multipelantennsystem",
        "points": "7.5",
        "year": "17/18",
        "registered": "23",
        "percentPassed": "43%",
        "comments": ""
      },
      {
        "code": "EITN35",
        "name": "Projekt i elektro- och informationsteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "1",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "BMEF10",
        "name": "Sensorteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "27",
        "percentPassed": "81%",
        "teachingScore": "+42",
        "goalClearnessScore": "+25",
        "assessmentScore": "+35",
        "workloadScore": "+19",
        "importanceScore": "+63",
        "satisfactionScore": "+44",
        "comments": "Kursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "MION25",
        "name": "Teknologistrategier",
        "points": "7.5",
        "year": "17/18",
        "registered": "47",
        "percentPassed": "87%",
        "teachingScore": "+41",
        "goalClearnessScore": "-5",
        "assessmentScore": "+16",
        "workloadScore": "+38",
        "importanceScore": "+53",
        "satisfactionScore": "+34",
        "comments": "KommentarerKursrepresentantens kommentarerKommentarer har ej inkommet före utsatt tidKurslärarens kommentererKommentarer har ej inkommet före utsatt tidCEQ-enkäten fylldes iWebbenkäter har använts på denna kurs."
      },
      {
        "code": "EITN35",
        "name": "Projekt i elektro- och informationsteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "1",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "EITN35",
        "name": "Projekt i elektro- och informationsteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "1",
        "percentPassed": "100%",
        "comments": ""
      },
      {
        "code": "EITN35",
        "name": "Projekt i elektro- och informationsteknik",
        "points": "7.5",
        "year": "17/18",
        "registered": "1",
        "percentPassed": "100%",
        "comments": ""
      }
    ]
  }
}